define([], function() {
	var exceptionMap = {
		"1000008" : {
			"cause" : "无权限",
			"desc" : "无权限",
			"solution" : "请联系系统管理员."
		},
		"1181002" : {
			"cause" : "VPC不存在",
			"desc" : "VPC不存在",
			"solution" : "请确认VPC是否存在"
		},
		"1200001" : {
			"cause" : "部署服务不存在",
			"desc" : "部署服务不存在",
			"solution" : "请确认VPC下是否已申请部署服务"
		},
		"401001" : {
			"cause" : "脚本（软件/ISO）文件路径为空.",
			"desc" : "脚本（软件/ISO）文件路径为空.",
			"solution" : "请手动输入脚本（软件/ISO）文件的路径."
		},
		"401003" : {
			"cause" : "脚本（软件/ISO）文件的路径非法.",
			"desc" : "脚本（软件/ISO）文件的路径非法.",
			"solution" : "请输入合法的脚本（软件/ISO）文件路径."
		},
		"401007" : {
			"cause" : "脚本（软件/ISO）ID重复.",
			"desc" : "脚本（软件/ISO）ID重复.",
			"solution" : "请联系系统管理员."
		},
		"404004" : {
			"cause" : "脚本（软件/ISO）不存在或者移动失败.",
			"desc" : "脚本（软件/ISO）不存在或者移动失败.",
			"solution" : "请联系系统管理员."
		},
		"404006" : {
			"cause" : "脚本（软件/ISO）文件不存在或者删除失败.",
			"desc" : "脚本（软件/ISO）文件不存在或者删除失败.",
			"solution" : "请联系系统管理员."
		},
		"404008" : {
			"cause" : "脚本（软件/ISO）文件不存在或者查询失败.",
			"desc" : "脚本（软件/ISO）文件不存在或者查询失败.",
			"solution" : "请联系系统管理员."
		},
		"5100001" : {
			"cause" : "缺乏必选参数.",
			"desc" : "缺乏必选参数.",
			"solution" : "请输入必选参数."
		},
		"5100002" : {
			"cause" : "参数非法.",
			"desc" : "参数非法.",
			"solution" : "请修改参数."
		},
		"5100003" : {
			"cause" : "内部服务错误.",
			"desc" : "内部服务错误.",
			"solution" : "请联系系统管理员."
		},
		"5100004" : {
			"cause" : "请求为空",
			"desc" : "请求为空",
			"solution" : "请确认输入请求或参数为有效值"
		},
		"5100005" : {
			"cause" : "输入了非法的分页起始数.",
			"desc" : "输入了非法的分页起始数.",
			"solution" : "请输入合法的分页起始数."
		},
		"5100006" : {
			"cause" : "输入了非法的每页显示数.",
			"desc" : "输入了非法的每页显示数.",
			"solution" : "请输入合法的每页显示数."
		},
		"5100007" : {
			"cause" : "数据库错误.",
			"desc" : "数据库错误.",
			"solution" : "请联系系统管理员."
		},
		"5102721" : {
			"cause" : "查询虚拟机失败",
			"desc" : "查询虚拟机失败",
			"solution" : "请联系系统管理员"
		},
		"5103001" : {
			"cause" : "软件包不存在",
			"desc" : "软件包不存在",
			"solution" : "请确认软件包是否存在"
		},
		"5103002" : {
			"cause" : "资源已经存在.",
			"desc" : "资源已经存在.",
			"solution" : "请联系系统管理员."
		},
		"5103003" : {
			"cause" : "资源类型不存在",
			"desc" : "资源类型不存在",
			"solution" : "请联系系统管理员"
		},
		"5103004" : {
			"cause" : "资源被占用.",
			"desc" : "资源被占用.",
			"solution" : "请联系系统管理员."
		},
		"5103008" : {
			"cause" : "VDC内上传的软件包个数已达到最大值",
			"desc" : "VDC内上传的软件包个数已达到最大值",
			"solution" : "请联系系统管理员"
		},
		"5103009" : {
			"cause" : "上传软件包的总大小已达到最大值",
			"desc" : "上传软件包的总大小已达到最大值",
			"solution" : "请联系系统管理员"
		},
		"5103011" : {
			"cause" : "软件包或脚本正在修复中",
			"desc" : "软件包或脚本正在修复中",
			"solution" : "请稍后重试"
		},
		"5103014" : {
			"cause" : "软件包文件大小超过4G.",
			"desc" : "软件包文件大小超过4G.",
			"solution" : "请选择合适的文件大小."
		},
		"5103015" : {
			"cause" : "文件不存在.",
			"desc" : "文件不存在.",
			"solution" : "请选择存在的文件."
		},
		"5103016" : {
			"cause" : "文件大小超过1MB.",
			"desc" : "文件大小超过1MB.",
			"solution" : "请选择合适的文件大小."
		},
		"5103017" : {
			"cause" : "资源不存在.",
			"desc" : "资源不存在.",
			"solution" : "请联系系统管理员."
		},
		"5103088" : {
			"cause" : "系统上传的软件包总数已达到最大值",
			"desc" : "系统上传的软件包总数已达到最大值",
			"solution" : "请联系系统管理员"
		},
		"5400001" : {
			"cause" : "VM重复选择",
			"desc" : "VM重复选择",
			"solution" : "请去掉重复选择的VM"
		},
		"5400002" : {
			"cause" : "未选择VM",
			"desc" : "未选择VM",
			"solution" : "请至少选择一台VM"
		},
		"5400003" : {
			"cause" : "参数非法",
			"desc" : "参数非法",
			"solution" : "请提供合法的输入参数"
		},
		"5400004" : {
			"cause" : "VM正在安装软件包或执行脚本",
			"desc" : "VM正在安装软件包或执行脚本",
			"solution" : "请稍后重试"
		},
		"5400005" : {
			"cause" : "安装软件包或执行脚本的VM数量已达到最大值",
			"desc" : "安装软件包或执行脚本的VM数量已达到最大值",
			"solution" : "请稍后重试"
		},
		"5410005" : {
			"cause" : "脚本（软件/ISO）不存在.",
			"desc" : "脚本（软件/ISO）不存在.",
			"solution" : "请联系系统管理员."
		},
		"5411001" : {
			"cause" : "名称在数据库中已经存在.",
			"desc" : "名称在数据库中已经存在.",
			"solution" : "请输入其他名称."
		},
		"5411011" : {
			"cause" : "脚本（软件/ISO）数量超出最大数量限制.",
			"desc" : "脚本（软件/ISO）数量超出最大数量限制.",
			"solution" : "请联系系统管理员."
		},
		"5411013" : {
			"cause" : "ISO文件不存在",
			"desc" : "ISO文件不存在",
			"solution" : "请重新上传ISO文件"
		},
		"5411014" : {
			"cause" : "ISO文件后缀名不合法",
			"desc" : "ISO文件后缀名不合法",
			"solution" : "请重新选择ISO文件"
		},
		"5411015" : {
			"cause" : "ISO文件大小超过限制",
			"desc" : "ISO文件大小超过限制",
			"solution" : "请重新选择ISO文件"
		},
		"5103105" : {
			"cause" : "部分虚拟机不存在或者虚拟机状态不是运行态",
			"desc" : "部分虚拟机不存在或者虚拟机状态不是运行态",
			"solution" : "请确保虚拟机都存在并且是运行态的虚拟机"
		},
		"0005201030" : {
			"cause" : "用户ftp账户不存在，请尝试修改密码以触发创建",
			"desc" : "用户ftp账户不存在，请尝试修改密码以触发创建",
			"solution" : "请尝试修改密码已触发创建"
		}
	};
	return exceptionMap;
})