define([], function() {
			var exceptionMap = {
				"0000000001" : {
					"cause" : "系统内部错误。",
					"desc" : "系统内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0000010002" : {
					"cause" : "参数不合法。",
					"desc" : "参数不合法。",
					"solution" : "请输入合法参数。"
				},
				"0000010006" : {
					"cause" : "无法处理请求实体，请求实体包含非法字符",
					"desc" : "无法处理请求实体，请求实体包含非法字符",
					"solution" : "请输入合法参数。"
				},
				"0000010007": {
                "cause":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                "desc":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                "solution":"请检查虚拟化环境接入信息是否输入正确。"
                },	
				"0000010008" : {
					"cause" : "待迁移的虚拟机不在同一虚拟化环境，无法迁移。",
					"desc" : "待迁移的虚拟机不在同一虚拟化环境，无法迁移。",
					"solution" : "请输入同一虚拟化环境的虚拟机。"
				},
				"0000010009" : {
					"cause" : "虚拟机网卡超出上限值。",
					"desc" : "虚拟机网卡超出上限值。",
					"solution" : "请输入合法参数。"
				},
				"0000010010" : {
					"cause" : "对象不在域中。",
					"desc" : "对象不在域中。",
					"solution" : "请检查对象是否存在于域中。"
				},
				"0000010011" : {
					"cause" : "上传的文件类型不支持。",
					"desc" : "上传的文件类型不支持。",
					"solution" : "请检查上传的文件类型是否正确。"
				},
				"0000010012" : {
					"cause" : "上传的文件大小超过限制。",
					"desc" : "上传的文件大小超过限制。",
					"solution" : "请检查上传的文件是否正确。"
				},
				"1000020": {
                    "cause":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                    "desc":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                    "solution":"请检查虚拟化环境接入信息是否输入正确。"
                },
				"0000030004" : {
					"cause" : "用户名或密码不正确。",
					"desc" : "用户名或密码不正确。",
					"solution" : "请输入正确的用户名和密码。"
				},
				"0005101003" : {
					"cause" : "VSA虚拟机模板不存在。",
					"desc" : "VSA虚拟机模板不存在。",
					"solution" : "请发现VSA虚拟机模板。"
				},
				"0005104001" : {
					"cause" : "虚拟化环境上发现的DVS不允许删除。",
					"desc" : "虚拟化环境上发现的DVS不允许删除。",
					"solution" : "虚拟化环境上发现的DVS不允许删除。"
				},
                "0005104002" : {
					"cause" : "网络资源操作鉴权失败。",
					"desc" : "网络资源操作鉴权失败。",
					"solution" : "请联系技术支持工程师或阅读帮助文档。"
				},
				"1000001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000002" : {
					"cause" : "数据库连接异常。",
					"desc" : "数据库连接异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000008" : {
					"cause" : "没有该操作的权限。",
					"desc" : "没有该操作的权限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000009" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000010" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请检查输入信息是否正确。"
				},
				"1000011" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000015" : {
					"cause" : "系统与UHM断连，正在重试，请稍候。",
					"desc" : "系统与UHM断连，正在重试，请稍候。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000016" : {
					"cause" : "系统与VRM断连，正在重试，请稍候。",
					"desc" : "系统与VRM断连，正在重试，请稍候。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000017" : {
					"cause" : "系统与数据库断连，正在重试，请稍候。",
					"desc" : "系统与数据库断连，正在重试，请稍候。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000018" : {
					"cause" : "请求的资源总数已经超过资源配额上限。",
					"desc" : "请求的资源总数已经超过资源配额上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000019" : {
					"cause" : "适配包上传失败，文件名包含非法字符。(; | & $ > <)",
					"desc" : "适配包上传失败，文件名包含非法字符。(; | & $ > <)",
					"solution" : "请联系技术支持工程师。"
				},
				"1000021" : {
					"cause" : "参数内容超出长度限制。",
					"desc" : "参数内容超出长度限制。",
					"solution" : "请检查浏览器的JavaScript是否打开或请联系技术支持工程师。"
				},
				"1000022" : {
					"cause" : "连接异常，请检查IP或者端口是否正确。",
					"desc" : "连接异常，请检查IP或者端口是否正确。",
					"solution" : "请检查IP地址是否正确和桌面服务系统是否正常。"
				},
				"1000023" : {
					"cause" : "用户名或者密码有误，请检查。",
					"desc" : "用户名或者密码有误，请检查。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000024" : {
					"cause" : "VRM版本号错误。",
					"desc" : "VRM版本号错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000025" : {
					"cause" : "操作超时。",
					"desc" : "操作超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000026" : {
					"cause" : "Vmware内部错误，查询任务失败原因失败。",
					"desc" : "Vmware内部错误，查询任务失败原因失败。",
					"solution" : "请登录vsphere， 确认相关操作是否执行成功。"
				},
				"1000027" : {
					"cause" : "虚拟化环境[{0}]连接状态不为成功。",
					"desc" : "虚拟化环境[{0}]连接状态不为成功。",
					"solution" : "待虚拟化环境连接状态成功后重试。"
				},
				"1000028" : {
					"cause" : "虚拟化环境[{0}]设置语言不合法。",
					"desc" : "虚拟化环境[{0}]设置语言不合法。",
					"solution" : "请选择合适的语言进行设置。"
				},
				"1000029" : {
					"cause" : "虚拟化环境[{0}]设置语言失败。",
					"desc" : "虚拟化环境[{0}]设置语言失败。",
					"solution" : "请联系技术支持工程师。"
				},
                "1000030": {
                "cause":"虚拟化环境连接异常，请查看连接状态正常后重试。",
                "desc":"虚拟化环境连接异常，请查看连接状态正常后重试。",
                "solution":"请输入正确的虚拟化环境连接信息。"
                },
				"1000031" : {
					"cause" : "用户名或密码错误。",
					"desc" : "用户名或密码错误。",
					"solution" : "请修改用户名或密码。"
				},
				"1000032" : {
					"cause" : "密码三次输入错误，帐户锁定5分钟。",
					"desc" : "密码三次输入错误，帐户锁定5分钟。",
					"solution" : "请等待5分钟再重试。"
				},
				"1000033" : {
					"cause" : "帐户锁定中,再次登陆系统请等待5分钟。",
					"desc" : "帐户锁定中,再次登陆系统请等待5分钟。",
					"solution" : "请等待5分钟。"
				},
				"1000034" : {
					"cause" : "用户不存在。",
					"desc" : "用户不存在。",
					"solution" : "请修改用户名。"
				},
				"1000102" : {
					"cause" : "修改管理子网正在进行，请稍后重试。",
					"desc" : "修改管理子网正在进行，请稍后重试。",
					"solution" : "修改管理子网过快，请检查网络是否修改完成才可再次修改。"
				},
				"1000300" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000301" : {
					"cause" : "用户ID无效。",
					"desc" : "用户ID无效。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000302" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000303" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000304" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000305" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000306" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000307" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000308" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000309" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000310" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000311" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000312" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000313" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000500" : {
					"cause" : "操作对象不存在。",
					"desc" : "操作对象不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000600" : {
					"cause" : "无效的子网掩码。",
					"desc" : "无效的子网掩码。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000700" : {
					"cause" : "网络通信异常。",
					"desc" : "网络通信异常。",
					"solution" : "请稍候重试。"
				},
				"1001001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001002" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001005" : {
					"cause" : "系统正在恢复中，请稍后重试。",
					"desc" : "系统正在恢复中，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001006" : {
					"cause" : "系统繁忙，请稍后重试。",
					"desc" : "系统繁忙，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001007" : {
					"cause" : "系统繁忙，请稍后重试。",
					"desc" : "系统繁忙，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001008" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001009" : {
					"cause" : "系统中该对象的状态冲突。",
					"desc" : "系统中该对象的状态冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001010" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001011" : {
					"cause" : "参数不合法。",
					"desc" : "参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001012" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1001086" : {
					"cause" : "虚拟机规则冲突，请检查后重新配置。",
					"desc" : "虚拟机规则冲突，请检查后重新配置。",
					"solution" : "请检查虚拟机规则配置后重试。"
				},
				"1001087" : {
					"cause" : "解析OVF文件失败,请检查OVF文件格式是否正确。",
					"desc" : "解析OVF文件失败,请检查OVF文件格式是否正确。",
					"solution" : "请检查OVF文件格式是否正确。"
				},
				"1002000" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002001" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002002" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002004" : {
					"cause" : "任务不存在。",
					"desc" : "任务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002005" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请检查虚拟机是否存在再操作。"
				},
				"1002006" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002007" : {
					"cause" : "系统中该对象的状态冲突。",
					"desc" : "系统中该对象的状态冲突。",
					"solution" : "请检查对象状态或稍后重试。"
				},
				"1002013" : {
					"cause" : "入参不合法。",
					"desc" : "入参不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002015" : {
					"cause" : "入参名称不合法。",
					"desc" : "入参名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002016" : {
					"cause" : "创建或挂载的磁盘不支持容灾，请联系系统管理员。",
					"desc" : "创建或挂载的磁盘不支持容灾，请联系系统管理员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002017" : {
					"cause" : "上限值的取值范围是1～100。",
					"desc" : "上限值的取值范围是1～100。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002018" : {
					"cause" : "占位虚拟机不允许当前操作。",
					"desc" : "占位虚拟机不允许当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002019" : {
					"cause" : "“描述”参数不合法。",
					"desc" : "“描述”参数不合法。",
					"solution" : "“描述”参数不合法，请重新输入。"
				},
				"1002020" : {
					"cause" : "容灾虚拟机不允许当前操作。",
					"desc" : "容灾虚拟机不允许当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002022" : {
					"cause" : "入参IP地址不合法。",
					"desc" : "入参IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002023" : {
					"cause" : "入参不合法。",
					"desc" : "入参不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002024" : {
					"cause" : "“偏移”参数不合法。",
					"desc" : "“偏移”参数不合法。",
					"solution" : "“偏移”参数不合法，请重新输入。"
				},
				"1002025" : {
					"cause" : "端口的取值范围是1～65535间的整数。",
					"desc" : "端口的取值范围是1～65535间的整数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002026" : {
					"cause" : "用户手机号码格式错误。",
					"desc" : "用户手机号码格式错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002027" : {
					"cause" : "用户Email格式错误。",
					"desc" : "用户Email格式错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002028" : {
					"cause" : "用户描述长度错误。",
					"desc" : "用户描述长度错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002029" : {
					"cause" : "用户名已经存在。",
					"desc" : "用户名已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002030" : {
					"cause" : "用户选择角色不存在。",
					"desc" : "用户选择角色不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002031" : {
					"cause" : "修改用户失败。",
					"desc" : "修改用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002032" : {
					"cause" : "用户名长度错误。",
					"desc" : "用户名长度错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002033" : {
					"cause" : "用户名字符错误。",
					"desc" : "用户名字符错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002034" : {
					"cause" : "添加用户失败。",
					"desc" : "添加用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002035" : {
					"cause" : "不可删除当前用户本身。",
					"desc" : "不可删除当前用户本身。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002036" : {
					"cause" : "默认超级管理员不可被删除。",
					"desc" : "默认超级管理员不可被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002037" : {
					"cause" : "删除用户失败。",
					"desc" : "删除用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002038" : {
					"cause" : "修改密码错误。",
					"desc" : "修改密码错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002039" : {
					"cause" : "禁止修改其他用户密码。",
					"desc" : "禁止修改其他用户密码。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002040" : {
					"cause" : "原始密码不正确。",
					"desc" : "原始密码不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002041" : {
					"cause" : "域用户密码不可更改。",
					"desc" : "域用户密码不可更改。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002042" : {
					"cause" : "未到允许修改密码的时间。",
					"desc" : "未到允许修改密码的时间。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002043" : {
					"cause" : "密码已使用过。",
					"desc" : "密码已使用过。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002044" : {
					"cause" : "重置密码失败。",
					"desc" : "重置密码失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002045" : {
					"cause" : "查询用户失败。",
					"desc" : "查询用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002046" : {
					"cause" : "修改密码的最短时间间隔非法。",
					"desc" : "修改密码的最短时间间隔非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002047" : {
					"cause" : "密码有效期非法。",
					"desc" : "密码有效期非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002048" : {
					"cause" : "修改是否强制修改密码非法。",
					"desc" : "修改是否强制修改密码非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002049" : {
					"cause" : "密码重复使用次数非法。",
					"desc" : "密码重复使用次数非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002050" : {
					"cause" : "密码到期提前提示非法。",
					"desc" : "密码到期提前提示非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002051" : {
					"cause" : "密码已经到期。",
					"desc" : "密码已经到期。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002052" : {
					"cause" : "获取密码策略失败。",
					"desc" : "获取密码策略失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002053" : {
					"cause" : "修改密码策略失败。",
					"desc" : "修改密码策略失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002054" : {
					"cause" : "域信息的IP地址不合法。",
					"desc" : "域信息的IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002055" : {
					"cause" : "域信息的domain太长。",
					"desc" : "域信息的domain太长。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002056" : {
					"cause" : "该角色已存在。",
					"desc" : "该角色已存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002057" : {
					"cause" : "该角色不存在。",
					"desc" : "该角色不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002058" : {
					"cause" : "角色正在使用。",
					"desc" : "角色正在使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002059" : {
					"cause" : "所选权限不存在。",
					"desc" : "所选权限不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002060" : {
					"cause" : "创建角色失败。",
					"desc" : "创建角色失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002061" : {
					"cause" : "角色名非法。",
					"desc" : "角色名非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002062" : {
					"cause" : "角色描述非法。",
					"desc" : "角色描述非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002063" : {
					"cause" : "修改角色失败。",
					"desc" : "修改角色失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002064" : {
					"cause" : "服务器IP地址不合法。",
					"desc" : "服务器IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002065" : {
					"cause" : "服务器IP地址已经存在。",
					"desc" : "服务器IP地址已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002066" : {
					"cause" : "BMC IP地址不合法。",
					"desc" : "BMC IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002067" : {
					"cause" : "BMC用户名不合法。",
					"desc" : "BMC用户名不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002068" : {
					"cause" : "BMC密码不合法。",
					"desc" : "BMC密码不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002069" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002070" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002071" : {
					"cause" : "服务器处于维护模式，不能新增虚拟机。",
					"desc" : "服务器处于维护模式，不能新增虚拟机。",
					"solution" : "请退出维护模式再重试。"
				},
				"1002072" : {
					"cause" : "服务器状态不能进行当前操作。",
					"desc" : "服务器状态不能进行当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002073" : {
					"cause" : "BMC IP地址不可达。",
					"desc" : "BMC IP地址不可达。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002074" : {
					"cause" : "BMC用户名为空。",
					"desc" : "BMC用户名为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002075" : {
					"cause" : "BMC密码为空。",
					"desc" : "BMC密码为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002076" : {
					"cause" : "服务器已开机。",
					"desc" : "服务器已开机。",
					"solution" : "请确认服务器状态。"
				},
				"1002077" : {
					"cause" : "服务器已关机。",
					"desc" : "服务器已关机。",
					"solution" : "请确认服务器状态。"
				},
				"1002078" : {
					"cause" : "服务器已关机，不可重启。",
					"desc" : "服务器已关机，不可重启。",
					"solution" : "请直接启动服务器。"
				},
				"1002079" : {
					"cause" : "服务器安全重启或安全下电的时候必须保证服务器上的虚拟机都处于关闭状态。",
					"desc" : "服务器安全重启或安全下电的时候必须保证服务器上的虚拟机都处于关闭状态。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002080" : {
					"cause" : "BMC IP地址为空。",
					"desc" : "BMC IP地址为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002081" : {
					"cause" : "服务器通信异常。",
					"desc" : "服务器通信异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002082" : {
					"cause" : "虚拟机CPU数量不合法。",
					"desc" : "虚拟机CPU数量不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002083" : {
					"cause" : "CPU份额值不合法。",
					"desc" : "CPU份额值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002084" : {
					"cause" : "CPU上限值不合法。",
					"desc" : "CPU上限值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002085" : {
					"cause" : "虚拟机内存大小不合法。",
					"desc" : "虚拟机内存大小不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002086" : {
					"cause" : "虚拟机内存份额值不合法。",
					"desc" : "虚拟机内存份额值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002087" : {
					"cause" : "硬盘编号不合法。",
					"desc" : "硬盘编号不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002088" : {
					"cause" : "虚拟机硬盘大小不合法。",
					"desc" : "虚拟机硬盘大小不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002089" : {
					"cause" : "虚拟机硬盘超过最大数量。",
					"desc" : "虚拟机硬盘超过最大数量。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002090" : {
					"cause" : "批量创建的虚拟机数大于30。",
					"desc" : "批量创建的虚拟机数大于30。",
					"solution" : "请联系管理员。"
				},
				"1002091" : {
					"cause" : "虚拟机网卡端口组为空。",
					"desc" : "虚拟机网卡端口组为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002092" : {
					"cause" : "虚拟机网卡数量超过最大限制。",
					"desc" : "虚拟机网卡数量超过最大限制。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002093" : {
					"cause" : "虚拟机启动配置不合法。",
					"desc" : "虚拟机启动配置不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002094" : {
					"cause" : "虚拟机故障处理策略不合法。",
					"desc" : "虚拟机故障处理策略不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002095" : {
					"cause" : "源服务器和目的服务器不能相同。",
					"desc" : "源服务器和目的服务器不能相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002096" : {
					"cause" : "Tools未安装或未运行。",
					"desc" : "Tools未安装或未运行。",
					"solution" : "请先安装并启动Tools后再重试。"
				},
				"1002097" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002098" : {
					"cause" : "服务器不存在。",
					"desc" : "服务器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002099" : {
					"cause" : "指定的资源集群不存在。",
					"desc" : "指定的资源集群不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002100" : {
					"cause" : "资源集群下存在虚拟机。",
					"desc" : "资源集群下存在虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002101" : {
					"cause" : "资源集群下存在服务器。",
					"desc" : "资源集群下存在服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002102" : {
					"cause" : "超出系统支持的资源集群数量最大限制（32个）。",
					"desc" : "超出系统支持的资源集群数量最大限制（32个）。",
					"solution" : "系统最多支持32个集群，如果新增，需要删除不再需要的集群。"
				},
				"1002103" : {
					"cause" : "主机上存在不能自动迁移的虚拟机或者集群资源不足。",
					"desc" : "主机上存在不能自动迁移的虚拟机或者集群资源不足。",
					"solution" : "请检查后重试。"
				},
				"1002104" : {
					"cause" : "虚拟机已挂载光驱。",
					"desc" : "虚拟机已挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002105" : {
					"cause" : "虚拟机未挂载光驱。",
					"desc" : "虚拟机未挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002106" : {
					"cause" : "共享URL不合法。",
					"desc" : "共享URL不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002107" : {
					"cause" : "磁盘未挂载到此虚拟机。",
					"desc" : "磁盘未挂载到此虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002108" : {
					"cause" : "虚拟机已挂载光驱。",
					"desc" : "虚拟机已挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002109" : {
					"cause" : "虚拟机未挂载光驱。",
					"desc" : "虚拟机未挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002110" : {
					"cause" : "虚拟机内存limit不合法。",
					"desc" : "虚拟机内存limit不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002111" : {
					"cause" : "操作系统类型不正确。",
					"desc" : "操作系统类型不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002112" : {
					"cause" : "操作系统版本不正确。",
					"desc" : "操作系统版本不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002113" : {
					"cause" : "虚拟机CPU预留值不合法。",
					"desc" : "虚拟机CPU预留值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002114" : {
					"cause" : "虚拟机内存预留值不合法。",
					"desc" : "虚拟机内存预留值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002115" : {
					"cause" : "MAC地址重复，创建虚拟机/添加网卡失败。",
					"desc" : "MAC地址重复，创建虚拟机/添加网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002116" : {
					"cause" : "释放MAC出错，删除网卡失败。",
					"desc" : "释放MAC出错，删除网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002117" : {
					"cause" : "MAC资源不足，创建虚拟机/添加网卡失败。",
					"desc" : "MAC资源不足，创建虚拟机/添加网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002118" : {
					"cause" : "虚拟机域信息长度超过1024字节。",
					"desc" : "虚拟机域信息长度超过1024字节。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002119" : {
					"cause" : "磁盘被虚拟机使用中。",
					"desc" : "磁盘被虚拟机使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002120" : {
					"cause" : "移动服务器时原资源集群和目标资源集群相同。",
					"desc" : "移动服务器时原资源集群和目标资源集群相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002121" : {
					"cause" : "MAC地址不合法。",
					"desc" : "MAC地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002122" : {
					"cause" : "共享磁盘不允许创建快照。",
					"desc" : "共享磁盘不允许创建快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002123" : {
					"cause" : "位置不能为空。",
					"desc" : "位置不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002124" : {
					"cause" : "存储标识不能为空。",
					"desc" : "存储标识不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002125" : {
					"cause" : "操作系统类型不能为空。",
					"desc" : "操作系统类型不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002126" : {
					"cause" : "快照状态不允许该操作。",
					"desc" : "快照状态不允许该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002127" : {
					"cause" : "硬盘插槽号不能重复。",
					"desc" : "硬盘插槽号不能重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002129" : {
					"cause" : "资源集群内最多只能有128个服务器。",
					"desc" : "资源集群内最多只能有128个服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002130" : {
					"cause" : "虚拟机快照不存在。",
					"desc" : "虚拟机快照不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002131" : {
					"cause" : "虚拟机快照不存在。",
					"desc" : "虚拟机快照不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002132" : {
					"cause" : "快照任务正在进行中，单个虚拟机不能同时做多个快照。",
					"desc" : "快照任务正在进行中，单个虚拟机不能同时做多个快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002133" : {
					"cause" : "目标节点/资源集群不能满足虚拟机运行的存储条件。",
					"desc" : "目标节点/资源集群不能满足虚拟机运行的存储条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002134" : {
					"cause" : "目标节点/资源集群不能满足虚拟机运行的网络条件。",
					"desc" : "目标节点/资源集群不能满足虚拟机运行的网络条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002135" : {
					"cause" : "虚拟机快照数超过限制。",
					"desc" : "虚拟机快照数超过限制。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002136" : {
					"cause" : "该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了，或磁盘状态不允许绑定虚拟机。",
					"desc" : "该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了，或磁盘状态不允许绑定虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002137" : {
					"cause" : "单个虚拟机绑定共享磁盘个数达到上限。",
					"desc" : "单个虚拟机绑定共享磁盘个数达到上限。",
					"solution" : "请尝试添加非共享磁盘。"
				},
				"1002138" : {
					"cause" : "磁盘已经挂载到此虚拟机上，不能重复挂载。",
					"desc" : "磁盘已经挂载到此虚拟机上，不能重复挂载。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002139" : {
					"cause" : "休眠态虚拟机必须创建内存快照，请勾选内存快照后重试。",
					"desc" : "休眠态虚拟机必须创建内存快照，请勾选内存快照后重试。",
					"solution" : "请勾选内存快照后重试。"
				},
				"1002140" : {
					"cause" : "端口组长度不合法。",
					"desc" : "端口组长度不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002141" : {
					"cause" : "需要挂载的磁盘不存在。",
					"desc" : "需要挂载的磁盘不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002142" : {
					"cause" : "将虚拟机克隆为模板虚拟机时，不能有磁盘存在。",
					"desc" : "将虚拟机克隆为模板虚拟机时，不能有磁盘存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002143" : {
					"cause" : "资源集群下存在处于“启动中”、“迁移中”等暂态的虚拟机。",
					"desc" : "资源集群下存在处于“启动中”、“迁移中”等暂态的虚拟机。",
					"solution" : "请确认资源集群下所有虚拟机的状态再重试。"
				},
				"1002144" : {
					"cause" : "集群下存在使用iNIC网卡的主机，不能开启集群内存复用开关。",
					"desc" : "集群下存在使用iNIC网卡的主机，不能开启集群内存复用开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002145" : {
					"cause" : "资源集群下存在虚拟机内存预留值小于内存规格的虚拟机。",
					"desc" : "资源集群下存在虚拟机内存预留值小于内存规格的虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002146" : {
					"cause" : "指定位置下不存在存储条件满足虚拟机启动的节点。",
					"desc" : "指定位置下不存在存储条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002147" : {
					"cause" : "指定位置下不存在网络条件满足虚拟机启动的节点。",
					"desc" : "指定位置下不存在网络条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002148" : {
					"cause" : "修改资源集群数据库失败。",
					"desc" : "修改资源集群数据库失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002149" : {
					"cause" : "资源集群内存复用开关为开所以迁移服务器失败。",
					"desc" : "资源集群内存复用开关为开所以迁移服务器失败。",
					"solution" : "请资源集群内存复用开关再重试。"
				},
				"1002150" : {
					"cause" : "目的节点状态不支持迁移。",
					"desc" : "目的节点状态不支持迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002151" : {
					"cause" : "目的节点存储或网络不支持虚拟机运行。",
					"desc" : "目的节点存储或网络不支持虚拟机运行。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002152" : {
					"cause" : "源节点或目的节点已经超过迁移并发数。",
					"desc" : "源节点或目的节点已经超过迁移并发数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002153" : {
					"cause" : "资源集群内迁移中的虚拟机数量最大个数是40个。",
					"desc" : "资源集群内迁移中的虚拟机数量最大个数是40个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002154" : {
					"cause" : "输入参数非法。",
					"desc" : "输入参数非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002155" : {
					"cause" : "指定虚拟机不是链接克隆虚拟机。",
					"desc" : "指定虚拟机不是链接克隆虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002156" : {
					"cause" : "系统正在连接指定存储资源。",
					"desc" : "系统正在连接指定存储资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002157" : {
					"cause" : "存储类型错误。",
					"desc" : "存储类型错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002158" : {
					"cause" : "存储资源不足。",
					"desc" : "存储资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002159" : {
					"cause" : "存储不存在。",
					"desc" : "存储不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002160" : {
					"cause" : "存储器不存在。",
					"desc" : "存储器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002161" : {
					"cause" : "查询条件错误。",
					"desc" : "查询条件错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002162" : {
					"cause" : "存储设备错误。",
					"desc" : "存储设备错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002163" : {
					"cause" : "存储资源已经存在。",
					"desc" : "存储资源已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002164" : {
					"cause" : "存储资源不存在。",
					"desc" : "存储资源不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002165" : {
					"cause" : "存储资源正在使用中。",
					"desc" : "存储资源正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002166" : {
					"cause" : "存储IP地址正在使用中。",
					"desc" : "存储IP地址正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002167" : {
					"cause" : "没有发现存储器。",
					"desc" : "没有发现存储器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002168" : {
					"cause" : "存储正在使用中。",
					"desc" : "存储正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002169" : {
					"cause" : "存储资源名称重复。",
					"desc" : "存储资源名称重复。",
					"solution" : "请修改存储资源名称再重试。"
				},
				"1002170" : {
					"cause" : "磁盘类型错误。",
					"desc" : "磁盘类型错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002171" : {
					"cause" : "磁盘不存在或者当前磁盘已被删除。",
					"desc" : "磁盘不存在或者当前磁盘已被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002172" : {
					"cause" : "磁盘状态不为使用中。",
					"desc" : "磁盘状态不为使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002173" : {
					"cause" : "磁盘大小非法。",
					"desc" : "磁盘大小非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002174" : {
					"cause" : "批量查询磁盘个数错误。",
					"desc" : "批量查询磁盘个数错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002175" : {
					"cause" : "磁盘正在被挂载中。",
					"desc" : "磁盘正在被挂载中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002176" : {
					"cause" : "子网不存在。",
					"desc" : "子网不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002177" : {
					"cause" : "VLAN ID不合法。",
					"desc" : "VLAN ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002178" : {
					"cause" : "子网数量最大值为50个。",
					"desc" : "子网数量最大值为50个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002179" : {
					"cause" : "子网地址不合法。",
					"desc" : "子网地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002180" : {
					"cause" : "子网地址段冲突。",
					"desc" : "子网地址段冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002181" : {
					"cause" : "子网掩码不合法。",
					"desc" : "子网掩码不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002182" : {
					"cause" : "网关不合法。",
					"desc" : "网关不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002183" : {
					"cause" : "保留IP不能包含网关。",
					"desc" : "保留IP不能包含网关。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002184" : {
					"cause" : "子网预留IP地址段有重叠。",
					"desc" : "子网预留IP地址段有重叠。",
					"solution" : "请确保子网保留IP地址段没有重叠。"
				},
				"1002185" : {
					"cause" : "预留IP地址段有重叠。",
					"desc" : "预留IP地址段有重叠。",
					"solution" : "请确保保留IP地址段没有重叠。"
				},
				"1002186" : {
					"cause" : "DHCP服务器的首选DNS服务器不合法。",
					"desc" : "DHCP服务器的首选DNS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002187" : {
					"cause" : "DHCP服务器的备用DNS服务器不合法。",
					"desc" : "DHCP服务器的备用DNS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002189" : {
					"cause" : "DHCP服务器的域名不合法。",
					"desc" : "DHCP服务器的域名不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002190" : {
					"cause" : "子网已被关联端口组，不能被删除。",
					"desc" : "子网已被关联端口组，不能被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002191" : {
					"cause" : "DHCP服务器的首选WINS服务器不合法。",
					"desc" : "DHCP服务器的首选WINS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002192" : {
					"cause" : "DHCP服务器的备用WINS服务器不合法。",
					"desc" : "DHCP服务器的备用WINS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002193" : {
					"cause" : "保留IP地址段结束地址不能小于起始地址。",
					"desc" : "保留IP地址段结束地址不能小于起始地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002194" : {
					"cause" : "保留IP必须在子网的范围内。",
					"desc" : "保留IP必须在子网的范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002195" : {
					"cause" : "网关必须在子网的范围内。",
					"desc" : "网关必须在子网的范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002196" : {
					"cause" : "修改子网属性，需要关闭子网内所有虚拟机。",
					"desc" : "修改子网属性，需要关闭子网内所有虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002197" : {
					"cause" : "虚拟交换机类型不合法。",
					"desc" : "虚拟交换机类型不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002198" : {
					"cause" : "VLAN池不能为空。",
					"desc" : "VLAN池不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002199" : {
					"cause" : "虚拟机模板不允许创建快照。",
					"desc" : "虚拟机模板不允许创建快照。",
					"solution" : "请转换为虚拟机后重试。"
				},
				"1002200" : {
					"cause" : "VLAN ID取值范围是2～4094。",
					"desc" : "VLAN ID取值范围是2～4094。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002201" : {
					"cause" : "该虚拟机为链接克隆虚拟机，不允许创建快照。",
					"desc" : "该虚拟机为链接克隆虚拟机，不允许创建快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002202" : {
					"cause" : "起始VLAN ID小于结束VLAN ID。",
					"desc" : "起始VLAN ID小于结束VLAN ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002203" : {
					"cause" : "起始VLAN ID要小于等于结束VLAN ID。",
					"desc" : "起始VLAN ID要小于等于结束VLAN ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002205" : {
					"cause" : "VLAN池之间不能重叠。",
					"desc" : "VLAN池之间不能重叠。",
					"solution" : "请确保VLAN池之间没有重叠。"
				},
				"1002206" : {
					"cause" : "虚拟机交换机不存在。",
					"desc" : "虚拟机交换机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002207" : {
					"cause" : "服务器端口不能为空。",
					"desc" : "服务器端口不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002209" : {
					"cause" : "上行端口不存在。",
					"desc" : "上行端口不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002210" : {
					"cause" : "上行端口已被使用。",
					"desc" : "上行端口已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002211" : {
					"cause" : "上行端口网卡类型与虚拟交换机类型不同。",
					"desc" : "上行端口网卡类型与虚拟交换机类型不同。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002212" : {
					"cause" : "上行端口聚合不存在。",
					"desc" : "上行端口聚合不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002213" : {
					"cause" : "上行端口聚合已被使用。",
					"desc" : "上行端口聚合已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002214" : {
					"cause" : "虚拟机交换机内的服务器不能重叠。",
					"desc" : "虚拟机交换机内的服务器不能重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002215" : {
					"cause" : "VLAN池不存在。",
					"desc" : "VLAN池不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002216" : {
					"cause" : "VLAN池被使用。",
					"desc" : "VLAN池被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002217" : {
					"cause" : "端口组存在，不能删除虚拟机交换机。",
					"desc" : "端口组存在，不能删除虚拟机交换机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002218" : {
					"cause" : "虚拟机交换机内有上行端口。",
					"desc" : "虚拟机交换机内有上行端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002219" : {
					"cause" : "虚拟机交换机内有上行端口聚合s。",
					"desc" : "虚拟机交换机内有上行端口聚合s。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002220" : {
					"cause" : "带宽限速不能小于0。",
					"desc" : "带宽限速不能小于0。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002221" : {
					"cause" : "带宽限速必须满足限速间隔。",
					"desc" : "带宽限速必须满足限速间隔。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002222" : {
					"cause" : "子网ID和VLAN ID只能二选一。",
					"desc" : "子网ID和VLAN ID只能二选一。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002224" : {
					"cause" : "VLAN在VLAN池内不存在。",
					"desc" : "VLAN在VLAN池内不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002225" : {
					"cause" : "端口组选择的子网对应VLAN不在VLAN池内。",
					"desc" : "端口组选择的子网对应VLAN不在VLAN池内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002227" : {
					"cause" : "虚拟机网卡端口组不存在。",
					"desc" : "虚拟机网卡端口组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002228" : {
					"cause" : "端口组不属于此虚拟机交换机。",
					"desc" : "端口组不属于此虚拟机交换机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002229" : {
					"cause" : "该网络内有虚拟机，无法删除。",
					"desc" : "该网络内有虚拟机，无法删除。",
					"solution" : "请先删除该路由网络下的虚拟机，然后再试。"
				},
				"1002230" : {
					"cause" : "端口组关联子网失败。",
					"desc" : "端口组关联子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002231" : {
					"cause" : "端口组关联子网失败。",
					"desc" : "端口组关联子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002232" : {
					"cause" : "端口组ID不合法。",
					"desc" : "端口组ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002233" : {
					"cause" : "优先级和上限带宽必须同时为空，或者同时不为空。",
					"desc" : "优先级和上限带宽必须同时为空，或者同时不为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002234" : {
					"cause" : "获取子网信息失败。",
					"desc" : "获取子网信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002235" : {
					"cause" : "端口组内的VM没有关闭。",
					"desc" : "端口组内的VM没有关闭。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002236" : {
					"cause" : "修改端口组属性，需要关闭端口组内所有虚拟机。",
					"desc" : "修改端口组属性，需要关闭端口组内所有虚拟机。",
					"solution" : "请到当前集群“虚拟机”页面，点击“高级”，输入端口组编号，查看该端口组对应的虚拟机。"
				},
				"1002237" : {
					"cause" : "上行端口ID不合法。",
					"desc" : "上行端口ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002238" : {
					"cause" : "上行端口不唯一。",
					"desc" : "上行端口不唯一。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002239" : {
					"cause" : "上行端口的状态不合法。",
					"desc" : "上行端口的状态不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002240" : {
					"cause" : "聚合策略不合法。",
					"desc" : "聚合策略不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002241" : {
					"cause" : "上行端口聚合ID不合法。",
					"desc" : "上行端口聚合ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002242" : {
					"cause" : "上行端口聚合的名称不合法。",
					"desc" : "上行端口聚合的名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002243" : {
					"cause" : "上行端口聚合的描述不合法。",
					"desc" : "上行端口聚合的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002244" : {
					"cause" : "创建上行端口聚合使用的上行端口数目的取值范围是1～8。",
					"desc" : "创建上行端口聚合使用的上行端口数目的取值范围是1～8。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002245" : {
					"cause" : "不能跨iNic网卡创建上行端口聚合。",
					"desc" : "不能跨iNic网卡创建上行端口聚合。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002247" : {
					"cause" : "创建上行端口聚合使用的上行端口有重复的。",
					"desc" : "创建上行端口聚合使用的上行端口有重复的。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002248" : {
					"cause" : "不能在不同类型的网卡上创建上行端口聚合。",
					"desc" : "不能在不同类型的网卡上创建上行端口聚合。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002250" : {
					"cause" : "操作不合法。",
					"desc" : "操作不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002251" : {
					"cause" : "系统平面不存在。",
					"desc" : "系统平面不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002252" : {
					"cause" : "上行端口ID和上行端口聚合ID只能选一个。",
					"desc" : "上行端口ID和上行端口聚合ID只能选一个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002253" : {
					"cause" : "系统平面ID不合法。",
					"desc" : "系统平面ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002255" : {
					"cause" : "管理系统平面不能被删除。",
					"desc" : "管理系统平面不能被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002256" : {
					"cause" : "VLAN ID冲突。",
					"desc" : "VLAN ID冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002257" : {
					"cause" : "子网地址冲突。",
					"desc" : "子网地址冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002258" : {
					"cause" : "优先级不合法。",
					"desc" : "优先级不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002259" : {
					"cause" : "CNA创建系统平面失败。",
					"desc" : "CNA创建系统平面失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002260" : {
					"cause" : "上限带宽不合法。",
					"desc" : "上限带宽不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002261" : {
					"cause" : "上一个更新任务仍在进行中。",
					"desc" : "上一个更新任务仍在进行中。",
					"solution" : "请稍后重试。"
				},
				"1002262" : {
					"cause" : "虚拟交换机名称不合法。",
					"desc" : "虚拟交换机名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002263" : {
					"cause" : "端口组名称不合法。",
					"desc" : "端口组名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002264" : {
					"cause" : "子网名称不合法。",
					"desc" : "子网名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002265" : {
					"cause" : "系统平面名称不合法。",
					"desc" : "系统平面名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002266" : {
					"cause" : "系统平面名称不合法。",
					"desc" : "系统平面名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002267" : {
					"cause" : "虚拟机交换机描述不合法。",
					"desc" : "虚拟机交换机描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002268" : {
					"cause" : "端口组描述不合法。",
					"desc" : "端口组描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002269" : {
					"cause" : "子网的描述不合法。",
					"desc" : "子网的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002270" : {
					"cause" : "系统平面描述不合法。",
					"desc" : "系统平面描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002271" : {
					"cause" : "上行端口的描述不合法。",
					"desc" : "上行端口的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002272" : {
					"cause" : "用于创建系统平面的端口不存在。",
					"desc" : "用于创建系统平面的端口不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002273" : {
					"cause" : "存储系统接口数量不能超过4个。",
					"desc" : "存储系统接口数量不能超过4个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002274" : {
					"cause" : "系统平面已存在。",
					"desc" : "系统平面已存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002275" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002276" : {
					"cause" : "查询参数为空。",
					"desc" : "查询参数为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002277" : {
					"cause" : "指标标志或指标名称为空。",
					"desc" : "指标标志或指标名称为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002278" : {
					"cause" : "Urn为空。",
					"desc" : "Urn为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002279" : {
					"cause" : "时间格式不正确。",
					"desc" : "时间格式不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002280" : {
					"cause" : "时间粒度不正确。",
					"desc" : "时间粒度不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002281" : {
					"cause" : "已存在名称相同的资源集群。",
					"desc" : "已存在名称相同的资源集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002282" : {
					"cause" : "指定目录空间不足，导出模板失败。",
					"desc" : "指定目录空间不足，导出模板失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1002283" : {
					"cause" : "服务器正在执行此操作。",
					"desc" : "服务器正在执行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002284" : {
					"cause" : "虚拟机交换机名称重复。",
					"desc" : "虚拟机交换机名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002285" : {
					"cause" : "虚拟机已经为运行中状态，勿需启动。",
					"desc" : "虚拟机已经为运行中状态，勿需启动。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002286" : {
					"cause" : "虚拟机正在执行此操作。",
					"desc" : "虚拟机正在执行此操作。",
					"solution" : "请等待任务完成。"
				},
				"1002287" : {
					"cause" : "虚拟机不存在序列号为1的硬盘。",
					"desc" : "虚拟机不存在序列号为1的硬盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002288" : {
					"cause" : "此虚拟机已经为停止状态，不能进行该操作。",
					"desc" : "此虚拟机已经为停止状态，不能进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002289" : {
					"cause" : "虚拟机正在休眠中。",
					"desc" : "虚拟机正在休眠中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002290" : {
					"cause" : "此虚拟机已经为休眠状态，不能进行该操作。",
					"desc" : "此虚拟机已经为休眠状态，不能进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002291" : {
					"cause" : "虚拟机正在停止中。",
					"desc" : "虚拟机正在停止中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002292" : {
					"cause" : "目标节点或目标节点所在资源集群资源不足，不能迁移。",
					"desc" : "目标节点或目标节点所在资源集群资源不足，不能迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002293" : {
					"cause" : "源节点和目的节点的内存复用开关设置需相同。",
					"desc" : "源节点和目的节点的内存复用开关设置需相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002294" : {
					"cause" : "虚拟机挂有共享磁盘，不能进行此操作。",
					"desc" : "虚拟机挂有共享磁盘，不能进行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002295" : {
					"cause" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"desc" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002296" : {
					"cause" : "查询数据失败。",
					"desc" : "查询数据失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002297" : {
					"cause" : "密码允许重复使用次数或密码到期提前提示天数，不正确。",
					"desc" : "密码允许重复使用次数或密码到期提前提示天数，不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002298" : {
					"cause" : "用户名或密码错误。",
					"desc" : "用户名或密码错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002299" : {
					"cause" : "首次登录请修改密码。",
					"desc" : "首次登录请修改密码。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002300" : {
					"cause" : "密码已过期，请修改密码。",
					"desc" : "密码已过期，请修改密码。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002301" : {
					"cause" : "密码即将过期，要修改密码吗？",
					"desc" : "密码即将过期，要修改密码吗？",
					"solution" : "请联系技术支持工程师。"
				},
				"1002302" : {
					"cause" : "登录失败。",
					"desc" : "登录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002303" : {
					"cause" : "用户ID为空。",
					"desc" : "用户ID为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002304" : {
					"cause" : "包含正反序账户名。",
					"desc" : "包含正反序账户名。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002305" : {
					"cause" : "密码长度非法。",
					"desc" : "密码长度非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002306" : {
					"cause" : "包含特殊字符。",
					"desc" : "包含特殊字符。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002307" : {
					"cause" : "角色名不能为空。",
					"desc" : "角色名不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002308" : {
					"cause" : "权限列表为空。",
					"desc" : "权限列表为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002309" : {
					"cause" : "磁盘做过快照不允许挂载到其他虚拟机。",
					"desc" : "磁盘做过快照不允许挂载到其他虚拟机。",
					"solution" : "请重新选择没有做过快照的磁盘挂载到其他虚拟机。"
				},
				"1002310" : {
					"cause" : "磁盘类型不允许当前操作。",
					"desc" : "磁盘类型不允许当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002311" : {
					"cause" : "主机创建虚拟机内存快照失败。",
					"desc" : "主机创建虚拟机内存快照失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002312" : {
					"cause" : "虚拟机有快照存在，不能修改为模板或克隆模板。",
					"desc" : "虚拟机有快照存在，不能修改为模板或克隆模板。",
					"solution" : "删除该虚拟机快照或者选择不存在快照的虚拟机进行克隆。"
				},
				"1002313" : {
					"cause" : "快照恢复虚拟机时，主机启动虚拟机失败。",
					"desc" : "快照恢复虚拟机时，主机启动虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002314" : {
					"cause" : "对虚拟机进行此操作时计算资源不足。",
					"desc" : "对虚拟机进行此操作时计算资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002315" : {
					"cause" : "该服务器正在扫描存储设备。",
					"desc" : "该服务器正在扫描存储设备。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002316" : {
					"cause" : "数据存储超过100个。",
					"desc" : "数据存储超过100个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002317" : {
					"cause" : "保留IP地址已被分配。",
					"desc" : "保留IP地址已被分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002318" : {
					"cause" : "网关IP地址已被使用。",
					"desc" : "网关IP地址已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002319" : {
					"cause" : "IP地址和掩码不匹配。",
					"desc" : "IP地址和掩码不匹配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002320" : {
					"cause" : "子网内可用IP地址不足。",
					"desc" : "子网内可用IP地址不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002321" : {
					"cause" : "虚拟机交换机能够添加的上线链路数量达到上限。",
					"desc" : "虚拟机交换机能够添加的上线链路数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002322" : {
					"cause" : "VLAN池数量达到上限。",
					"desc" : "VLAN池数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002323" : {
					"cause" : "端口组数量达到上限。",
					"desc" : "端口组数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002324" : {
					"cause" : "端口组数量达到上限。",
					"desc" : "端口组数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002325" : {
					"cause" : "如果修改前上限带宽和优先级都没有设置，则对上限带宽和优先级修改需要同时进行。",
					"desc" : "如果修改前上限带宽和优先级都没有设置，则对上限带宽和优先级修改需要同时进行。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002326" : {
					"cause" : "网口映射参数不合法。",
					"desc" : "网口映射参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002327" : {
					"cause" : "设置CNA的网卡映射关系失败。",
					"desc" : "设置CNA的网卡映射关系失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002328" : {
					"cause" : "上行端口聚合名称重复。",
					"desc" : "上行端口聚合名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002329" : {
					"cause" : "上行端口聚合成员端口速率规格不一致。",
					"desc" : "上行端口聚合成员端口速率规格不一致。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002330" : {
					"cause" : "上行端口不是上行端口聚合的成员端口。",
					"desc" : "上行端口不是上行端口聚合的成员端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002331" : {
					"cause" : "系统自动创建的管理上行端口聚合内的第一个成员端口不能删除。",
					"desc" : "系统自动创建的管理上行端口聚合内的第一个成员端口不能删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002332" : {
					"cause" : "需要输入要修改的参数。",
					"desc" : "需要输入要修改的参数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002333" : {
					"cause" : "当前服务器不存在此上行端口聚合。",
					"desc" : "当前服务器不存在此上行端口聚合。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002334" : {
					"cause" : "参数上行端口ID和操作必须同时存在或不存在。",
					"desc" : "参数上行端口ID和操作必须同时存在或不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002335" : {
					"cause" : "从上行端口聚合删除网口，一次只能删除1个。",
					"desc" : "从上行端口聚合删除网口，一次只能删除1个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002336" : {
					"cause" : "从上行端口聚合删除网口时，上行端口聚合内必须保留1个网口。",
					"desc" : "从上行端口聚合删除网口时，上行端口聚合内必须保留1个网口。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002337" : {
					"cause" : "向上行端口聚合内增加网口，一次最少增加1个。",
					"desc" : "向上行端口聚合内增加网口，一次最少增加1个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002338" : {
					"cause" : "当前服务器不存在此系统平面。",
					"desc" : "当前服务器不存在此系统平面。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002339" : {
					"cause" : "存储链路不能设置网关IP地址。",
					"desc" : "存储链路不能设置网关IP地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002340" : {
					"cause" : "子网地址和网关不在同一网段。",
					"desc" : "子网地址和网关不在同一网段。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002341" : {
					"cause" : "系统平面名称重复。",
					"desc" : "系统平面名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002342" : {
					"cause" : "该任务类型不支持取消。",
					"desc" : "该任务类型不支持取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002343" : {
					"cause" : "任务已执行完毕，不支持取消。",
					"desc" : "任务已执行完毕，不支持取消。",
					"solution" : "请确认任务状态。"
				},
				"1002344" : {
					"cause" : "数据查询失败，请稍后重试。",
					"desc" : "数据查询失败，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002345" : {
					"cause" : "创建磁盘失败。",
					"desc" : "创建磁盘失败。",
					"solution" : "可能由网络、SAN设备异常或数据存储剩余容量不足导致，请排查。"
				},
				"1002346" : {
					"cause" : "VRM初始化网络失败。",
					"desc" : "VRM初始化网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002347" : {
					"cause" : "VRM挂载磁盘失败。",
					"desc" : "VRM挂载磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002348" : {
					"cause" : "系统中对该对象的操作冲突。",
					"desc" : "系统中对该对象的操作冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002349" : {
					"cause" : "虚拟机已停止。",
					"desc" : "虚拟机已停止。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002350" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002351" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002352" : {
					"cause" : "服务器无法连接远程设备。",
					"desc" : "服务器无法连接远程设备。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002353" : {
					"cause" : "服务器无法访问远程文件。",
					"desc" : "服务器无法访问远程文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002354" : {
					"cause" : "服务器无法访问远程文件。",
					"desc" : "服务器无法访问远程文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002355" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "系统资源不足，请稍后重试。"
				},
				"1002356" : {
					"cause" : "VRM无法连接该服务器。",
					"desc" : "VRM无法连接该服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002357" : {
					"cause" : "虚拟机网卡名称不能重复。",
					"desc" : "虚拟机网卡名称不能重复。",
					"solution" : "请重新输入不同的网卡名称。"
				},
				"1002358" : {
					"cause" : "此虚拟机/模板正在克隆，不能删除或启动。",
					"desc" : "此虚拟机/模板正在克隆，不能删除或启动。",
					"solution" : "请稍后重试。"
				},
				"1002359" : {
					"cause" : "虚拟机各网卡所属portgroup需要位于同一DVSwitch下。",
					"desc" : "虚拟机各网卡所属portgroup需要位于同一DVSwitch下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002360" : {
					"cause" : "克隆时，存在磁盘因源数据存储和目标数据存储存储类型不同无法克隆。",
					"desc" : "克隆时，存在磁盘因源数据存储和目标数据存储存储类型不同无法克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002361" : {
					"cause" : "克隆时，存在磁盘拷贝操作找不到合适的计算节点无法克隆。",
					"desc" : "克隆时，存在磁盘拷贝操作找不到合适的计算节点无法克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002362" : {
					"cause" : "存储类型为SAN或LOCAL，不允许做链接克隆。",
					"desc" : "存储类型为SAN或LOCAL，不允许做链接克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002363" : {
					"cause" : "停止态的虚拟机不允许创建内存快照。",
					"desc" : "停止态的虚拟机不允许创建内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002364" : {
					"cause" : "虚拟机的Tools没有运行。",
					"desc" : "虚拟机的Tools没有运行。",
					"solution" : "请先安装并启动Tools后再重试。"
				},
				"1002365" : {
					"cause" : "输入参数错误。",
					"desc" : "输入参数错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002366" : {
					"cause" : "无法找到该虚拟机模板信息。",
					"desc" : "无法找到该虚拟机模板信息。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002367" : {
					"cause" : "虚拟机模板不存在。",
					"desc" : "虚拟机模板不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002368" : {
					"cause" : "迁移失败，虚拟机正在创建快照或者恢复快照。",
					"desc" : "迁移失败，虚拟机正在创建快照或者恢复快照。",
					"solution" : "请稍后重试。"
				},
				"1002369" : {
					"cause" : "主机未进入维护模式，不能迁空。",
					"desc" : "主机未进入维护模式，不能迁空。",
					"solution" : "请先进入维护模式再迁空。"
				},
				"1002370" : {
					"cause" : "主机故障，不能迁空。",
					"desc" : "主机故障，不能迁空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002371" : {
					"cause" : "CPU资源不足，请检查CPU核数、预留、上限",
					"desc" : "CPU资源不足，请检查CPU核数、预留、上限",
					"solution" : "请联系技术支持工程师。"
				},
				"1002372" : {
					"cause" : "内存资源不足，请检查内存大小、预留、上限。",
					"desc" : "内存资源不足，请检查内存大小、预留、上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002373" : {
					"cause" : "超过可用主机的网卡上限。",
					"desc" : "超过可用主机的网卡上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002374" : {
					"cause" : "供选择的主机均异常。",
					"desc" : "供选择的主机均异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002375" : {
					"cause" : "供选择的主机均处于维护模式。",
					"desc" : "供选择的主机均处于维护模式。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002376" : {
					"cause" : "供选择的主机均不可用。",
					"desc" : "供选择的主机均不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002377" : {
					"cause" : "无供选择的主机。",
					"desc" : "无供选择的主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002378" : {
					"cause" : "主机繁忙，稍后重试。",
					"desc" : "主机繁忙，稍后重试。",
					"solution" : "主机繁忙，稍后重试。"
				},
				"1002379" : {
					"cause" : "给虚拟机分配ip只能有一块网卡带有网关。",
					"desc" : "给虚拟机分配ip只能有一块网卡带有网关。",
					"solution" : "请更换无默认网关配置的端口组。"
				},
				"1002380" : {
					"cause" : "主机不属于集群。",
					"desc" : "主机不属于集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002381" : {
					"cause" : "虚拟机不允许此操作。",
					"desc" : "虚拟机不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002382" : {
					"cause" : "虚拟机正在克隆，不能操作磁盘。",
					"desc" : "虚拟机正在克隆，不能操作磁盘。",
					"solution" : "请稍后重试。"
				},
				"1002383" : {
					"cause" : "虚拟机存储形态不统一。",
					"desc" : "虚拟机存储形态不统一。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002384" : {
					"cause" : "虚拟机所属的数据存储不支持创建快照。",
					"desc" : "虚拟机所属的数据存储不支持创建快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002385" : {
					"cause" : "此USB控制器类型目前版本不支持。",
					"desc" : "此USB控制器类型目前版本不支持。",
					"solution" : "请重新选择合适的控制器类型。"
				},
				"1002386" : {
					"cause" : "虚拟机已添加该类型的控制器。",
					"desc" : "虚拟机已添加该类型的控制器。",
					"solution" : "请重新选择合适的控制器类型。"
				},
				"1002387" : {
					"cause" : "虚拟机未添加该类型的控制器。",
					"desc" : "虚拟机未添加该类型的控制器。",
					"solution" : "请重新选择合适的控制器类型。"
				},
				"1002388" : {
					"cause" : "USB控制器下存在USB设备。",
					"desc" : "USB控制器下存在USB设备。",
					"solution" : "请先移除该类型控制器对应的USB设备，再进行删除。"
				},
				"1002389" : {
					"cause" : "USB设备已被分配。",
					"desc" : "USB设备已被分配。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"1002390" : {
					"cause" : "虚拟机和USB设备在不同主机。",
					"desc" : "虚拟机和USB设备在不同主机。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"1002391" : {
					"cause" : "USB设备在不同的主机上。",
					"desc" : "USB设备在不同的主机上。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"1002392" : {
					"cause" : "USB设备未被分配。",
					"desc" : "USB设备未被分配。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"1002393" : {
					"cause" : "挂载USB设备的虚拟机不能迁移。",
					"desc" : "挂载USB设备的虚拟机不能迁移。",
					"solution" : "请先进行卸载USB设备再进行虚拟机迁移。"
				},
				"1002394" : {
					"cause" : "虚拟机上没有该类型的控制器。",
					"desc" : "虚拟机上没有该类型的控制器。",
					"solution" : "请先添加该类型的控制器。"
				},
				"1002395" : {
					"cause" : "虚拟机已达USB设备数量上限。",
					"desc" : "虚拟机已达USB设备数量上限。",
					"solution" : "请删除未使用的USB设备。"
				},
				"1002396" : {
					"cause" : "虚拟机和USB设备在不同主机。",
					"desc" : "虚拟机和USB设备在不同主机。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"1002397" : {
					"cause" : "USB设备所在的主机不可用。",
					"desc" : "USB设备所在的主机不可用。",
					"solution" : "请选择可用的USB设备主机。"
				},
				"1002398" : {
					"cause" : "绑定USB设备的虚拟机不能创建内存快照。",
					"desc" : "绑定USB设备的虚拟机不能创建内存快照。",
					"solution" : "绑定USB设备的虚拟机不能创建内存快照。"
				},
				"1002399" : {
					"cause" : "绑定USB设备的虚拟机不能备份内存。",
					"desc" : "绑定USB设备的虚拟机不能备份内存。",
					"solution" : "绑定USB设备的虚拟机不能备份内存。"
				},
				"1002400" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002401" : {
					"cause" : "主机返回失败。",
					"desc" : "主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002402" : {
					"cause" : "修改成功，重启后生效。",
					"desc" : "修改成功，重启后生效。",
					"solution" : "请重启虚拟机。"
				},
				"1002403" : {
					"cause" : "密码非法。",
					"desc" : "密码非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002404" : {
					"cause" : "工作组信息非法。",
					"desc" : "工作组信息非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002405" : {
					"cause" : "工作组和域不能同时配置。",
					"desc" : "工作组和域不能同时配置。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002406" : {
					"cause" : "域名或域的计算机名非法。",
					"desc" : "域名或域的计算机名非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002407" : {
					"cause" : "网卡名字非法。",
					"desc" : "网卡名字非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002408" : {
					"cause" : "ip或者掩码非法。",
					"desc" : "ip或者掩码非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002409" : {
					"cause" : "网卡序号非法。",
					"desc" : "网卡序号非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002410" : {
					"cause" : "网关信息非法。",
					"desc" : "网关信息非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002411" : {
					"cause" : "DNS信息错误。",
					"desc" : "DNS信息错误。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002412" : {
					"cause" : "自定义网卡数目与虚拟机网卡数目不一致。",
					"desc" : "自定义网卡数目与虚拟机网卡数目不一致。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002413" : {
					"cause" : "自定义操作系统类型与虚拟机不一致。",
					"desc" : "自定义操作系统类型与虚拟机不一致。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002414" : {
					"cause" : "挂载光驱的协议不合法。",
					"desc" : "挂载光驱的协议不合法。",
					"solution" : "请使用合法的协议进行挂载。"
				},
				"1002415" : {
					"cause" : "虚拟机系统繁忙，请稍后重试。",
					"desc" : "虚拟机系统繁忙，请稍后重试。",
					"solution" : "请稍后重试。"
				},
				"1002416" : {
					"cause" : "VMware内部错误，查询任务失败原因失败。",
					"desc" : "VMware内部错误，查询任务失败原因失败。",
					"solution" : "请登录vSphere，确认相关虚拟机是否休眠成功。"
				},
				"1002417" : {
					"cause" : "不支持多VRM级联",
					"desc" : "不支持多VRM级联",
					"solution" : "请联系系统管理员。"
				},
				"1002418" : {
					"cause" : "用户鉴权失败",
					"desc" : "用户鉴权失败",
					"solution" : "请联系系统管理员。"
				},
				"1002419" : {
					"cause" : "待操作的集群对象不存在",
					"desc" : "待操作的集群对象不存在",
					"solution" : "请联系系统管理员。"
				},
				"1002420" : {
					"cause" : "主机关联的存储集群不允许下电该主机。",
					"desc" : "主机关联的存储集群不允许下电该主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002421" : {
					"cause" : "主机关联的存储集群不允许重启该主机。",
					"desc" : "主机关联的存储集群不允许重启该主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002422" : {
					"cause" : "FusionManager未接入该服务器。",
					"desc" : "FusionManager未接入该服务器。",
					"solution" : "请在FusionManager中接入该服务器并重试。"
				},
				"1002423" : {
					"cause" : "磁盘挂载操作失败",
					"desc" : "磁盘挂载操作失败",
					"solution" : "请联系系统管理员"
				},
				"1002425" : {
					"cause" : "任务在此阶段不允许取消。",
					"desc" : "任务在此阶段不允许取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002426" : {
					"cause" : "任务已经被取消，不能再次执行此操作。",
					"desc" : "任务已经被取消，不能再次执行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002427" : {
					"cause" : "任务取消失败。",
					"desc" : "任务取消失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002428" : {
					"cause" : "用户取消任务。",
					"desc" : "用户取消任务。",
					"solution" : "请确认后再进行操作"
				},
				"1002429" : {
					"cause" : "虚拟机不受快照影响磁盘当前设置与快照点磁盘设置冲突。",
					"desc" : "虚拟机不受快照影响磁盘当前设置与快照点磁盘设置冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002430" : {
					"cause" : "集群发现失败，没有发现可用的数据中心。",
					"desc" : "集群发现失败，没有发现可用的数据中心。",
					"solution" : "请检查虚拟化环境用户的会话或待发现集群是否在数据中心下。"
				},
				"1002431" : {
					"cause" : "共享磁盘绑定的虚拟机达到上限。",
					"desc" : "共享磁盘绑定的虚拟机达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002432" : {
					"cause" : "无法修复该虚拟机。",
					"desc" : "无法修复该虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002433" : {
					"cause" : "当前虚拟机位置无法满足恢复快照后启动虚拟机条件，请将虚拟机迁移至满足条件的主机。",
					"desc" : "当前虚拟机位置无法满足恢复快照后启动虚拟机条件，请将虚拟机迁移至满足条件的主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002434" : {
					"cause" : "快照不属于该虚拟机。",
					"desc" : "快照不属于该虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002435" : {
					"cause" : "虚拟机与磁盘位置不兼容，不能绑定。",
					"desc" : "虚拟机与磁盘位置不兼容，不能绑定。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002440" : {
					"cause" : "主机当前状态不支持此操作，请稍后重试。",
					"desc" : "主机当前状态不支持此操作，请稍后重试。",
					"solution" : "请检查后重试。"
				},
				"1002441" : {
					"cause" : "主机上有存储相关任务，不允许此操作。",
					"desc" : "主机上有存储相关任务，不允许此操作。",
					"solution" : "请检查后重试。"
				},
				"1002442" : {
					"cause" : "该虚拟机已挂载光驱或者Tools，不允许迁移。",
					"desc" : "该虚拟机已挂载光驱或者Tools，不允许迁移。",
					"solution" : "请卸载光驱后重试。"
				},
				"1002443" : {
					"cause" : "主机暂未准备就绪，请稍后重试。",
					"desc" : "主机暂未准备就绪，请稍后重试。",
					"solution" : "请检查后重试。"
				},
				"1002445" : {
					"cause" : "虚拟机状态异常导致创建一致性快照失败。",
					"desc" : "虚拟机状态异常导致创建一致性快照失败。",
					"solution" : "请检查虚拟机状态。"
				},
				"1002450" : {
					"cause" : "目标数据存储不支持非持久化磁盘或者带快照的磁盘。",
					"desc" : "目标数据存储不支持非持久化磁盘或者带快照的磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002451" : {
					"cause" : "小于4G的磁盘不允许扩容。",
					"desc" : "小于4G的磁盘不允许扩容。",
					"solution" : "请联系系统管理员。"
				},
				"1002452" : {
					"cause" : "共享磁盘不支持修改磁盘IO属性。",
					"desc" : "共享磁盘不支持修改磁盘IO属性。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002453" : {
					"cause" : "当前磁盘状态不允许修改磁盘IO属性。",
					"desc" : "当前磁盘状态不允许修改磁盘IO属性。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002454" : {
					"cause" : "当前磁盘正在修改IO属性，当前状态不支持修改磁盘IO属性。",
					"desc" : "当前磁盘正在修改IO属性，当前状态不支持修改磁盘IO属性。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002455" : {
					"cause" : "修改磁盘IO属性失败。",
					"desc" : "修改磁盘IO属性失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002456" : {
					"cause" : "内存交换磁盘不允许设置IO上限。",
					"desc" : "内存交换磁盘不允许设置IO上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002457" : {
					"cause" : "主机中挂载光驱的虚拟机个数达到上限",
					"desc" : "主机中挂载光驱的虚拟机个数达到上限",
					"solution" : "请联系技术支持工程师。"
				},
				"1002458" : {
					"cause" : "快照存在差分磁盘，不允许删除，请删除该快照快速部署的虚拟机后重试。",
					"desc" : "快照存在差分磁盘，不允许删除，请删除该快照快速部署的虚拟机后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002459" : {
					"cause" : "对象虚拟机为快速复制的虚拟机，不允许进行此操作。",
					"desc" : "对象虚拟机为快速复制的虚拟机，不允许进行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002460" : {
					"cause" : "磁盘格式化失败。",
					"desc" : "磁盘格式化失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002461" : {
					"cause" : "磁盘迁移失败，可能由迁移过程中虚拟机状态发生变化、主机状态变化或者网络异常导致。",
					"desc" : "磁盘迁移失败，可能由迁移过程中虚拟机状态发生变化、主机状态变化或者网络异常导致。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002462" : {
					"cause" : "小于4G的磁盘不允许扩容。",
					"desc" : "小于4G的磁盘不允许扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002463" : {
					"cause" : "裸设备映射数据存储上只能创建裸设备映射磁盘，此磁盘类型是共享，配置模式是普通，不受快照影响，持久，拥有全部数据存储空间。",
					"desc" : "裸设备映射数据存储上只能创建裸设备映射磁盘，此磁盘类型是共享，配置模式是普通，不受快照影响，持久，拥有全部数据存储空间。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002464" : {
					"cause" : "集群下存在启动中、迁移中等暂态的虚拟机，不能修改集群非统一内存访问开关。",
					"desc" : "集群下存在启动中、迁移中等暂态的虚拟机，不能修改集群非统一内存访问开关。",
					"solution" : "请稍后重试。"
				},
				"1002465" : {
					"cause" : "该磁盘不能绑定该虚拟机，请将虚拟机加入组织后再试。",
					"desc" : "该磁盘不能绑定该虚拟机，请将虚拟机加入组织后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002466" : {
					"cause" : "主机上设置卷的IO份额失败。",
					"desc" : "主机上设置卷的IO份额失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002467" : {
					"cause" : "该卷未绑定给虚拟机，不能设置IO份额。",
					"desc" : "该卷未绑定给虚拟机，不能设置IO份额。",
					"solution" : "请先绑定虚拟机再重试。"
				},
				"1002479" : {
					"cause" : "该虚拟机的操作系统不支持休眠",
					"desc" : "该虚拟机的操作系统不支持休眠",
					"solution" : "请联系技术支持工程师"
				},
				"1002489" : {
					"cause" : "挂起虚拟机，主机返回失败。",
					"desc" : "挂起虚拟机，主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002491" : {
					"cause" : "虚拟机磁盘存在未完成任务，请任务结束后重试。",
					"desc" : "虚拟机磁盘存在未完成任务，请任务结束后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002499" : {
					"cause" : "CPU或内存热插拔操作完成后虚拟机未重启。",
					"desc" : "CPU或内存热插拔操作完成后虚拟机未重启。",
					"solution" : "CPU或内存热插拔操作完成，请在重启虚拟机之后创建快照。"
				},
				"1002500" : {
					"cause" : "存在快照的虚拟机不能离线克隆为其他虚拟机。",
					"desc" : "存在快照的虚拟机不能离线克隆为其他虚拟机。",
					"solution" : "删除该虚拟机快照或者选择不存在快照的虚拟机进行克隆。"
				},
				"1002501" : {
					"cause" : "级联域中最多连接16个VRM。",
					"desc" : "级联域中最多连接16个VRM。",
					"solution" : "级联域中最多连接16个VRM。"
				},
				"1002502" : {
					"cause" : "URL长度超过限制。",
					"desc" : "URL长度超过限制。",
					"solution" : "URL长度超过限制，请输入正确URL。"
				},
				"1002503" : {
					"cause" : "内存热插立即生效的内存值必须为1024M的整数倍。",
					"desc" : "内存热插立即生效的内存值必须为1024M的整数倍。",
					"solution" : "内存热插立即生效的内存值必须为1024M的整数倍。请重新设置内存值。"
				},
				"1002504" : {
					"cause" : "存在链接克隆虚拟机的模板不能转为虚拟机。",
					"desc" : "存在链接克隆虚拟机的模板不能转为虚拟机。",
					"solution" : "请选择其他虚拟机模板进行操作。"
				},
				"1002505" : {
					"cause" : "虚拟机的当前状态不容许解绑定显卡。",
					"desc" : "虚拟机的当前状态不容许解绑定显卡。",
					"solution" : "当前虚拟机状态不允许解绑定显卡，请稍后重试。"
				},
				"1002506" : {
					"cause" : "内存磁盘不允许迁移。",
					"desc" : "内存磁盘不允许迁移。",
					"solution" : "请选择可以迁移的磁盘迁移。"
				},
				"1002507" : {
					"cause" : "与另一VRM通信异常。",
					"desc" : "与另一VRM通信异常。",
					"solution" : "请联系系统管理员。"
				},
				"1002508" : {
					"cause" : "虚拟机有共享磁盘，迁移失败。",
					"desc" : "虚拟机有共享磁盘，迁移失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002509" : {
					"cause" : "虚拟机或虚拟机模板不存在。",
					"desc" : "虚拟机或虚拟机模板不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002510" : {
					"cause" : "VMware虚拟机不支持延迟删除",
					"desc" : "VMware虚拟机不支持延迟删除",
					"solution" : "请检查延时参数后重试"
				},
				"1002580" : {
					"cause" : "链接克隆虚拟机不支持修复。",
					"desc" : "链接克隆虚拟机不支持修复。",
					"solution" : "请检查后重试。"
				},
				"1002600" : {
					"cause" : "操作无法完成，主机被某些对象（如虚拟机）使用。",
					"desc" : "操作无法完成，主机被某些对象（如虚拟机）使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003000" : {
					"cause" : "VLAN ID不在1～4096之间。",
					"desc" : "VLAN ID不在1～4096之间。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003001" : {
					"cause" : "IP地址格式不合法（A.B.C.D（0～255））、结束地址小于开始地址、地址范围非法。",
					"desc" : "IP地址格式不合法（A.B.C.D（0～255））、结束地址小于开始地址、地址范围非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003002" : {
					"cause" : "地址前缀不在0～32之间。",
					"desc" : "地址前缀不在0～32之间。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003003" : {
					"cause" : "由IPV4子网和IPV4前缀生成的网关不合法。",
					"desc" : "由IPV4子网和IPV4前缀生成的网关不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003004" : {
					"cause" : "IP地址与已添加的地址重叠。",
					"desc" : "IP地址与已添加的地址重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003005" : {
					"cause" : "对象不存在。",
					"desc" : "对象不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003006" : {
					"cause" : "参数不合法。",
					"desc" : "参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003007" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003008" : {
					"cause" : "对象已存在。",
					"desc" : "对象已存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003009" : {
					"cause" : "对象已关联。",
					"desc" : "对象已关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003010" : {
					"cause" : "对象已去关联。",
					"desc" : "对象已去关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003011" : {
					"cause" : "IP地址池名词不存在。",
					"desc" : "IP地址池名词不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003012" : {
					"cause" : "IP地址池类型错误（非外部）。",
					"desc" : "IP地址池类型错误（非外部）。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003013" : {
					"cause" : "部署IP地址池失败。",
					"desc" : "部署IP地址池失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003014" : {
					"cause" : "IP地址池正在使用。",
					"desc" : "IP地址池正在使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003015" : {
					"cause" : "端口绑定策略已经使用。",
					"desc" : "端口绑定策略已经使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003016" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003017" : {
					"cause" : "业务端口没有连接到交换机端口。",
					"desc" : "业务端口没有连接到交换机端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003018" : {
					"cause" : "划分VLAN失败。",
					"desc" : "划分VLAN失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003019" : {
					"cause" : "获取业务端口号失败。",
					"desc" : "获取业务端口号失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003020" : {
					"cause" : "获取交换机端口号失败。",
					"desc" : "获取交换机端口号失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003021" : {
					"cause" : "配置SAN设备地址和网络失败。",
					"desc" : "配置SAN设备地址和网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003022" : {
					"cause" : "VLAN池参数内容VLAN区域冲突。",
					"desc" : "VLAN池参数内容VLAN区域冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003023" : {
					"cause" : "VLAN正在使用中。",
					"desc" : "VLAN正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003024" : {
					"cause" : "vlanIf冲突。",
					"desc" : "vlanIf冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003025" : {
					"cause" : "为子网配置的子网在使用中。",
					"desc" : "为子网配置的子网在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003026" : {
					"cause" : "配置的子网在VLAN池中。",
					"desc" : "配置的子网在VLAN池中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003027" : {
					"cause" : "汇聚交换机不存在。",
					"desc" : "汇聚交换机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003028" : {
					"cause" : "对象正在创建，修改或者删除中，操作失败。",
					"desc" : "对象正在创建，修改或者删除中，操作失败。",
					"solution" : "请稍后再试。"
				},
				"1003030" : {
					"cause" : "设备已上电或设备无法正常连接。",
					"desc" : "设备已上电或设备无法正常连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003031" : {
					"cause" : "设备已下电或设备无法正常连接。",
					"desc" : "设备已下电或设备无法正常连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003032" : {
					"cause" : "设备已下电或设备无法正常连接。",
					"desc" : "设备已下电或设备无法正常连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003033" : {
					"cause" : "存在LUN，无法删除。",
					"desc" : "存在LUN，无法删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003034" : {
					"cause" : "VLAN已经被使用。",
					"desc" : "VLAN已经被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003035" : {
					"cause" : "下一跳地址错误。",
					"desc" : "下一跳地址错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003036" : {
					"cause" : "端口不为上行端口。",
					"desc" : "端口不为上行端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003037" : {
					"cause" : "端口存在配置。",
					"desc" : "端口存在配置。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003038" : {
					"cause" : "服务器配置策略已经使用。",
					"desc" : "服务器配置策略已经使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003039" : {
					"cause" : "操作失败，该防火墙不存在。",
					"desc" : "操作失败，该防火墙不存在。",
					"solution" : "请刷新设备列表。"
				},
				"1003040" : {
					"cause" : "起始/终止IP地址不在可用范围之内。可用IP地址是：网段内除第一个IP地址（预留网段地址），最后一个IP 地址（预留广播地址）之外的IP地址。",
					"desc" : "起始/终止IP地址不在可用范围之内。可用IP地址是：网段内除第一个IP地址（预留网段地址），最后一个IP 地址（预留广播地址）之外的IP地址。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1003043" : {
					"cause" : "防火墙状态不允许该操作，请稍后重试。",
					"desc" : "防火墙状态不允许该操作，请稍后重试。",
					"solution" : "防火墙状态不允许该操作，请稍后重试。"
				},
				"1003044" : {
					"cause" : "虚拟防火墙不存在。",
					"desc" : "虚拟防火墙不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1003045" : {
					"cause" : "已配置了路由业务。",
					"desc" : "已配置了路由业务。",
					"solution" : "请删除路由业务。"
				},
				"1003046" : {
					"cause" : "协议不合法。",
					"desc" : "协议不合法。",
					"solution" : "请联系系统管理员。"
				},
				"1003047" : {
					"cause" : "端口范围不合法。",
					"desc" : "端口范围不合法。",
					"solution" : "请联系系统管理员。"
				},
				"1003048" : {
					"cause" : "ACL规则的优先级已经存在。",
					"desc" : "ACL规则的优先级已经存在。",
					"solution" : "请联系系统管理员。"
				},
				"1003050" : {
					"cause" : "结束IP地址小于起始IP地址。",
					"desc" : "结束IP地址小于起始IP地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003051" : {
					"cause" : "IP地址池正在创建中，不能更新。",
					"desc" : "IP地址池正在创建中，不能更新。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003052" : {
					"cause" : "IP地址池正在删除中，不能更新。",
					"desc" : "IP地址池正在删除中，不能更新。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003053" : {
					"cause" : "修改后的IP个数小于当前的使用个数。",
					"desc" : "修改后的IP个数小于当前的使用个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003054" : {
					"cause" : "设备不存在",
					"desc" : "设备不存在",
					"solution" : "请刷新设备列表"
				},
				"1003055" : {
					"cause" : "密码不满足口令要求、密码为空或者长度不满足要求。",
					"desc" : "密码不满足口令要求、密码为空或者长度不满足要求。",
					"solution" : "请查看用户资料的口令要求部分。"
				},
				"1003056" : {
					"cause" : "防火墙状态异常。",
					"desc" : "防火墙状态异常。",
					"solution" : "请查看防火墙连接参数。"
				},
				"1003057" : {
					"cause" : "物理防火墙上创建有虚拟防火墙，无法删除。",
					"desc" : "物理防火墙上创建有虚拟防火墙，无法删除。",
					"solution" : "请查看物理防火墙上是否有未删除的虚拟防火墙。"
				},
				"1003058" : {
					"cause" : "配置信息不存在。",
					"desc" : "配置信息不存在。",
					"solution" : "请检查防火墙的配置信息。"
				},
				"1003059" : {
					"cause" : "没有可用的资源。",
					"desc" : "没有可用的资源。",
					"solution" : "请联系系统管理员。"
				},
				"1003060" : {
					"cause" : "资源参数非法。",
					"desc" : "资源参数非法。",
					"solution" : "请修改资源配置文件。"
				},
				"1003061" : {
					"cause" : "没有可用的service set。",
					"desc" : "没有可用的service set。",
					"solution" : "请联系系统管理员。"
				},
				"1003062" : {
					"cause" : "设备不可达。",
					"desc" : "设备不可达。",
					"solution" : "请检查设备的网络。"
				},
				"1003063" : {
					"cause" : "手工配置不完整。",
					"desc" : "手工配置不完整。",
					"solution" : "请查看设备的配置信息。"
				},
				"1003064" : {
					"cause" : "将IP，用户名和密码等信息保存到UHM失败。",
					"desc" : "将IP，用户名和密码等信息保存到UHM失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003065" : {
					"cause" : "防火墙资源文件内容错误。",
					"desc" : "防火墙资源文件内容错误。",
					"solution" : "请检查防火墙资源配置文件内容正确性。"
				},
				"1003066" : {
					"cause" : "防火墙资源配置文件为非xml类型。",
					"desc" : "防火墙资源配置文件为非xml类型。",
					"solution" : "请检查防火墙资源配置文件是否正确。"
				},
				"1003067" : {
					"cause" : "文件大小超过最大值。",
					"desc" : "文件大小超过最大值。",
					"solution" : "请检查配置文件是否正确。"
				},
				"1005000" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "请重新命名。"
				},
				"1005002" : {
					"cause" : "文件操作异常。",
					"desc" : "文件操作异常。",
					"solution" : "请重新命名。"
				},
				"1005003" : {
					"cause" : "数据存储操作无效。",
					"desc" : "数据存储操作无效。",
					"solution" : "请重新命名。"
				},
				"1005004" : {
					"cause" : "当前状态不允许此操作。",
					"desc" : "当前状态不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1005005" : {
					"cause" : "名称不合法。",
					"desc" : "名称不合法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1005006" : {
					"cause" : "系统正在执行涉及该对象的另一操作。",
					"desc" : "系统正在执行涉及该对象的另一操作。",
					"solution" : "请稍后重试。"
				},
				"1005007" : {
					"cause" : "升级中不能执行该操作。",
					"desc" : "升级中不能执行该操作。",
					"solution" : "请稍后重试。"
				},
				"1010001" : {
					"cause" : "服务器已被使用，删除失败。",
					"desc" : "服务器已被使用，删除失败。",
					"solution" : "若要删除服务器，请从确保没有基础设施服务在使用该服务器。"
				},
				"1010002" : {
					"cause" : "未发现新的服务器。",
					"desc" : "未发现新的服务器。",
					"solution" : "请查看新的服务器是否工作正常。"
				},
				"1010012" : {
					"cause" : "服务器批量操作失败。",
					"desc" : "服务器批量操作失败。",
					"solution" : "请查看各服务器操作结果。"
				},
				"1010013" : {
					"cause" : "管理虚拟机所在服务器不能进行上下电、重启、隔离操作。",
					"desc" : "管理虚拟机所在服务器不能进行上下电、重启、隔离操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010014" : {
					"cause" : "非虚拟化资源集群的服务器不能进行安全下电、安全重启、进入、退出维护模式操作。",
					"desc" : "非虚拟化资源集群的服务器不能进行安全下电、安全重启、进入、退出维护模式操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010015" : {
					"cause" : "该服务器不存在，上电失败。",
					"desc" : "该服务器不存在，上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010016" : {
					"cause" : "该服务器不存在，上电失败。",
					"desc" : "该服务器不存在，上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010017" : {
					"cause" : "该服务器不存在，下电失败。",
					"desc" : "该服务器不存在，下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010018" : {
					"cause" : "该服务器不存在，下电失败。",
					"desc" : "该服务器不存在，下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010019" : {
					"cause" : "该服务器不存在，重启失败。",
					"desc" : "该服务器不存在，重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010020" : {
					"cause" : "该服务器不存在，重启失败。",
					"desc" : "该服务器不存在，重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010021" : {
					"cause" : "该服务器不存在，进入维护模式失败。",
					"desc" : "该服务器不存在，进入维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010022" : {
					"cause" : "该服务器不存在，退出维护模式失败。",
					"desc" : "该服务器不存在，退出维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010023" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010024" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010025" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010026" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010027" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010028" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010029" : {
					"cause" : "系统异常，服务器进入维护模式失败。",
					"desc" : "系统异常，服务器进入维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010030" : {
					"cause" : "系统异常，服务器退出维护模式失败。",
					"desc" : "系统异常，服务器退出维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010031" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010032" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010033" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010034" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010035" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010036" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010037" : {
					"cause" : "服务器进入维护模式失败",
					"desc" : "服务器进入维护模式失败",
					"solution" : "进入维护模式前请迁移或者关闭服务器上运行的虚拟机"
				},
				"1010038" : {
					"cause" : "系统异常，服务器退出维护模式失败。",
					"desc" : "系统异常，服务器退出维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010039" : {
					"cause" : "主机已经进入维护模式，不能重复操作。",
					"desc" : "主机已经进入维护模式，不能重复操作。",
					"solution" : "请联系系统管理员。"
				},
				"1010040" : {
					"cause" : "服务器当前状态无法退出维护模式，请稍后再试。",
					"desc" : "服务器当前状态无法退出维护模式，请稍后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010041" : {
					"cause" : "该服务器未加入虚拟化环境，安全下电失败。",
					"desc" : "该服务器未加入虚拟化环境，安全下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010042" : {
					"cause" : "系统异常，安全下电失败。",
					"desc" : "系统异常，安全下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010043" : {
					"cause" : "系统异常，安全下电失败。",
					"desc" : "系统异常，安全下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010044" : {
					"cause" : "该服务器未加入虚拟化环境，安全重启失败。",
					"desc" : "该服务器未加入虚拟化环境，安全重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010045" : {
					"cause" : "系统异常，安全重启失败。",
					"desc" : "系统异常，安全重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010046" : {
					"cause" : "系统异常，安全重启失败。",
					"desc" : "系统异常，安全重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010047" : {
					"cause" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"desc" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"solution" : "请稍候重试。"
				},
				"1010048" : {
					"cause" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"desc" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"solution" : "请稍候重试。"
				},
				"1010049" : {
					"cause" : "启动应用失败。",
					"desc" : "启动应用失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010050" : {
					"cause" : "停止应用失败。",
					"desc" : "停止应用失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010051" : {
					"cause" : "启动FusionStorage服务失败。",
					"desc" : "启动FusionStorage服务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010052" : {
					"cause" : "停止FusionStorage服务失败。",
					"desc" : "停止FusionStorage服务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010053" : {
					"cause" : "上电服务器失败。",
					"desc" : "上电服务器失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010054" : {
					"cause" : "下电服务器失败。",
					"desc" : "下电服务器失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010055" : {
					"cause" : "设备IP无法连接。",
					"desc" : "设备IP无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010056" : {
					"cause" : "用户名(安全名称)或密码错误。",
					"desc" : "用户名(安全名称)或密码错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010057" : {
					"cause" : "发现设备失败。",
					"desc" : "发现设备失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010058" : {
					"cause" : "设备重复接入，IP或者MAC地址已存在。",
					"desc" : "设备重复接入，IP或者MAC地址已存在。",
					"solution" : "请检查设备是否已接入。"
				},
				"1010059" : {
					"cause" : "输入的刀片个数多于实际个数。",
					"desc" : "输入的刀片个数多于实际个数。",
					"solution" : "请确认刀片个数是否正确。"
				},
				"1010060" : {
					"cause" : "BMC IP无法连接。",
					"desc" : "BMC IP无法连接。",
					"solution" : "请检查参数。"
				},
				"1010061" : {
					"cause" : "设备重复接入。",
					"desc" : "设备重复接入。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010062" : {
					"cause" : "批量导入文件格式错误。",
					"desc" : "批量导入文件格式错误。",
					"solution" : "请下载最新的批量接入模板。"
				},
				"1010063" : {
					"cause" : "批量接入模板参数填写不符合规则。",
					"desc" : "批量接入模板参数填写不符合规则。",
					"solution" : "请检查填写的模板参数。"
				},
				"1010064" : {
					"cause" : "BMC用户名密码不正确，帐号被锁定,或Ipmi版本不匹配。",
					"desc" : "BMC用户名密码不正确，帐号被锁定,或Ipmi版本不匹配。",
					"solution" : "请确认主机的BMC用户名和密码，及Ipmi版本是否正确。"
				},
				"1010065" : {
					"cause" : "OS用户名密码不正确或帐号被锁定。",
					"desc" : "OS用户名密码不正确或帐号被锁定。",
					"solution" : "请确认主机的OS用户名和密码。"
				},
				"1010066" : {
					"cause" : "批量接入模板为空。",
					"desc" : "批量接入模板为空。",
					"solution" : "请检查填写的模板参数。"
				},
				"1010067" : {
					"cause" : "批量接入模板参数填写不符合规则。",
					"desc" : "批量接入模板参数填写不符合规则。",
					"solution" : "请检查填写的模板参数。"
				},
				"1010068" : {
					"cause" : "批量接入模板参数填写不符合规则。",
					"desc" : "批量接入模板参数填写不符合规则。",
					"solution" : "请检查填写的模板参数。"
				},
				"1010069" : {
					"cause" : "设置主机启动选项失败，请检查所选择的主机状态是否正常。",
					"desc" : "设置主机启动选项失败，请检查所选择的主机状态是否正常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010071" : {
					"cause" : "部分刀片接入失败。",
					"desc" : "部分刀片接入失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010072" : {
					"cause" : "主机未上电、管理ip不可达、管理密码错误或管理板连接异常。",
					"desc" : "主机未上电、管理ip不可达、管理密码错误或管理板连接异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010073" : {
					"cause" : "设备名称重复。",
					"desc" : "设备名称重复。",
					"solution" : "请检查参数。"
				},
				"1010074" : {
					"cause" : "正在发现设备规格，请稍后重试。",
					"desc" : "正在发现设备规格，请稍后重试。",
					"solution" : "正在发现设备规格，请稍后重试。"
				},
				"1010075" : {
					"cause" : "资源分区名称重复。",
					"desc" : "资源分区名称重复。",
					"solution" : "请检查参数。"
				},
				"1010076" : {
					"cause" : "非就绪状态下服务器主机信息输入不完全。",
					"desc" : "非就绪状态下服务器主机信息输入不完全。",
					"solution" : "请输入完整的服务器主机信息。"
				},
				"1010077" : {
					"cause" : "密码错误或者设备IP不可达。",
					"desc" : "密码错误或者设备IP不可达。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010078" : {
					"cause" : "网络异常。",
					"desc" : "网络异常。",
					"solution" : "请稍候重试。"
				},
				"1010079" : {
					"cause" : "基本信息非法。",
					"desc" : "基本信息非法。",
					"solution" : "请检查填写的模板参数。"
				},
				"1010080" : {
					"cause" : "主机未接入虚拟化环境。",
					"desc" : "主机未接入虚拟化环境。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010081" : {
					"cause" : "主机不在集群中。",
					"desc" : "主机不在集群中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010082" : {
					"cause" : "服务器类型不支持刷新规格。",
					"desc" : "服务器类型不支持刷新规格。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010085" : {
					"cause" : "BMC IP冲突。",
					"desc" : "BMC IP冲突。",
					"solution" : "请重新输入BMC IP。"
				},
				"1010086" : {
					"cause" : "OS IP冲突。",
					"desc" : "OS IP冲突。",
					"solution" : "请重新输入OS IP。"
				},
				"1010087" : {
					"cause" : "位置信息重复(存在相同机房、机架、机框号的设备，或存在相同槽位号的交换板)。",
					"desc" : "位置信息重复(存在相同机房、机架、机框号的设备，或存在相同槽位号的交换板)。",
					"solution" : "请重新输入位置信息。"
				},
				"1010088" : {
					"cause" : "OS用户名密码不正确或帐号被锁定或SSH连接超时。",
					"desc" : "OS用户名密码不正确或帐号被锁定或SSH连接超时。",
					"solution" : "请确认主机的OS用户名和密码。"
				},
				"1010089" : {
					"cause" : "无可用主机以完成该指定操作。",
					"desc" : "无可用主机以完成该指定操作。",
					"solution" : "请联系系统管理员。"
				},
				"1010090" : {
					"cause" : "无法执行该操作。该主机上未安装HA软件。",
					"desc" : "无法执行该操作。该主机上未安装HA软件。",
					"solution" : "请在该主机上安装HA软件。"
				},
				"1010091" : {
					"cause" : "主机运行在紧急模式下无法进行该操作。",
					"desc" : "主机运行在紧急模式下无法进行该操作。",
					"solution" : "请联系系统管理员。"
				},
				"1010092" : {
					"cause" : "指定主机被禁用，需重启主机后才能启用该主机。",
					"desc" : "指定主机被禁用，需重启主机后才能启用该主机。",
					"solution" : "请重启主机。"
				},
				"1010093" : {
					"cause" : "主机可用内存不足，操作无法进行。",
					"desc" : "主机可用内存不足，操作无法进行。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1010094" : {
					"cause" : "虚拟机所在主机需要先设置监控账户。",
					"desc" : "虚拟机所在主机需要先设置监控账户。",
					"solution" : "请设置主机监控账户。"
				},
				"1010095" : {
					"cause" : "启动共享存储上的虚拟机失败。",
					"desc" : "启动共享存储上的虚拟机失败。",
					"solution" : "请参考子任务的处理建议。"
				},
				"1010096" : {
					"cause" : "禁止主备倒换失败或停止CNA节点主机失败。",
					"desc" : "禁止主备倒换失败或停止CNA节点主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010097" : {
					"cause" : "关闭共享存储上的虚拟机失败。",
					"desc" : "关闭共享存储上的虚拟机失败。",
					"solution" : "请参考子任务的处理建议。"
				},
				"1010100" : {
					"cause" : "BMC用户名密码不正确或帐号被锁定。",
					"desc" : "BMC用户名密码不正确或帐号被锁定。",
					"solution" : "请确认主机的BMC用户名和密码。"
				},
				"1010101" : {
					"cause" : "IP:{0}不在子网:{1}内。",
					"desc" : "IP:{0}不在子网:{1}内。",
					"solution" : "请重新输入IP。"
				},
				"1010102" : {
					"cause" : "IP:{0}已被主机:{1}使用。",
					"desc" : "IP:{0}已被主机:{1}使用。",
					"solution" : "请重新输入IP。"
				},
				"1010103" : {
					"cause" : "IP:{0}已被占用。",
					"desc" : "IP:{0}已被占用。",
					"solution" : "请重新输入IP。"
				},
				"1010104" : {
					"cause" : "子网[{0}]中的主机IP修改失败。",
					"desc" : "子网[{0}]中的主机IP修改失败。",
					"solution" : "请重新修改。"
				},
				"1010123" : {
					"cause" : "从Dsware主机列表中获取第三个LCNA失败。",
					"desc" : "从Dsware主机列表中获取第三个LCNA失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010124" : {
					"cause" : "将主机加入逻辑集群失败。",
					"desc" : "将主机加入逻辑集群失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010125" : {
					"cause" : "管理集群下未发现主机。",
					"desc" : "管理集群下未发现主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010126" : {
					"cause" : "关联host失败。",
					"desc" : "关联host失败。",
					"solution" : "请联系技术支持工程师%u300"
				},
				"1010127" : {
					"cause" : "扩容主机未就绪。",
					"desc" : "扩容主机未就绪。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010128" : {
					"cause" : "输入的BMC地址与对应槽位服务器实际地址不一致。",
					"desc" : "输入的BMC地址与对应槽位服务器实际地址不一致。",
					"solution" : "请联系技术支持工程师。"
				},
				"1011090" : {
					"cause" : "设置SNMP Trap失败",
					"desc" : "设置SNMP Trap失败",
					"solution" : "请联系技术支持工程师"
				},
				"1020001" : {
					"cause" : "无法发现交换机，请检查交换机MAC地址是否正确。",
					"desc" : "无法发现交换机，请检查交换机MAC地址是否正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020002" : {
					"cause" : "未发现新的交换机。",
					"desc" : "未发现新的交换机。",
					"solution" : "请查看新的交换机设备是否工作正常。"
				},
				"1020003" : {
					"cause" : "获取交换机信息为空。",
					"desc" : "获取交换机信息为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020004" : {
					"cause" : "交换机操作异常。",
					"desc" : "交换机操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020005" : {
					"cause" : "交换机查询异常。",
					"desc" : "交换机查询异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020006" : {
					"cause" : "交换机端口查询异常。",
					"desc" : "交换机端口查询异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020008" : {
					"cause" : "路由参数非法。",
					"desc" : "路由参数非法。",
					"solution" : "请填写合法的参数。"
				},
				"1020009" : {
					"cause" : "IP地址非法。",
					"desc" : "IP地址非法。",
					"solution" : "请填写合法的IP地址。"
				},
				"1020010" : {
					"cause" : "掩码格式非法。",
					"desc" : "掩码格式非法。",
					"solution" : "请填写正确的掩码。"
				},
				"1020011" : {
					"cause" : "网关格式非法。",
					"desc" : "网关格式非法。",
					"solution" : "请填写正确的网关。"
				},
				"1020012" : {
					"cause" : "在交换机创建路由失败。",
					"desc" : "在交换机创建路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020013" : {
					"cause" : "在交换机查询路由失败。",
					"desc" : "在交换机查询路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020014" : {
					"cause" : "在交换机删除路由失败。",
					"desc" : "在交换机删除路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020015" : {
					"cause" : "在交换机修改路由失败。",
					"desc" : "在交换机修改路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020016" : {
					"cause" : "上行端口参数非法。",
					"desc" : "上行端口参数非法。",
					"solution" : "请填写合法的上行端口参数。"
				},
				"1020017" : {
					"cause" : "交换机端口不能为空。",
					"desc" : "交换机端口不能为空。",
					"solution" : "请选择至少一个端口。"
				},
				"1020018" : {
					"cause" : "VLAN ID与系统保留VLAN ID冲突。",
					"desc" : "VLAN ID与系统保留VLAN ID冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020019" : {
					"cause" : "查询上行端口失败。",
					"desc" : "查询上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020020" : {
					"cause" : "配置上行端口失败。",
					"desc" : "配置上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020021" : {
					"cause" : "修改上行端口失败。",
					"desc" : "修改上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020022" : {
					"cause" : "查询上行端口失败。",
					"desc" : "查询上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020023" : {
					"cause" : "删除上行端口失败。",
					"desc" : "删除上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020024" : {
					"cause" : "配置上行端口失败。",
					"desc" : "配置上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020025" : {
					"cause" : "删除上行端口失败。",
					"desc" : "删除上行端口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020026" : {
					"cause" : "配置上行端口VLAN、IP地址失败。",
					"desc" : "配置上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020027" : {
					"cause" : "删除上行端口VLAN、IP地址失败。",
					"desc" : "删除上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020028" : {
					"cause" : "修改上行端口VLAN、IP地址失败。",
					"desc" : "修改上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020029" : {
					"cause" : "查询上行端口VLAN、IP地址失败。",
					"desc" : "查询上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020030" : {
					"cause" : "网关的IP地址和指定的IP地址不在同一网段。",
					"desc" : "网关的IP地址和指定的IP地址不在同一网段。",
					"solution" : "请输入合法的网关或者IP地址。"
				},
				"1020031" : {
					"cause" : "上行端口只允许配置一个。",
					"desc" : "上行端口只允许配置一个。",
					"solution" : "请刷新页面重试或联系管理员。"
				},
				"1020034" : {
					"cause" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。",
					"desc" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。",
					"solution" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。"
				},
				"1020035" : {
					"cause" : "配置失败，交换机上trunk数量达到上限。",
					"desc" : "配置失败，交换机上trunk数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020036" : {
					"cause" : "配置失败，该trunk内端口数量达到上限。",
					"desc" : "配置失败，该trunk内端口数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020037" : {
					"cause" : "以127开头的IP地址无效，该地址保留给环回地址使用，请指定介于1和223间的其他某个有效值。",
					"desc" : "以127开头的IP地址无效，该地址保留给环回地址使用，请指定介于1和223间的其他某个有效值。",
					"solution" : "请指定开头介于1和223间的其他某个有效值。"
				},
				"1020038" : {
					"cause" : "交换机端口故障，无法下发配置。",
					"desc" : "交换机端口故障，无法下发配置。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020039" : {
					"cause" : "不允许输入网络地址或广播地址。",
					"desc" : "不允许输入网络地址或广播地址。",
					"solution" : "请填写合法的IP地址。"
				},
				"1020040" : {
					"cause" : "操作失败。",
					"desc" : "操作失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020050" : {
					"cause" : "资源分区下没有接入交换机。",
					"desc" : "资源分区下没有接入交换机。",
					"solution" : "请先接入交换机然后再试。"
				},
				"1020051" : {
					"cause" : "VLAN ID与网络资源池中的VLAN池中VLAN ID有冲突。",
					"desc" : "VLAN ID与网络资源池中的VLAN池中VLAN ID有冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020052" : {
					"cause" : "VLAN ID与网络资源池中的子网中的VLAN ID有冲突。",
					"desc" : "VLAN ID与网络资源池中的子网中的VLAN ID有冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020053" : {
					"cause" : "使用接入参数连接失败或交换机SSH服务未配置。",
					"desc" : "使用接入参数连接失败或交换机SSH服务未配置。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020054" : {
					"cause" : "上行端口在交换机上不存在。",
					"desc" : "上行端口在交换机上不存在。",
					"solution" : "请输入正确的上行端口。"
				},
				"1020055" : {
					"cause" : "登陆SAN设备失败。",
					"desc" : "登陆SAN设备失败。",
					"solution" : "请检查连接参数是否正常。"
				},
				"1029997" : {
					"cause" : "版本不支持或连接参数错误。",
					"desc" : "版本不支持或连接参数错误。",
					"solution" : "请确认版本号是否正确，同时检查连接参数。"
				},
				"1029998" : {
					"cause" : "SNMP连接参数错误。",
					"desc" : "SNMP连接参数错误。",
					"solution" : "请输入正确的SNMP连接参数。"
				},
				"1029999" : {
					"cause" : "SSH连接参数错误。",
					"desc" : "SSH连接参数错误。",
					"solution" : "请输入正确的SSH连接参数。"
				},
				"1030000" : {
					"cause" : "删除设备失败，设备部署有业务。",
					"desc" : "删除设备失败，设备部署有业务。",
					"solution" : "请先清除设备业务部署。"
				},
				"1030001" : {
					"cause" : "选中的存储设备不存在。",
					"desc" : "选中的存储设备不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1030002" : {
					"cause" : "选中的存储设备不存在。",
					"desc" : "选中的存储设备不存在。",
					"solution" : "请查看选择的存储设备是否工作正常。"
				},
				"1030003" : {
					"cause" : "选中的存储设备不存在。",
					"desc" : "选中的存储设备不存在。",
					"solution" : "请查看选择的存储设备是否工作正常。"
				},
				"1030004" : {
					"cause" : "SAN设备磁盘容量信息错误。",
					"desc" : "SAN设备磁盘容量信息错误。",
					"solution" : "请检查磁盘容量信息是否合法。"
				},
				"1030005" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请刷新界面检查该对象是否已经被删除。"
				},
				"1030006" : {
					"cause" : "此用户已经存在导入任务，请等候。",
					"desc" : "此用户已经存在导入任务，请等候。",
					"solution" : "请稍后进行批量导入任务。"
				},
				"1030007" : {
					"cause" : "批量导入模板大小超过2M。",
					"desc" : "批量导入模板大小超过2M。",
					"solution" : "请减少数据量。"
				},
				"1030008" : {
					"cause" : "批量导入模板设备总数超过500条。",
					"desc" : "批量导入模板设备总数超过500条。",
					"solution" : "请减少数据量。"
				},
				"1030083" : {
					"cause" : "服务器资源状态不支持刷新规格，请稍后重试。",
					"desc" : "服务器资源状态不支持刷新规格，请稍后重试。",
					"solution" : "请稍后重试。"
				},
				"1030084" : {
					"cause" : "服务器已下电，不能执行此操作。",
					"desc" : "服务器已下电，不能执行此操作。",
					"solution" : "请稍候重试。"
				},
				"1040001" : {
					"cause" : "资源集群的输入信息不符合要求。",
					"desc" : "资源集群的输入信息不符合要求。",
					"solution" : "请检查资源集群的基本参数是否合法。"
				},
				"1040002" : {
					"cause" : "服务器不允许为空。",
					"desc" : "服务器不允许为空。",
					"solution" : "请至少选择一台服务器。"
				},
				"1040003" : {
					"cause" : "存储不允许为空。",
					"desc" : "存储不允许为空。",
					"solution" : "请至少选择一个存储。"
				},
				"1040004" : {
					"cause" : "网络不允许为空",
					"desc" : "网络不允许为空",
					"solution" : "请至少选择一个子网或者一个VLAN。"
				},
				"1040005" : {
					"cause" : "有服务器被其它资源集群使用。",
					"desc" : "有服务器被其它资源集群使用。",
					"solution" : "请确定是否有服务器被其它资源集群使用。"
				},
				"1040006" : {
					"cause" : "数据库异常，增加资源集群失败。",
					"desc" : "数据库异常，增加资源集群失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040007" : {
					"cause" : "数据库异常，修改资源集群失败。",
					"desc" : "数据库异常，修改资源集群失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040008" : {
					"cause" : "有存储被其它资源集群使用。",
					"desc" : "有存储被其它资源集群使用。",
					"solution" : "请确定是否存储被其它资源集群使用。"
				},
				"1040009" : {
					"cause" : "资源集群名称长度超过限制。",
					"desc" : "资源集群名称长度超过限制。",
					"solution" : "请输入有效范围的资源集群名称。"
				},
				"1040011" : {
					"cause" : "资源集群数量大于64。",
					"desc" : "资源集群数量大于64。",
					"solution" : "最多只能创建64个资源集群。"
				},
				"1040012" : {
					"cause" : "修改资源集群高级配置失败。",
					"desc" : "修改资源集群高级配置失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040013" : {
					"cause" : "资源集群没有服务器存在，发放失败。",
					"desc" : "资源集群没有服务器存在，发放失败。",
					"solution" : "请添加可用的服务器。"
				},
				"1040014" : {
					"cause" : "资源集群状态为已发放状态或者回退成功状态，才能删除。",
					"desc" : "资源集群状态为已发放状态或者回退成功状态，才能删除。",
					"solution" : "请确认资源集群是否正在被操作，正确状态才能删除，或者请联系技术支持工程师。"
				},
				"1040015" : {
					"cause" : "与虚拟化环境断开连接。",
					"desc" : "与虚拟化环境断开连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040016" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040017" : {
					"cause" : "资源集群操作失败：服务器故障。",
					"desc" : "资源集群操作失败：服务器故障。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040018" : {
					"cause" : "资源集群操作失败：存储资源故障。",
					"desc" : "资源集群操作失败：存储资源故障。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040019" : {
					"cause" : "资源集群不是计划中，不能发放。",
					"desc" : "资源集群不是计划中，不能发放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040020" : {
					"cause" : "管理资源集群不允许删除。",
					"desc" : "管理资源集群不允许删除。",
					"solution" : "不能删除管理资源集群。"
				},
				"1040021" : {
					"cause" : "资源集群正在进行发放、扩减容或删除操作，删除失败。",
					"desc" : "资源集群正在进行发放、扩减容或删除操作，删除失败。",
					"solution" : "资源集群正在进行发放、扩减容或删除操作，不能再进行删除。"
				},
				"1040022" : {
					"cause" : "校验虚拟机失败，删除失败。",
					"desc" : "校验虚拟机失败，删除失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040023" : {
					"cause" : "资源集群有虚拟机存在，删除失败。",
					"desc" : "资源集群有虚拟机存在，删除失败。",
					"solution" : "请先清除该资源集群的虚拟机再试。"
				},
				"1040024" : {
					"cause" : "资源集群不存在。",
					"desc" : "资源集群不存在。",
					"solution" : "请刷新页面再试。"
				},
				"1040025" : {
					"cause" : "资源集群已经被用户资源配额使用，删除失败。",
					"desc" : "资源集群已经被用户资源配额使用，删除失败。",
					"solution" : "请将资源集群从资源配额删除再试。"
				},
				"1040026" : {
					"cause" : "资源集群正在发放中，不能再执行其他操作。",
					"desc" : "资源集群正在发放中，不能再执行其他操作。",
					"solution" : "资源集群正在发放，请稍后再试。"
				},
				"1040027" : {
					"cause" : "资源集群正在扩容中，不能再执行其他操作。",
					"desc" : "资源集群正在扩容中，不能再执行其他操作。",
					"solution" : "资源集群正在扩容中，不能再执行其他操作。"
				},
				"1040028" : {
					"cause" : "资源集群正在进行发放、扩减容或删除操作，减容失败。",
					"desc" : "资源集群正在进行发放、扩减容或删除操作，减容失败。",
					"solution" : "资源集群正在进行发放、扩减容或删除操作，不能再进行减容。"
				},
				"1040029" : {
					"cause" : "选择的减容服务器不属于资源集群，减容失败。",
					"desc" : "选择的减容服务器不属于资源集群，减容失败。",
					"solution" : "选择的减容服务器不属于资源集群，减容失败。"
				},
				"1040030" : {
					"cause" : "减容选中的服务器是管理虚拟机所在服务器，减容失败。",
					"desc" : "减容选中的服务器是管理虚拟机所在服务器，减容失败。",
					"solution" : "选择的减容服务器是VRM服务器，减容失败。"
				},
				"1040031" : {
					"cause" : "减容服务器时设置服务器为维护状态失败，减容失败。",
					"desc" : "减容服务器时设置服务器为维护状态失败，减容失败。",
					"solution" : "减容服务器时设置服务器为维护状态失败，减容失败。"
				},
				"1040033" : {
					"cause" : "资源集群正在进行发放、扩减容或删除操作，扩容失败。",
					"desc" : "资源集群正在进行发放、扩减容或删除操作，扩容失败。",
					"solution" : "资源集群正在进行发放、扩减容或删除操作，不能再进行扩容。"
				},
				"1040034" : {
					"cause" : "资源集群下有关联的网络存在，删除失败。",
					"desc" : "资源集群下有关联的网络存在，删除失败。",
					"solution" : "请先删除端口组。"
				},
				"1040035" : {
					"cause" : "资源集群没有服务器存在，扩容存储失败。",
					"desc" : "资源集群没有服务器存在，扩容存储失败。",
					"solution" : "资源集群没有服务器存在，不能进行存储扩容，请先扩容服务器。"
				},
				"1040036" : {
					"cause" : "创建或修改资源集群时，用户没有任何可管理的域。",
					"desc" : "创建或修改资源集群时，用户没有任何可管理的域。",
					"solution" : "为该用户增加可管理的域，或者使用其他用户重新登陆操作。"
				},
				"1040037" : {
					"cause" : "选择了用户无权操作的域。",
					"desc" : "选择了用户无权操作的域。",
					"solution" : "为该用户增加此域的管理权限，或返回选择其他域。"
				},
				"1040038" : {
					"cause" : "资源集群上次删除/发放操作失败，只能进行删除操作。",
					"desc" : "资源集群上次删除/发放操作失败，只能进行删除操作。",
					"solution" : "资源集群上次删除/发放操作失败，只能进行删除操作。"
				},
				"1040039" : {
					"cause" : "资源集群上次减容操作失败，只能进行同样减容操作。",
					"desc" : "资源集群上次减容操作失败，只能进行同样减容操作。",
					"solution" : "资源集群上次减容操作失败，只能进行同样减容操作。"
				},
				"1040042" : {
					"cause" : "不允许添加不同位置的服务器。",
					"desc" : "不允许添加不同位置的服务器。",
					"solution" : "不允许添加不同位置的服务器。"
				},
				"1040043" : {
					"cause" : "不允许添加不同位置的存储。",
					"desc" : "不允许添加不同位置的存储。",
					"solution" : "不允许添加不同位置的存储。"
				},
				"1040044" : {
					"cause" : "资源集群License校验不通过。",
					"desc" : "资源集群License校验不通过。",
					"solution" : "请选择满足License的计算资源进行操作。"
				},
				"1040045" : {
					"cause" : "服务器名称重复或已存在。",
					"desc" : "服务器名称重复或已存在。",
					"solution" : "请输入唯一的服务器名称。"
				},
				"1040046" : {
					"cause" : "裸机BMC IP池不存在，无法创建裸机资源集群。",
					"desc" : "裸机BMC IP池不存在，无法创建裸机资源集群。",
					"solution" : "请先配置裸机BMC IP池，然后再进行创建裸机集群操作。"
				},
				"1040047" : {
					"cause" : "申请的资源超出License授权，无法进行发放/扩容操作。",
					"desc" : "申请的资源超出License授权，无法进行发放/扩容操作。",
					"solution" : "请选择满足License的计算资源进行操作。"
				},
				"1040048" : {
					"cause" : "License文件过期失败，无法进行发放/扩容操作。",
					"desc" : "License文件过期失败，无法进行发放/扩容操作。",
					"solution" : "请申请有效的License，然后再进行集群操作。"
				},
				"1040049" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系系统管理员。"
				},
				"1040050" : {
					"cause" : "参数错误。",
					"desc" : "参数错误。",
					"solution" : "请检查输入参数，确认输入参数无误。"
				},
				"1040051" : {
					"cause" : "域中存在资源集群。",
					"desc" : "域中存在资源集群。",
					"solution" : "该域中存在资源集群，不能删除域或创建子域。如需删除域或创建子域请先移除该域中的资源集群，请慎重操作。"
				},
				"1040052" : {
					"cause" : "该域不存在。",
					"desc" : "该域不存在。",
					"solution" : "请刷新界面，检查该域是否存在。"
				},
				"1040053" : {
					"cause" : "存在子网已经被端口组使用，减容失败。",
					"desc" : "存在子网已经被端口组使用，减容失败。",
					"solution" : "减容子网之前请校验是否已经被端口组使用。"
				},
				"1040054" : {
					"cause" : "存在Vlan池已经被端口组使用，减容失败。",
					"desc" : "存在Vlan池已经被端口组使用，减容失败。",
					"solution" : "减容Vlan之前请校验是否已经被端口组使用。"
				},
				"1040055" : {
					"cause" : "集群选择的存储不存在。",
					"desc" : "集群选择的存储不存在。",
					"solution" : "请重新选择存储。"
				},
				"1040056" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请先创建存储池。"
				},
				"1040057" : {
					"cause" : "资源调度自动化级别参数不合法。",
					"desc" : "资源调度自动化级别参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040058" : {
					"cause" : "资源调度迁移阈值参数不合法。",
					"desc" : "资源调度迁移阈值参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040059" : {
					"cause" : "资源调度规则类型不合法。",
					"desc" : "资源调度规则类型不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040060" : {
					"cause" : "资源调度规则名称不合法。",
					"desc" : "资源调度规则名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040061" : {
					"cause" : "资源调度规则操作类型不合法。",
					"desc" : "资源调度规则操作类型不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040062" : {
					"cause" : "资源调度规则名称重复。",
					"desc" : "资源调度规则名称重复。",
					"solution" : "请不要使用重复的资源调度规则名称。"
				},
				"1040063" : {
					"cause" : "虚拟机不属于此集群，不能加入此集群的资源调度规则中。",
					"desc" : "虚拟机不属于此集群，不能加入此集群的资源调度规则中。",
					"solution" : "请选择合适的虚拟机。"
				},
				"1040064" : {
					"cause" : "此资源调度规则不属于目标集群，不能修改或删除。",
					"desc" : "此资源调度规则不属于目标集群，不能修改或删除。",
					"solution" : "请选择合适的资源调度规则。"
				},
				"1040065" : {
					"cause" : "资源调度规则编号为空。",
					"desc" : "资源调度规则编号为空。",
					"solution" : "请填写资源调度规则编号。"
				},
				"1040066" : {
					"cause" : "互斥虚拟机规则内虚拟机数量超过超过集群内主机数量或2个。",
					"desc" : "互斥虚拟机规则内虚拟机数量超过超过集群内主机数量或2个。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040067" : {
					"cause" : "资源调度规则数量不能超过20。",
					"desc" : "资源调度规则数量不能超过20。",
					"solution" : "请减少资源调度规则的数量。"
				},
				"1040068" : {
					"cause" : "子网{0}的VLAN号与子网{1}的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与子网{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040069" : {
					"cause" : "VLAN池{0}的VLAN号与子网{1}的VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与子网{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040070" : {
					"cause" : "子网{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040071" : {
					"cause" : "VLAN池{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040072" : {
					"cause" : "子网{0}的IP段与子网{1}的IP段冲突。",
					"desc" : "子网{0}的IP段与子网{1}的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040073" : {
					"cause" : "子网{0}的IP段与系统的内部子网IP段冲突。",
					"desc" : "子网{0}的IP段与系统的内部子网IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040074" : {
					"cause" : "子网{0}的IP段与系统的BMC IP池的IP段冲突。",
					"desc" : "子网{0}的IP段与系统的BMC IP池的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040075" : {
					"cause" : "子网{0}的VLAN号与系统的BMC IP池的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的BMC IP池的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040076" : {
					"cause" : "VLAN池{0}的VLAN号与系统的BMC IP池VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与系统的BMC IP池VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040077" : {
					"cause" : "子网{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040078" : {
					"cause" : "VLAN池{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040079" : {
					"cause" : "当前License已失效，无法进行发放/扩容操作。",
					"desc" : "当前License已失效，无法进行发放/扩容操作。",
					"solution" : "请申请有效的License，然后再进行集群操作。"
				},
				"1040080" : {
					"cause" : "集群下存在虚拟机，减容集群下的所有服务器失败。",
					"desc" : "集群下存在虚拟机，减容集群下的所有服务器失败。",
					"solution" : "请先清除该资源集群的虚拟机再试。"
				},
				"1040081" : {
					"cause" : "不能同时扩容管理节点和普通服务器。",
					"desc" : "不能同时扩容管理节点和普通服务器。",
					"solution" : "请不要同时扩容管理服务器和普通服务器。"
				},
				"1040082" : {
					"cause" : "集群下存在使用智能网卡直通模式的服务器，不允许打开内存复用开关。",
					"desc" : "集群下存在使用智能网卡直通模式的服务器，不允许打开内存复用开关。",
					"solution" : "请选择其它的服务器或关闭内存复用开关。"
				},
				"1040083" : {
					"cause" : "子网{0}的IP段与系统的汇聚交换机的IP段冲突。",
					"desc" : "子网{0}的IP段与系统的汇聚交换机的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040084" : {
					"cause" : "子网{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040085" : {
					"cause" : "VLAN{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"desc" : "VLAN{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040086" : {
					"cause" : "汇聚交换机的IP与系统子网IP冲突。",
					"desc" : "汇聚交换机的IP与系统子网IP冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040087" : {
					"cause" : "集群下存在服务器剩余物理内存不足以开启内存复用。",
					"desc" : "集群下存在服务器剩余物理内存不足以开启内存复用。",
					"solution" : "请确保集群下服务器剩余物理内存足够的前提下再进行内存复用开启。"
				},
				"1040088" : {
					"cause" : "集群下有应用正在创建中，请勿操作。",
					"desc" : "集群下有应用正在创建中，请勿操作。",
					"solution" : "请稍后重试。"
				},
				"1040089" : {
					"cause" : "修改资源集群基本信息失败。",
					"desc" : "修改资源集群基本信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040090" : {
					"cause" : "无法查询失败信息。",
					"desc" : "无法查询失败信息。",
					"solution" : "请刷新页面再试。"
				},
				"1040091" : {
					"cause" : "该计算资源调度的资源组已经不存在。",
					"desc" : "该计算资源调度的资源组已经不存在。",
					"solution" : "请重新选择资源组进行操作。"
				},
				"1040092" : {
					"cause" : "该计算资源调度的规则名重复。",
					"desc" : "该计算资源调度的规则名重复。",
					"solution" : "请重新选择不重复的规则名进行操作。"
				},
				"1040093" : {
					"cause" : "板位信息文件不存在。",
					"desc" : "板位信息文件不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040094" : {
					"cause" : "生产预安装还未完成。",
					"desc" : "生产预安装还未完成。",
					"solution" : "请在生产预安装完成后，重试。"
				},
				"1040095" : {
					"cause" : "管理集群发放状态冲突。",
					"desc" : "管理集群发放状态冲突。",
					"solution" : "只允许在发放失败、清理成功的状态下发放。"
				},
				"1040096" : {
					"cause" : "管理集群清理状态冲突。",
					"desc" : "管理集群清理状态冲突。",
					"solution" : "只允许在发放失败、清理失败的状态下清理。"
				},
				"1040097" : {
					"cause" : "集群名称已经存在。",
					"desc" : "集群名称已经存在。",
					"solution" : "请重新输入集群名称并重试。"
				},
				"1040098" : {
					"cause" : "不支持清理非FusionStorage存储类型的管理集群",
					"desc" : "不支持清理非FusionStorage存储类型的管理集群",
					"solution" : "请联系技术支持工程师。"
				},
				"1040099" : {
					"cause" : "每次只能减容一个数据存储。",
					"desc" : "每次只能减容一个数据存储。",
					"solution" : "请只选中一个数据存储减容。"
				},
				"1040100" : {
					"cause" : "数据存储中有磁盘存在，不能减容。",
					"desc" : "数据存储中有磁盘存在，不能减容。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040101" : {
					"cause" : "同一个集群下不能选择不同存储类型的存储池。",
					"desc" : "同一个集群下不能选择不同存储类型的存储池。",
					"solution" : "请选择同一种存储类型的存储池。"
				},
				"1040102" : {
					"cause" : "资源类型为空。",
					"desc" : "资源类型为空。",
					"solution" : "请选择合法的资源类型。"
				},
				"1040103" : {
					"cause" : "资源类型不合法。",
					"desc" : "资源类型不合法。",
					"solution" : "请选择合法的资源类型。"
				},
				"1040104" : {
					"cause" : "资源名称为空。",
					"desc" : "资源名称为空。",
					"solution" : "请输入资源名称。"
				},
				"1040105" : {
					"cause" : "该虚拟机不属于该集群。",
					"desc" : "该虚拟机不属于该集群。",
					"solution" : "请选择属于该集群的虚拟机。"
				},
				"1040106" : {
					"cause" : "该主机不属于该集群。",
					"desc" : "该主机不属于该集群。",
					"solution" : "请选择属于该集群的主机。"
				},
				"1040107" : {
					"cause" : "该资源组的类型与资源类型不匹配。",
					"desc" : "该资源组的类型与资源类型不匹配。",
					"solution" : "请输入与资源组类型匹配的资源。"
				},
				"1040108" : {
					"cause" : "资源组的名称已经存在。",
					"desc" : "资源组的名称已经存在。",
					"solution" : "请输入唯一的资源组名称"
				},
				"1040109" : {
					"cause" : "修改资源组成员类型为空。",
					"desc" : "修改资源组成员类型为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040110" : {
					"cause" : "修改资源组成员类型不合法。",
					"desc" : "修改资源组成员类型不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040111" : {
					"cause" : "该资源已经添加到资源组里面。",
					"desc" : "该资源已经添加到资源组里面。",
					"solution" : "请选择其它合适资源"
				},
				"1040112" : {
					"cause" : "资源组不能为空。",
					"desc" : "资源组不能为空。",
					"solution" : "请选择合适的资源组。"
				},
				"1040113" : {
					"cause" : "该虚拟机组已经存在规则。",
					"desc" : "该虚拟机组已经存在规则。",
					"solution" : "请选择合适的资源组。"
				},
				"1040114" : {
					"cause" : "资源调度的衡量因素不合法。",
					"desc" : "资源调度的衡量因素不合法。",
					"solution" : "请选择合法的资源调度的衡量因素。"
				},
				"1040115" : {
					"cause" : "资源调度的衡量因素为空。",
					"desc" : "资源调度的衡量因素为空。",
					"solution" : "请选择合法的资源调度的衡量因素。"
				},
				"1040116" : {
					"cause" : "资源调度的分时阈值的时段不合法。",
					"desc" : "资源调度的分时阈值的时段不合法。",
					"solution" : "请选择合法的资源调度的分时阈值时段。"
				},
				"1040117" : {
					"cause" : "资源调度的迁移阈值不合法。",
					"desc" : "资源调度的迁移阈值不合法。",
					"solution" : "请选择合法的资源调度的迁移阈值。"
				},
				"1040118" : {
					"cause" : "有资源不在资源组内。",
					"desc" : "有资源不在资源组内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040119" : {
					"cause" : "该资源组已经存在规则。",
					"desc" : "该资源组已经存在规则。",
					"solution" : "请选择合适的资源组。"
				},
				"1040120" : {
					"cause" : "有虚拟机已经添加了互斥规则。",
					"desc" : "有虚拟机已经添加了互斥规则。",
					"solution" : "请选择合适的虚拟机。"
				},
				"1040121" : {
					"cause" : "集群的资源分配策略不合法。",
					"desc" : "集群的资源分配策略不合法。",
					"solution" : "请选择合适的资源分配策略。"
				},
				"1040122" : {
					"cause" : "该主机组已经存在规则。",
					"desc" : "该主机组已经存在规则。",
					"solution" : "请选择合适的资源组。"
				},
				"1040123" : {
					"cause" : "配置管理网络失败。",
					"desc" : "配置管理网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040124" : {
					"cause" : "分配可用的管理IP失败。",
					"desc" : "分配可用的管理IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040125" : {
					"cause" : "安装CNA操作系统失败。",
					"desc" : "安装CNA操作系统失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040126" : {
					"cause" : "资源集群正在进行发放、扩减容或删除操作，修改绑定模式失败。",
					"desc" : "资源集群正在进行发放、扩减容或删除操作，修改绑定模式失败。",
					"solution" : "资源集群正在进行发放、扩减容或删除操作，请等待。"
				},
				"1040127" : {
					"cause" : "绑定模式正在修改中，请稍等。",
					"desc" : "绑定模式正在修改中，请稍等。",
					"solution" : "绑定模式正在修改中，请稍等。"
				},
				"1040128" : {
					"cause" : "资源集群的绑定模式正在修改或修改失败，需要修改成功才能扩容。",
					"desc" : "资源集群的绑定模式正在修改或修改失败，需要修改成功才能扩容。",
					"solution" : "扩容前请确保端口绑定模式修改成功。"
				},
				"1040129" : {
					"cause" : "资源集群的绑定模式正在修改或修改失败，需要修改成功才能减容。",
					"desc" : "资源集群的绑定模式正在修改或修改失败，需要修改成功才能减容。",
					"solution" : "减容前请确保端口绑定模式修改成功。"
				},
				"1040130" : {
					"cause" : "资源集群的绑定模式正在修改，需要修改完成后才能删除。",
					"desc" : "资源集群的绑定模式正在修改，需要修改完成后才能删除。",
					"solution" : "请等待修改绑定模式任务完成。"
				},
				"1040131" : {
					"cause" : "裸机集群不支持修改。",
					"desc" : "裸机集群不支持修改。",
					"solution" : "裸机集群不支持修改。"
				},
				"1040132" : {
					"cause" : "数据存储名称重复。",
					"desc" : "数据存储名称重复。",
					"solution" : "请修改数据存储名称。"
				},
				"1040133" : {
					"cause" : "UHM系统错误。",
					"desc" : "UHM系统错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040134" : {
					"cause" : "资源集群没有存储，扩容服务器失败。",
					"desc" : "资源集群没有存储，扩容服务器失败。",
					"solution" : "资源集群没有存储，不能进行服务器扩容，请先扩容存储。"
				},
				"1040135" : {
					"cause" : "资源集群不能将服务器全部减容。",
					"desc" : "资源集群不能将服务器全部减容。",
					"solution" : "资源集群不能将服务器全部减容。"
				},
				"1040136" : {
					"cause" : "资源集群不能将存储全部减容。",
					"desc" : "资源集群不能将存储全部减容。",
					"solution" : "资源集群不能将存储全部减容。"
				},
				"1040137" : {
					"cause" : "资源集群正在进行发放、扩减容或删除操作，不能再执行其他操作。",
					"desc" : "资源集群正在进行发放、扩减容或删除操作，不能再执行其他操作。",
					"solution" : "请稍后再试。"
				},
				"1040138" : {
					"cause" : "该资源集群下正在进行网络的创建、修改或删除，无法进行此操作。",
					"desc" : "该资源集群下正在进行网络的创建、修改或删除，无法进行此操作。",
					"solution" : "请稍后重试。"
				},
				"1040139" : {
					"cause" : "DRS建议不存在或已被应用。",
					"desc" : "DRS建议不存在或已被应用。",
					"solution" : "请刷新界面后重试。"
				},
				"1040140" : {
					"cause" : "无法查询集群下最大CPU核数。",
					"desc" : "无法查询集群下最大CPU核数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040141" : {
					"cause" : "您的license不允许该操作。",
					"desc" : "您的license不允许该操作。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1040142" : {
					"cause" : "License到期，请联系支持人员。",
					"desc" : "License到期，请联系支持人员。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1040143" : {
					"cause" : "所需CPU核数超过集群CPU核数。",
					"desc" : "所需CPU核数超过集群CPU核数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040144" : {
					"cause" : "操作系统版本为空。",
					"desc" : "操作系统版本为空。",
					"solution" : "请选择操作系统版本后重试。"
				},
				"1040145" : {
					"cause" : "所需CPU核数超过主机CPU核数。",
					"desc" : "所需CPU核数超过主机CPU核数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040146" : {
					"cause" : "有多个主机开启了opensm。",
					"desc" : "有多个主机开启了opensm。",
					"solution" : "请选择单个主机减容。"
				},
				"1040147" : {
					"cause" : "主机已被FusionStorage关联。",
					"desc" : "主机已被FusionStorage关联。",
					"solution" : "请删除主机上的FusionStorage资源后重试。"
				},
				"1040148" : {
					"cause" : "主机[{0}]正在启动opensm。",
					"desc" : "主机[{0}]正在启动opensm。",
					"solution" : "请稍后重试。"
				},
				"1040149" : {
					"cause" : "目的主机上有虚拟机已经添加了互斥规则。",
					"desc" : "目的主机上有虚拟机已经添加了互斥规则。",
					"solution" : "请选择其他主机。"
				},
				"1040150" : {
					"cause" : "“IMC模式”参数不合法。",
					"desc" : "“IMC模式”参数不合法。",
					"solution" : "请修正参数后重试。"
				},
				"1040151" : {
					"cause" : "“IMC开关”参数不合法。",
					"desc" : "“IMC开关”参数不合法。",
					"solution" : "请修正参数后重试。"
				},
				"1040152" : {
					"cause" : "此虚拟机正在克隆，不允许此操作。",
					"desc" : "此虚拟机正在克隆，不允许此操作。",
					"solution" : "请稍后重试。"
				},
				"1040153" : {
					"cause" : "聚集组内虚拟机不能全部迁移到目的主机，请排查聚集组内虚拟机后重试。",
					"desc" : "聚集组内虚拟机不能全部迁移到目的主机，请排查聚集组内虚拟机后重试。",
					"solution" : "请重新选择虚拟机。"
				},
				"1040154" : {
					"cause" : "该虚拟机已挂载光驱或者Tools，不允许迁移。",
					"desc" : "该虚拟机已挂载光驱或者Tools，不允许迁移。",
					"solution" : "请卸载光驱后重试。"
				},
				"1040155" : {
					"cause" : "集群下存在主机与IMC模式不兼容，主机CPU缺少该模式所需要的CPU功能。操作执行失败。",
					"desc" : "集群下存在主机与IMC模式不兼容，主机CPU缺少该模式所需要的CPU功能。操作执行失败。",
					"solution" : "请检查主机CPU规格。"
				},
				"1040156" : {
					"cause" : "集群中存在休眠态或运行态的虚拟机与要修改的集群模式不兼容，如需修改请首先唤醒休眠态的虚拟机，然后将运行态的虚拟机迁移出该集群或者关机。",
					"desc" : "集群中存在休眠态或运行态的虚拟机与要修改的集群模式不兼容，如需修改请首先唤醒休眠态的虚拟机，然后将运行态的虚拟机迁移出该集群或者关机。",
					"solution" : "请首先唤醒休眠态的虚拟机，然后将运行态的虚拟机迁移出该集群或者关机。"
				},
				"1040157" : {
					"cause" : "操作系统镜像文件不在指定路径下。",
					"desc" : "操作系统镜像文件不在指定路径下。",
					"solution" : "请检查上传的操作系统ISO是否存在和该文件权限是否正确。"
				},
				"1040158" : {
					"cause" : "集群中运行中或已休眠的虚拟机CPU配置与要修改的集群IMC模式不兼容，可能正在使用该模式隐藏的CPU功能。若要修改，需将这些虚拟机迁移出该集群或者关机。",
					"desc" : "集群中运行中或已休眠的虚拟机CPU配置与要修改的集群IMC模式不兼容，可能正在使用该模式隐藏的CPU功能。若要修改，需将这些虚拟机迁移出该集群或者关机。",
					"solution" : "请将这些虚拟机迁移出该集群或者关机。"
				},
				"1040159" : {
					"cause" : "主机配置IMC失败，请检查IMC配置。",
					"desc" : "主机配置IMC失败，请检查IMC配置。",
					"solution" : "请检查IMC配置。"
				},
				"1040160" : {
					"cause" : "主机与IMC模式不兼容，主机CPU缺少该IMC模式所需要的CPU功能。操作执行失败。",
					"desc" : "主机与IMC模式不兼容，主机CPU缺少该IMC模式所需要的CPU功能。操作执行失败。",
					"solution" : "请检查主机CPU规格。"
				},
				"1040161" : {
					"cause" : "此虚拟机的CPU设置与异构迁移集群IMC模式配置不兼容，可能正在使用IMC模式隐藏的CPU功能。操作执行失败。",
					"desc" : "此虚拟机的CPU设置与异构迁移集群IMC模式配置不兼容，可能正在使用IMC模式隐藏的CPU功能。操作执行失败。",
					"solution" : "请检查虚拟机与迁入集群的IMC模式设置。"
				},
				"1040162" : {
					"cause" : "该虚拟机不是由FusionManager创建，不能设置开始运行时间。",
					"desc" : "该虚拟机不是由FusionManager创建，不能设置开始运行时间。",
					"solution" : "请联系虚拟机管理员。"
				},
				"1040163" : {
					"cause" : "集群中存在非稳态虚拟机，不允许该操作。",
					"desc" : "集群中存在非稳态虚拟机，不允许该操作。",
					"solution" : "请等待虚拟机状态稳定后再重试。"
				},
				"1040164" : {
					"cause" : "集群中存在初始化状态的主机，不允许该操作。",
					"desc" : "集群中存在初始化状态的主机，不允许该操作。",
					"solution" : "请稍候重试。"
				},
				"1040165" : {
					"cause" : "因目的主机的CPU配置与当前虚拟机的CPU配置不兼容，迁移虚拟机失败。",
					"desc" : "因目的主机的CPU配置与当前虚拟机的CPU配置不兼容，迁移虚拟机失败。",
					"solution" : "请检查虚拟机CPU规格。"
				},
				"1040166" : {
					"cause" : "安装操作系统失败。",
					"desc" : "安装操作系统失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040167" : {
					"cause" : "安装源不存在。",
					"desc" : "安装源不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040168" : {
					"cause" : "系统正在执行其他任务。",
					"desc" : "系统正在执行其他任务。",
					"solution" : "请稍后再试。"
				},
				"1040169" : {
					"cause" : "该服务器没有符合系统规格的磁盘，安装操作系统失败。",
					"desc" : "该服务器没有符合系统规格的磁盘，安装操作系统失败。",
					"solution" : "请给服务器配置符合系统规格的磁盘。"
				},
				"1040170" : {
					"cause" : "该主机关联了共享存储，且是共享存储下的唯一主机，无法移除。",
					"desc" : "该主机关联了共享存储，且是共享存储下的唯一主机，无法移除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040171" : {
					"cause" : "LCNA的ZK槽位没有可用硬盘。",
					"desc" : "LCNA的ZK槽位没有可用硬盘。",
					"solution" : "请检查LCNA ZK槽位硬盘。"
				},
				"1040172" : {
					"cause" : "LCNA槽位未插入刀片或刀片没有成功发现。",
					"desc" : "LCNA槽位未插入刀片或刀片没有成功发现。",
					"solution" : "请检查LCNA槽位上是否有就绪的刀片。"
				},
				"1040188" : {
					"cause" : "没找到管理集群。",
					"desc" : "没找到管理集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050000" : {
					"cause" : "端口组名称没有输入。",
					"desc" : "端口组名称没有输入。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050001" : {
					"cause" : "无效的端口组名称。",
					"desc" : "无效的端口组名称。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050002" : {
					"cause" : "子网ID和VLAN ID有且只能有一个有值。",
					"desc" : "子网ID和VLAN ID有且只能有一个有值。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050003" : {
					"cause" : "无效的子网ID。",
					"desc" : "无效的子网ID。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050004" : {
					"cause" : "无效的VLAN ID。",
					"desc" : "无效的VLAN ID。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050005" : {
					"cause" : "端口组ID没有输入。",
					"desc" : "端口组ID没有输入。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050006" : {
					"cause" : "端口组不存在或者端口组ID无效。",
					"desc" : "端口组不存在或者端口组ID无效。",
					"solution" : "请刷新页面重试或联系管理员。"
				},
				"1050007" : {
					"cause" : "无效的端口组描述。",
					"desc" : "无效的端口组描述。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050008" : {
					"cause" : "用户资源不足或无效用户ID。",
					"desc" : "用户资源不足或无效用户ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050009" : {
					"cause" : "该端口组不存在。",
					"desc" : "该端口组不存在。",
					"solution" : "请刷新页面重试或联系管理员。"
				},
				"1050010" : {
					"cause" : "没有指定端口组的类型。",
					"desc" : "没有指定端口组的类型。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050011" : {
					"cause" : "带宽限速输入非法。",
					"desc" : "带宽限速输入非法。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050012" : {
					"cause" : "优先级输入非法。",
					"desc" : "优先级输入非法。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050013" : {
					"cause" : "端口组列表中的子网或VLAN不属于同一个资源集群。",
					"desc" : "端口组列表中的子网或VLAN不属于同一个资源集群。",
					"solution" : "请选择同一个资源集群下的端口组。"
				},
				"1050014" : {
					"cause" : "发送上限带宽和优先级必须同时配置，或同时不配置。",
					"desc" : "发送上限带宽和优先级必须同时配置，或同时不配置。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050015" : {
					"cause" : "子网的值不能修改。",
					"desc" : "子网的值不能修改。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050016" : {
					"cause" : "VLAN类型不能修改为子网类型。",
					"desc" : "VLAN类型不能修改为子网类型。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050017" : {
					"cause" : "DVS不存在。",
					"desc" : "DVS不存在。",
					"solution" : ""
				},
				"1050022" : {
					"cause" : "DVS没有关联VLAN Pool。",
					"desc" : "DVS没有关联VLAN Pool。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050027" : {
					"cause" : "所选DVS下VLAN ID 重复。",
					"desc" : "所选DVS下VLAN ID 重复。",
					"solution" : "请选其他VLAN ID。"
				},
				"1050028" : {
					"cause" : "VSS不存在。",
					"desc" : "VSS不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050042" : {
					"cause" : "关联DVS失败。",
					"desc" : "关联DVS失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060001" : {
					"cause" : "未发现新的存储。",
					"desc" : "未发现新的存储。",
					"solution" : "请查看新的存储设备是否工作正常。"
				},
				"1060002" : {
					"cause" : "该存储已被资源集群绑定，删除失败。",
					"desc" : "该存储已被资源集群绑定，删除失败。",
					"solution" : "请先删除绑定的资源集群或减容资源集群中的该存储。"
				},
				"1060003" : {
					"cause" : "磁盘列表和磁盘数同时存在。",
					"desc" : "磁盘列表和磁盘数同时存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060004" : {
					"cause" : "tier层无有效的磁盘参数。",
					"desc" : "tier层无有效的磁盘参数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060005" : {
					"cause" : "没有有效的tier层。",
					"desc" : "没有有效的tier层。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060006" : {
					"cause" : "无效的SAN设备序列号。",
					"desc" : "无效的SAN设备序列号。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060007" : {
					"cause" : "存储名称太长或太短。",
					"desc" : "存储名称太长或太短。",
					"solution" : "请填写合适的名称长度。"
				},
				"1060008" : {
					"cause" : "存储描述信息太长。",
					"desc" : "存储描述信息太长。",
					"solution" : "请填写合适的描述信息长度。"
				},
				"1060009" : {
					"cause" : "threshold参数不在有效范围内。",
					"desc" : "threshold参数不在有效范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060010" : {
					"cause" : "迁移模式设置不在规定范围。",
					"desc" : "迁移模式设置不在规定范围。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060011" : {
					"cause" : "RAIDlv设置不在规定范围。",
					"desc" : "RAIDlv设置不在规定范围。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060012" : {
					"cause" : "磁盘类型与tier冲突。",
					"desc" : "磁盘类型与tier冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060013" : {
					"cause" : "无效的热备策略。",
					"desc" : "无效的热备策略。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060014" : {
					"cause" : "未知的磁盘类型。",
					"desc" : "未知的磁盘类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060015" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060016" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060017" : {
					"cause" : "存储名称重复。",
					"desc" : "存储名称重复。",
					"solution" : "请重新输入名称。"
				},
				"1060018" : {
					"cause" : "选用的磁盘小于该RAID的剩余（或最小）磁盘数。",
					"desc" : "选用的磁盘小于该RAID的剩余（或最小）磁盘数。",
					"solution" : "请添加磁盘。"
				},
				"1060019" : {
					"cause" : "选用的磁盘状态异常，需检查磁盘状态。",
					"desc" : "选用的磁盘状态异常，需检查磁盘状态。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060020" : {
					"cause" : "选用的磁盘已被占用。",
					"desc" : "选用的磁盘已被占用。",
					"solution" : "请重新选择磁盘。"
				},
				"1060021" : {
					"cause" : "空间不足，无法创建迁移任务。",
					"desc" : "空间不足，无法创建迁移任务。",
					"solution" : "请重新迁移。"
				},
				"1060022" : {
					"cause" : "FusionStorage存储类型不支持迁移。",
					"desc" : "FusionStorage存储类型不支持迁移。",
					"solution" : "请确认存储类型。"
				},
				"1060023" : {
					"cause" : "空间不足，无法创建迁移任务。",
					"desc" : "空间不足，无法创建迁移任务。",
					"solution" : "请确认数据存储空间。"
				},
				"1060024" : {
					"cause" : "数据存储不存在。",
					"desc" : "数据存储不存在。",
					"solution" : "请确认数据存储是否存在。"
				},
				"1060025" : {
					"cause" : "内存交换磁盘不允许卸载。",
					"desc" : "内存交换磁盘不允许卸载。",
					"solution" : "请选择合适的磁盘进行卸载操作。"
				},
				"1060026" : {
					"cause" : "共享磁盘不允许格式化。",
					"desc" : "共享磁盘不允许格式化。",
					"solution" : "请选择合适的磁盘进行操作。"
				},
				"1060027" : {
					"cause" : "数据存储的存储类型不支持创建精简磁盘。",
					"desc" : "数据存储的存储类型不支持创建精简磁盘。",
					"solution" : "请选择合适的数据存储进行操作。"
				},
				"1060028" : {
					"cause" : "存储池中有LUN存在，删除失败。",
					"desc" : "存储池中有LUN存在，删除失败。",
					"solution" : "请先删除存储池中的LUN。"
				},
				"1060029" : {
					"cause" : "该虚拟机/模板存在未完成的任务，待任务完成后重试。",
					"desc" : "该虚拟机/模板存在未完成的任务，待任务完成后重试。",
					"solution" : "待任务完成后重试。"
				},
				"1060030" : {
					"cause" : "存储池剩余容量不足。",
					"desc" : "存储池剩余容量不足。",
					"solution" : "请确认存储池剩余容量。"
				},
				"1060031" : {
					"cause" : "指定的存储池不存在。",
					"desc" : "指定的存储池不存在。",
					"solution" : "请确认存储池是否存在。"
				},
				"1060032" : {
					"cause" : "创建LUN超时。",
					"desc" : "创建LUN超时。",
					"solution" : "请重新创建"
				},
				"1060033" : {
					"cause" : "与SAN设备通信失败。",
					"desc" : "与SAN设备通信失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060034" : {
					"cause" : "数据存储正在删除或创建，不允许更新。",
					"desc" : "数据存储正在删除或创建，不允许更新。",
					"solution" : "请稍后重试。"
				},
				"1060035" : {
					"cause" : "存储中有IO存在。",
					"desc" : "存储中有IO存在。",
					"solution" : "请稍后重试。"
				},
				"1060036" : {
					"cause" : "数据存储不可访问。",
					"desc" : "数据存储不可访问。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060037" : {
					"cause" : "存储资源不支持该操作。",
					"desc" : "存储资源不支持该操作。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1060038" : {
					"cause" : "资源分区不存在。",
					"desc" : "资源分区不存在。",
					"solution" : "请确认资源分区是否存在。"
				},
				"1060039" : {
					"cause" : "容灾存储组名称重复。",
					"desc" : "容灾存储组名称重复。",
					"solution" : "请更改容灾存储组名后再进行操作。"
				},
				"1060040" : {
					"cause" : "选择的存储无法添加到当前容灾存储组。",
					"desc" : "选择的存储无法添加到当前容灾存储组。",
					"solution" : "请确认所选存储列表中不存在任何已添加到其他容灾存储组的存储。"
				},
				"1060041" : {
					"cause" : "容灾存储组中存在存储，不允许删除。",
					"desc" : "容灾存储组中存在存储，不允许删除。",
					"solution" : "请先删除容灾存储组中的存储。"
				},
				"1060042" : {
					"cause" : "容灾存储组不存在。",
					"desc" : "容灾存储组不存在。",
					"solution" : "请确认容灾存储组是否存在。"
				},
				"1060043" : {
					"cause" : "数据存储未在FusionManager中记录，请更新虚拟化环境再试。",
					"desc" : "数据存储未在FusionManager中记录，请更新虚拟化环境再试。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1060044" : {
					"cause" : "数据存储不存在，请刷新页面再试。",
					"desc" : "数据存储不存在，请刷新页面再试。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1060045" : {
					"cause" : "指定的存储不存在。",
					"desc" : "指定的存储不存在。",
					"solution" : "指定的存储不存在。"
				},
				"1060046" : {
					"cause" : "绑定数据存储失败。",
					"desc" : "绑定数据存储失败。",
					"solution" : "请减容数据存储后再操作。"
				},
				"1060047" : {
					"cause" : "当前虚拟机没有绑定磁盘。",
					"desc" : "当前虚拟机没有绑定磁盘。",
					"solution" : "请确认该虚拟机是否存在磁盘。"
				},
				"1060048" : {
					"cause" : "存储处于维护模式，不允许该操作。",
					"desc" : "存储处于维护模式，不允许该操作。",
					"solution" : "请将存储退出维护模式。"
				},
				"1060050" : {
					"cause" : "存储类型为FusionStorage的磁盘最大容量是16383G。",
					"desc" : "存储类型为FusionStorage的磁盘最大容量是16383G。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060051" : {
					"cause" : "存储类型不是ipsan或dsware。",
					"desc" : "存储类型不是ipsan或dsware。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060052" : {
					"cause" : "选择的磁盘中，存在不允许存储迁移的磁盘。",
					"desc" : "选择的磁盘中，存在不允许存储迁移的磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060120" : {
					"cause" : "当前存储类型不支持创建普通延迟置零磁盘。",
					"desc" : "当前存储类型不支持创建普通延迟置零磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060137" : {
					"cause" : "数据存储正在添加中。",
					"desc" : "数据存储正在添加中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060138" : {
					"cause" : "数据存储正在删除中。",
					"desc" : "数据存储正在删除中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060139" : {
					"cause" : "存储IP不允许重复。",
					"desc" : "存储IP不允许重复。",
					"solution" : "请输入没有重复的存储IP。"
				},
				"1060140" : {
					"cause" : "存储IP或端口参数不合法。",
					"desc" : "存储IP或端口参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060141" : {
					"cause" : "系统可能出现异常，请排查。",
					"desc" : "系统可能出现异常，请排查。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060142" : {
					"cause" : "系统可能出现异常，请排查。",
					"desc" : "系统可能出现异常，请排查。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060143" : {
					"cause" : "磁盘ID为空。",
					"desc" : "磁盘ID为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060144" : {
					"cause" : "磁盘正在创建备份或者恢复，不能再进行创建备份或者恢复。",
					"desc" : "磁盘正在创建备份或者恢复，不能再进行创建备份或者恢复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060180" : {
					"cause" : "数据存储状态异常。",
					"desc" : "数据存储状态异常。",
					"solution" : "请检查数据存储状态。"
				},
				"1070004" : {
					"cause" : "批量操作虚拟机数大于100。",
					"desc" : "批量操作虚拟机数大于100。",
					"solution" : "请减少一次操作的虚拟机数，不能超过100。"
				},
				"1070007" : {
					"cause" : "该虚拟机对应的虚拟机模板不存在，不支持该操作。",
					"desc" : "该虚拟机对应的虚拟机模板不存在，不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070008" : {
					"cause" : "待修复虚拟机磁盘已经达到上限，不能修复。",
					"desc" : "待修复虚拟机磁盘已经达到上限，不能修复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070009" : {
					"cause" : "待修复虚拟机正在修复中。",
					"desc" : "待修复虚拟机正在修复中。",
					"solution" : "请稍候再试。"
				},
				"1070010" : {
					"cause" : "批量操作卷数量大于100。",
					"desc" : "批量操作卷数量大于100。",
					"solution" : "请减少一次操作的卷数量，不能超过100。"
				},
				"1070011" : {
					"cause" : "批量迁移虚拟机数大于8。",
					"desc" : "批量迁移虚拟机数大于8。",
					"solution" : "请减少一次迁移的虚拟机数，不能超过8。"
				},
				"1070012" : {
					"cause" : "选择进行回收的磁盘数量超过40。",
					"desc" : "选择进行回收的磁盘数量超过40。",
					"solution" : "请选择不超过40个磁盘进行回收。"
				},
				"1070017" : {
					"cause" : "虚拟机添加磁盘失败。",
					"desc" : "虚拟机添加磁盘失败。",
					"solution" : "请稍后重试。"
				},
				"1070018" : {
					"cause" : "虚拟机删除磁盘失败。",
					"desc" : "虚拟机删除磁盘失败。",
					"solution" : "请稍后重试。"
				},
				"1070019" : {
					"cause" : "虚拟机添加磁盘失败，回滚删除磁盘失败。",
					"desc" : "虚拟机添加磁盘失败，回滚删除磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070020" : {
					"cause" : "虚拟机删除磁盘失败，回滚添加磁盘失败。",
					"desc" : "虚拟机删除磁盘失败，回滚添加磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070021" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070022" : {
					"cause" : "虚拟机状态冲突，只有运行中或已停止状态才能修复。",
					"desc" : "虚拟机状态冲突，只有运行中或已停止状态才能修复。",
					"solution" : "请确认虚拟机状态后再试。"
				},
				"1070023" : {
					"cause" : "当前用户不属于任何域。",
					"desc" : "当前用户不属于任何域。",
					"solution" : "请增加用户的管理域后重试。"
				},
				"1070024" : {
					"cause" : "任务执行失败。",
					"desc" : "任务执行失败。",
					"solution" : "请登录Vcenter查看任务详情。"
				},
				"1070025" : {
					"cause" : "迁移操作异常。",
					"desc" : "迁移操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070033" : {
					"cause" : "此虚拟机在任务中心有尚未结束的任务。",
					"desc" : "此虚拟机在任务中心有尚未结束的任务。",
					"solution" : "请稍后重试。"
				},
				"1070038" : {
					"cause" : "网卡不存在。",
					"desc" : "网卡不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070039" : {
					"cause" : "虚拟化环境处理错误。",
					"desc" : "虚拟化环境处理错误。",
					"solution" : "虚拟化环境处理错误，请稍后重试。"
				},
				"1070040" : {
					"cause" : "快照正在使用中，不允许此操作。",
					"desc" : "快照正在使用中，不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070042" : {
					"cause" : "虚拟机状态冲突，无法支持此操作。",
					"desc" : "虚拟机状态冲突，无法支持此操作。",
					"solution" : "请在虚拟机状态允许情况下进行操作。"
				},
				"1070043" : {
					"cause" : "虚拟机无法支持该操作，当前状态下CPU核数只能修改成当前核数的两倍。",
					"desc" : "虚拟机无法支持该操作，当前状态下CPU核数只能修改成当前核数的两倍。",
					"solution" : "请在虚拟机状态允许情况下进行操作。"
				},
				"1070046" : {
					"cause" : "数据存储的状态不支持该操作或者没有与集群所有主机绑定或者已被使用。",
					"desc" : "数据存储的状态不支持该操作或者没有与集群所有主机绑定或者已被使用。",
					"solution" : "确保数据存储的状态正常并与所有集群绑定。"
				},
				"1070050" : {
					"cause" : "MAC地址没有配置，也不在MAC地址段中。请在资源>虚拟化>虚拟化环境页面配置MAC地址。",
					"desc" : "MAC地址没有配置，也不在MAC地址段中。请在资源>虚拟化>虚拟化环境页面配置MAC地址。",
					"solution" : "请输入已配置的MAC地址或者选中MAC地址段中的MAC地址。"
				},
				"1070051" : {
					"cause" : "Mac地址已经存在。",
					"desc" : "Mac地址已经存在。",
					"solution" : "请选择未被配置的MAC地址。"
				},
				"1070052" : {
					"cause" : "可用CPU资源不足，无法执行该操作。",
					"desc" : "可用CPU资源不足，无法执行该操作。",
					"solution" : "请检查资源是否足够。"
				},
				"1070053" : {
					"cause" : "可用内存资源不足。",
					"desc" : "可用内存资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070054" : {
					"cause" : "可用存储资源不足，无法执行该操作。",
					"desc" : "可用存储资源不足，无法执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070055" : {
					"cause" : "组织VDC下的CPU资源不足。",
					"desc" : "组织VDC下的CPU资源不足。",
					"solution" : "请检查资源是否充足。"
				},
				"1070056" : {
					"cause" : "组织VDC下的内存资源不足。",
					"desc" : "组织VDC下的内存资源不足。",
					"solution" : "请检查资源是否充足。"
				},
				"1070057" : {
					"cause" : "组织VDC下的存储资源不足。",
					"desc" : "组织VDC下的存储资源不足。",
					"solution" : "请检查资源是否充足。"
				},
				"1070058" : {
					"cause" : "指定的虚拟机模板或者指定的虚拟机逻辑模板对应的虚拟机模板无效。",
					"desc" : "指定的虚拟机模板或者指定的虚拟机逻辑模板对应的虚拟机模板无效。",
					"solution" : "请检查虚拟机模板或者虚拟机逻辑模板对应的虚拟机模板是否可用。"
				},
				"1070060" : {
					"cause" : "非虚拟机模板不能配置。",
					"desc" : "非虚拟机模板不能配置。",
					"solution" : "请选择虚拟机模板。"
				},
				"1070061" : {
					"cause" : "主机状态异常。",
					"desc" : "主机状态异常。",
					"solution" : "请检查主机状态是否正常。"
				},
				"1070062" : {
					"cause" : "配置iCache时，主机空闲物理内存不足。",
					"desc" : "配置iCache时，主机空闲物理内存不足。",
					"solution" : "请稍后重试。"
				},
				"1070063" : {
					"cause" : "配置iCache时，扩内存超时。",
					"desc" : "配置iCache时，扩内存超时。",
					"solution" : "请稍后重试。"
				},
				"1070064" : {
					"cause" : "清iCache配置时，减内存超时失败。",
					"desc" : "清iCache配置时，减内存超时失败。",
					"solution" : "请稍后重试。"
				},
				"1070065" : {
					"cause" : "释放内存量过大。",
					"desc" : "释放内存量过大。",
					"solution" : "请稍后重试。"
				},
				"1070066" : {
					"cause" : "配置iCache时，底层处理异常。",
					"desc" : "配置iCache时，底层处理异常。",
					"solution" : "请稍后重试。"
				},
				"1070067" : {
					"cause" : "配置了iCache的模板，不允许删除。",
					"desc" : "配置了iCache的模板，不允许删除。",
					"solution" : "无。"
				},
				"1070068" : {
					"cause" : "模板的系统盘为非持久化盘，不容许配置iCache。",
					"desc" : "模板的系统盘为非持久化盘，不容许配置iCache。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"1070069" : {
					"cause" : "模板存没有系统盘，不容许配置iCache。",
					"desc" : "模板存没有系统盘，不容许配置iCache。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"1070070" : {
					"cause" : "配置iCache的模板不容许转为虚拟机。",
					"desc" : "配置iCache的模板不容许转为虚拟机。",
					"solution" : "请选择没有配置iCache的虚拟机。"
				},
				"1070071" : {
					"cause" : "模板存在链接克隆虚拟机，删除iCache配置失败。",
					"desc" : "模板存在链接克隆虚拟机，删除iCache配置失败。",
					"solution" : "请选择没有配置iCache的虚拟机。"
				},
				"1070072" : {
					"cause" : "配置iCache的模板个数超出最大限制。",
					"desc" : "配置iCache的模板个数超出最大限制。",
					"solution" : "无。"
				},
				"1070073" : {
					"cause" : "虚拟机不支持链接克隆。",
					"desc" : "虚拟机不支持链接克隆。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"1070074" : {
					"cause" : "该虚拟机存储类型不支持配置iCache。",
					"desc" : "该虚拟机存储类型不支持配置iCache。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"1070075" : {
					"cause" : "虚拟机下没有可用的光驱。",
					"desc" : "虚拟机下没有可用的光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070076" : {
					"cause" : "模板虚拟机不支持此操作。",
					"desc" : "模板虚拟机不支持此操作。",
					"solution" : "请选择其他虚拟机进行操作。"
				},
				"1070077" : {
					"cause" : "虚拟机不存在该网卡，无法进行此操作。",
					"desc" : "虚拟机不存在该网卡，无法进行此操作。",
					"solution" : "请选择合适的网卡进行操作。"
				},
				"1070078" : {
					"cause" : "资源组所选虚拟机中有虚拟机已经不存在。",
					"desc" : "资源组所选虚拟机中有虚拟机已经不存在。",
					"solution" : "请刷新界面后选择存在的虚拟机。"
				},
				"1070079" : {
					"cause" : "资源组所选主机中有主机已经不存在。",
					"desc" : "资源组所选主机中有主机已经不存在。",
					"solution" : "请刷新界面后选择存在的主机。"
				},
				"1070080" : {
					"cause" : "快照任务正在进行中，单个虚拟机不能同时操作多个快照任务。",
					"desc" : "快照任务正在进行中，单个虚拟机不能同时操作多个快照任务。",
					"solution" : "请等进行中的快照任务完成后再开始另一个快照任务。"
				},
				"1070081" : {
					"cause" : "虚拟机磁盘任务正在进行中，无法进行此操作。",
					"desc" : "虚拟机磁盘任务正在进行中，无法进行此操作。",
					"solution" : "请稍后重试。"
				},
				"1070082" : {
					"cause" : "系统磁盘不能解绑定。",
					"desc" : "系统磁盘不能解绑定。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070083" : {
					"cause" : "虚拟机不支持非停止状态进行删除操作。",
					"desc" : "虚拟机不支持非停止状态进行删除操作。",
					"solution" : "请关闭虚拟机后再进行删除操作。"
				},
				"1070084" : {
					"cause" : "预留值比限制值[{0}]大，设置失败。",
					"desc" : "预留值比限制值[{0}]大，设置失败。",
					"solution" : "请选择合适的预留值进行设置。"
				},
				"1070085" : {
					"cause" : "每个物理CPU的容量都不足。",
					"desc" : "每个物理CPU的容量都不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070086" : {
					"cause" : "SMI-S服务异常，请登录SAN设备进行排查。",
					"desc" : "SMI-S服务异常，请登录SAN设备进行排查。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070087" : {
					"cause" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"desc" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"solution" : "请选择有效磁盘进行资源回收操作。"
				},
				"1070088" : {
					"cause" : "重新创建内存交换磁盘失败。",
					"desc" : "重新创建内存交换磁盘失败。",
					"solution" : "请联系系统管理员。"
				},
				"1070089" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070090" : {
					"cause" : "删除快照失败。",
					"desc" : "删除快照失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070091" : {
					"cause" : "主机CPU资源不满足条件。",
					"desc" : "主机CPU资源不满足条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070092" : {
					"cause" : "修改的CPU核数超过虚拟机操作系统支持的上限{0}。",
					"desc" : "修改的CPU核数超过虚拟机操作系统支持的上限{0}。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070093" : {
					"cause" : "扩容的大小超过数据存储支持的最大值。",
					"desc" : "扩容的大小超过数据存储支持的最大值。",
					"solution" : "请确认数据存储支持的最大值。"
				},
				"1070094" : {
					"cause" : "虚拟机配置了独立磁盘，无法创建内存快照。",
					"desc" : "虚拟机配置了独立磁盘，无法创建内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070095" : {
					"cause" : "虚拟机有设备不满足迁移条件。例如：虚拟机有非持久化磁盘。",
					"desc" : "虚拟机有设备不满足迁移条件。例如：虚拟机有非持久化磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070096" : {
					"cause" : "虚拟机有快照，不支持修改磁盘属性。",
					"desc" : "虚拟机有快照，不支持修改磁盘属性。",
					"solution" : "请先删除该虚拟机的快照（如果允许），再执行此操作。"
				},
				"1070097" : {
					"cause" : "当前存储类型只支持创建精简磁盘。",
					"desc" : "当前存储类型只支持创建精简磁盘。",
					"solution" : "请选择精简磁盘进行创建。"
				},
				"1070098" : {
					"cause" : "主机已断开连接，无法与之进行通信。",
					"desc" : "主机已断开连接，无法与之进行通信。",
					"solution" : "请检查主机状态是否正常，或联系技术支持工程师。"
				},
				"1070099" : {
					"cause" : "可读写的存储空间不足。",
					"desc" : "可读写的存储空间不足。",
					"solution" : "请选择合适的存储容量。"
				},
				"1070100" : {
					"cause" : "该磁盘不支持空间回收，如果磁盘存在快照，请删除快照完成后重新进行空间回收操作；如果磁盘是非精简类型、共享类型、非虚拟化类型或者链接克隆系统磁盘，则无法支持空间回收。",
					"desc" : "该磁盘不支持空间回收，如果磁盘存在快照，请删除快照完成后重新进行空间回收操作；如果磁盘是非精简类型、共享类型、非虚拟化类型或者链接克隆系统磁盘，则无法支持空间回收。",
					"solution" : "请选择有效磁盘进行资源回收操作。"
				},
				"1070101" : {
					"cause" : "只有休眠或者关闭的虚拟机才支持磁盘资源回收。",
					"desc" : "只有休眠或者关闭的虚拟机才支持磁盘资源回收。",
					"solution" : "请选择休眠或者关闭的虚拟机。"
				},
				"1070102" : {
					"cause" : "磁盘资源回收失败。",
					"desc" : "磁盘资源回收失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070103" : {
					"cause" : "内存交换磁盘不允许资源回收。",
					"desc" : "内存交换磁盘不允许资源回收。",
					"solution" : "请选择其他磁盘进行资源回收操作。"
				},
				"1070104" : {
					"cause" : "模板虚拟机不支持磁盘资源回收。",
					"desc" : "模板虚拟机不支持磁盘资源回收。",
					"solution" : "请选择普通虚拟机进行磁盘资源回收。"
				},
				"1070105" : {
					"cause" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"desc" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"solution" : "请选择有效磁盘进行资源回收操作。"
				},
				"1070106" : {
					"cause" : "虚拟机的状态自上次执行快照操作以来未发生变化。",
					"desc" : "虚拟机的状态自上次执行快照操作以来未发生变化。",
					"solution" : "请等待虚拟机状态发生改变后重试。"
				},
				"1070107" : {
					"cause" : "源或目标主机上的vMotion接口未配置（或者配置错误）。",
					"desc" : "源或目标主机上的vMotion接口未配置（或者配置错误）。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070108" : {
					"cause" : "虚拟机的网络配置不允许执行该操作。",
					"desc" : "虚拟机的网络配置不允许执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070109" : {
					"cause" : "在主机的当前连接状况下不允许执行该操作。",
					"desc" : "在主机的当前连接状况下不允许执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070110" : {
					"cause" : "虚拟机操作超时。",
					"desc" : "虚拟机操作超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070111" : {
					"cause" : "虚拟机删除失败：网卡绑定了弹性IP或设置了NAPT.",
					"desc" : "虚拟机删除失败：网卡绑定了弹性IP或设置了NAPT.",
					"solution" : "请联系技术支持工程师。"
				},
				"1070112" : {
					"cause" : "虚拟机和选择的网络不在相同的集群下。",
					"desc" : "虚拟机和选择的网络不在相同的集群下。",
					"solution" : "请选择其它网络重新操作。"
				},
				"1070113" : {
					"cause" : "虚拟机网卡绑定了弹性IP或未释放DNAT服务，不能删除和修改。",
					"desc" : "虚拟机网卡绑定了弹性IP或未释放DNAT服务，不能删除和修改。",
					"solution" : "请解绑定后重试。"
				},
				"1070114" : {
					"cause" : "虚拟机有网卡绑定了弹性IP.",
					"desc" : "虚拟机有网卡绑定了弹性IP.",
					"solution" : "请将弹性IP解绑后再进行该操作."
				},
				"10700115" : {
					"cause" : "虚拟机有网卡设置了DNAT.",
					"desc" : "虚拟机有网卡设置了DNAT.",
					"solution" : "请将DNAT删除后再进行该操作."
				},
				"10700116" : {
					"cause" : "虚拟机有网卡在安全组中.",
					"desc" : "虚拟机有网卡在安全组中.",
					"solution" : "请将网卡从安全组中退出再进行该操作."
				},
				"1070115" : {
					"cause" : "虚拟机快照数量达到上限，不允许在线克隆虚拟机。",
					"desc" : "虚拟机快照数量达到上限，不允许在线克隆虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070116" : {
					"cause" : "虚拟机存在独立磁盘，不允许进行该操作。",
					"desc" : "虚拟机存在独立磁盘，不允许进行该操作。",
					"solution" : "请先删除独立磁盘，再重试。"
				},
				"1070117" : {
					"cause" : "虚拟机存在非虚拟化类型磁盘，不允许进行该操作。",
					"desc" : "虚拟机存在非虚拟化类型磁盘，不允许进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070118" : {
					"cause" : "iNIC网卡不允许在线增加。",
					"desc" : "iNIC网卡不允许在线增加。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070119" : {
					"cause" : "iNIC网卡不允许在线删除。",
					"desc" : "iNIC网卡不允许在线删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070120" : {
					"cause" : "该网卡已存在",
					"desc" : "该网卡已存在",
					"solution" : "请刷新页面并重新添加网卡。"
				},
				"1070121" : {
					"cause" : "主机不兼容该操作系统。",
					"desc" : "主机不兼容该操作系统。",
					"solution" : "请选择其它操作系统。"
				},
				"1070122" : {
					"cause" : "虚拟机处于集群资源组管理中的虚拟机组中。",
					"desc" : "虚拟机处于集群资源组管理中的虚拟机组中。",
					"solution" : "请先从虚拟机组中移除虚拟机然后重新操作。"
				},
				"1070123" : {
					"cause" : "没有主机兼容此虚拟机。",
					"desc" : "没有主机兼容此虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070124" : {
					"cause" : "网络ID或者VPC ID与虚拟机的网络不一致。",
					"desc" : "网络ID或者VPC ID与虚拟机的网络不一致。",
					"solution" : "确保输入的网络ID或VPC ID是有效的。"
				},
				"1070126" : {
					"cause" : "虚拟机当前非停止状态，不允许此操作。",
					"desc" : "虚拟机当前非停止状态，不允许此操作。",
					"solution" : "请检查虚拟机状态。"
				},
				"1070128" : {
					"cause" : "非占位虚拟机不允许当前操作。",
					"desc" : "非占位虚拟机不允许当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070129" : {
					"cause" : "系统中不存在满足容灾虚拟机缓存数据同步的主机。",
					"desc" : "系统中不存在满足容灾虚拟机缓存数据同步的主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070130" : {
					"cause" : "启动同步容灾虚拟机缓存数据失败。",
					"desc" : "启动同步容灾虚拟机缓存数据失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070131" : {
					"cause" : "虚拟机容灾相关参数不合法。",
					"desc" : "虚拟机容灾相关参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070132" : {
					"cause" : "创建演练虚拟机相关参数不合法",
					"desc" : "创建演练虚拟机相关参数不合法",
					"solution" : "请联系技术支持工程师。"
				},
				"1070133" : {
					"cause" : "查询同步容灾虚拟机缓存数据进度失败。",
					"desc" : "查询同步容灾虚拟机缓存数据进度失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070134" : {
					"cause" : "启动磁盘容灾失败。",
					"desc" : "启动磁盘容灾失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070135" : {
					"cause" : "停止磁盘容灾失败。",
					"desc" : "停止磁盘容灾失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070136" : {
					"cause" : "文件路径错误或安装文件不存在。",
					"desc" : "文件路径错误或安装文件不存在。",
					"solution" : "请检查路径是否正确或路径下是否存在该安装文件。"
				},
				"1070137" : {
					"cause" : "虚拟机绑定HBA卡失败。",
					"desc" : "虚拟机绑定HBA卡失败。",
					"solution" : "请联系系统管理员。"
				},
				"1070138" : {
					"cause" : "虚拟机解绑定HBA卡失败。",
					"desc" : "虚拟机解绑定HBA卡失败。",
					"solution" : "请联系系统管理员。"
				},
				"1070139" : {
					"cause" : "此HBA卡已绑定到其它虚拟机上。",
					"desc" : "此HBA卡已绑定到其它虚拟机上。",
					"solution" : "请选择其它HBA卡。"
				},
				"1070140" : {
					"cause" : "虚拟机已绑定有HBA卡。",
					"desc" : "虚拟机已绑定有HBA卡。",
					"solution" : "请首先解绑定此HBA卡。"
				},
				"1070141" : {
					"cause" : "虚拟机没有绑定HBA卡。",
					"desc" : "虚拟机没有绑定HBA卡。",
					"solution" : "虚拟机没有绑定HBA卡，因此无法执行解绑定操作。"
				},
				"1070142" : {
					"cause" : "虚拟机没有内存交换磁盘，无法停止虚拟机。",
					"desc" : "虚拟机没有内存交换磁盘，无法停止虚拟机。",
					"solution" : "请开启虚拟机内存交换磁盘开关"
				},
				"1070143" : {
					"cause" : "每CPU插槽的核数不合法,请重新输入。",
					"desc" : "每CPU插槽的核数不合法,请重新输入。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070149" : {
					"cause" : "磁盘UUID不合法.",
					"desc" : "磁盘UUID不合法.",
					"solution" : "请重新输入"
				},
				"1070150" : {
					"cause" : "磁盘参数不合法。",
					"desc" : "磁盘参数不合法。",
					"solution" : "请重新输入."
				},
				"1070151" : {
					"cause" : "虚拟机已经被纳入FusionManager。",
					"desc" : "虚拟机已经被纳入FusionManager。",
					"solution" : "请选择未被纳入FusionManager的虚拟机。"
				},
				"1070152" : {
					"cause" : "不支持纳管应用实例的虚拟机。",
					"desc" : "不支持纳管应用实例的虚拟机。",
					"solution" : "请选择不属于应用实例的虚拟机。"
				},
				"1070155" : {
					"cause" : "指定的数据存储中存在源虚拟机不可访问的数据存储。",
					"desc" : "指定的数据存储中存在源虚拟机不可访问的数据存储。",
					"solution" : "请选择其它存储。"
				},
				"1070160" : {
					"cause" : "非占位虚拟机不允许创建演练虚拟机。",
					"desc" : "非占位虚拟机不允许创建演练虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070161" : {
					"cause" : "虚拟机当前没有可用快照，无法创建演练虚拟机。",
					"desc" : "虚拟机当前没有可用快照，无法创建演练虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070162" : {
					"cause" : "占位虚拟机已经存在一个演练虚拟机。",
					"desc" : "占位虚拟机已经存在一个演练虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070163" : {
					"cause" : "占位虚拟机存在演练虚拟机，当前操作不支持。",
					"desc" : "占位虚拟机存在演练虚拟机，当前操作不支持。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070164" : {
					"cause" : "虚拟机当前无快照，无法恢复。",
					"desc" : "虚拟机当前无快照，无法恢复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070165" : {
					"cause" : "占位虚拟机不存在。",
					"desc" : "占位虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070166" : {
					"cause" : "修改虚拟机为占位虚拟机失败。",
					"desc" : "修改虚拟机为占位虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070167" : {
					"cause" : "只有停止状态的虚拟机才能修改网卡信息。",
					"desc" : "只有停止状态的虚拟机才能修改网卡信息。",
					"solution" : "请检查虚拟机状态。"
				},
				"1070168" : {
					"cause" : "虚拟机存在非虚拟化存储类型卷，不允许导出。",
					"desc" : "虚拟机存在非虚拟化存储类型卷，不允许导出。",
					"solution" : "请联系技术支持工程师 。"
				},
				"1070169" : {
					"cause" : "磁盘格式化失败,停止磁盘容灾失败。",
					"desc" : "磁盘格式化失败,停止磁盘容灾失败。",
					"solution" : "请检查虚拟机状态。"
				},
				"1070170" : {
					"cause" : "虚拟机操作系统不支持在线卸载磁盘。",
					"desc" : "虚拟机操作系统不支持在线卸载磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070177" : {
					"cause" : "虚拟机存在快速复制出的虚拟机，不允该操作，请首先删除快速复制出的虚拟机。",
					"desc" : "虚拟机存在快速复制出的虚拟机，不允该操作，请首先删除快速复制出的虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070200" : {
					"cause" : "无法访问虚拟机配置文件。",
					"desc" : "无法访问虚拟机配置文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070201" : {
					"cause" : "该任务已经取消或者完成。",
					"desc" : "该任务已经取消或者完成。",
					"solution" : "请刷新页面。"
				},
				"1070202" : {
					"cause" : "Vmware远程调用异常。",
					"desc" : "Vmware远程调用异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070203" : {
					"cause" : "Vmware运行时异常。",
					"desc" : "Vmware运行时异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070204" : {
					"cause" : "该任务无法取消。",
					"desc" : "该任务无法取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070205" : {
					"cause" : "可能由迁移过程中虚拟机状态发生变化导致。",
					"desc" : "可能由迁移过程中虚拟机状态发生变化导致。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070206" : {
					"cause" : "主机恢复挂起的虚拟机失败。",
					"desc" : "主机恢复挂起的虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070207" : {
					"cause" : "虚拟机当前状态不允许此操作，请关闭虚拟机后重试。",
					"desc" : "虚拟机当前状态不允许此操作，请关闭虚拟机后重试。",
					"solution" : "请关闭虚拟机后重试。"
				},
				"1070208" : {
					"cause" : "配置iCache操作部分失败。",
					"desc" : "配置iCache操作部分失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070209" : {
					"cause" : "当前存储类型不支持配置iCache。",
					"desc" : "当前存储类型不支持配置iCache。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070210" : {
					"cause" : "操作iCache失败。",
					"desc" : "操作iCache失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070211" : {
					"cause" : "集群下不存在支持创建延迟置零磁盘的存储。",
					"desc" : "集群下不存在支持创建延迟置零磁盘的存储。",
					"solution" : "请选择其他类型。"
				},
				"1070212" : {
					"cause" : "虚拟机正在创建中，不支持该操作。",
					"desc" : "虚拟机正在创建中，不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070213" : {
					"cause" : "分配ip地址失败。",
					"desc" : "分配ip地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070214" : {
					"cause" : "自定义规格不存在，请重新输入。",
					"desc" : "自定义规格不存在，请重新输入。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070215" : {
					"cause" : "导入或导出模板时，主机上报失败。",
					"desc" : "导入或导出模板时，主机上报失败。",
					"solution" : "请检查主机是否正常。"
				},
				"1070216" : {
					"cause" : "主机无法连接共享目录。",
					"desc" : "主机无法连接共享目录。",
					"solution" : "请检查共享目录权限。"
				},
				"1070217" : {
					"cause" : "解析XML文件失败。",
					"desc" : "解析XML文件失败。",
					"solution" : "请检查XML文件格式是否合法。"
				},
				"1070218" : {
					"cause" : "镜像与XML文件不匹配，请检查镜像文件。",
					"desc" : "镜像与XML文件不匹配，请检查镜像文件。",
					"solution" : "请检查镜像文件。"
				},
				"1070219" : {
					"cause" : "“磁盘大小”参数不合法，请重新输入。",
					"desc" : "“磁盘大小”参数不合法，请重新输入。",
					"solution" : "请重新输入。"
				},
				"1070220" : {
					"cause" : "补丁操作时查询卷失败。",
					"desc" : "补丁操作时查询卷失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070221" : {
					"cause" : "虚拟机系统卷不存在。",
					"desc" : "虚拟机系统卷不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070222" : {
					"cause" : "虚拟机系统卷不支持补丁操作。",
					"desc" : "虚拟机系统卷不支持补丁操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070223" : {
					"cause" : "虚拟机补丁安装失败。",
					"desc" : "虚拟机补丁安装失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070224" : {
					"cause" : "虚拟机操作系统类型不支持此操作。",
					"desc" : "虚拟机操作系统类型不支持此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070226" : {
					"cause" : "磁盘的大小超过数据存储支持的最大值。",
					"desc" : "磁盘的大小超过数据存储支持的最大值。",
					"solution" : "请确认数据存储支持的最大值。"
				},
				"1070227" : {
					"cause" : "虚拟机用户取消休眠。",
					"desc" : "虚拟机用户取消休眠。",
					"solution" : "请确认。"
				},
				"1070228" : {
					"cause" : "该虚拟机上未安装VSS插件。",
					"desc" : "该虚拟机上未安装VSS插件。",
					"solution" : "请在虚拟机上安装VSS插件。"
				},
				"1070229" : {
					"cause" : "共享磁盘必须是不受快照影响磁盘。",
					"desc" : "共享磁盘必须是不受快照影响磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070230" : {
					"cause" : "虚拟机的网卡不存在或不可用。",
					"desc" : "虚拟机的网卡不存在或不可用。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070231" : {
					"cause" : "指定的虚拟机当前未运行在指定主机上。",
					"desc" : "指定的虚拟机当前未运行在指定主机上。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070232" : {
					"cause" : "指定虚拟机被xHA保护，该操作无法进行。",
					"desc" : "指定虚拟机被xHA保护，该操作无法进行。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070233" : {
					"cause" : "无其他可用主机以存放虚拟机。",
					"desc" : "无其他可用主机以存放虚拟机。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070234" : {
					"cause" : "找不到可用的启动盘。",
					"desc" : "找不到可用的启动盘。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070235" : {
					"cause" : "磁盘正在创建中，不允许该操作。",
					"desc" : "磁盘正在创建中，不允许该操作。",
					"solution" : "请稍后重试。"
				},
				"1070236" : {
					"cause" : "无法找到包含内核的分区。",
					"desc" : "无法找到包含内核的分区。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070237" : {
					"cause" : "您尝试在一台主机上运行一台虚拟机，该主机没有获得该虚拟机需要的存储的访问权限。",
					"desc" : "您尝试在一台主机上运行一台虚拟机，该主机没有获得该虚拟机需要的存储的访问权限。",
					"solution" : "请联系系统管理员或查看帮助手册%u300"
				},
				"1070238" : {
					"cause" : "快照删除失败。",
					"desc" : "快照删除失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070239" : {
					"cause" : "创建虚拟机失败，当前虚拟化环境不支持静态IP注入的网络。",
					"desc" : "创建虚拟机失败，当前虚拟化环境不支持静态IP注入的网络。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070240" : {
					"cause" : "系统拷贝磁盘失败，请重试。",
					"desc" : "系统拷贝磁盘失败，请重试。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070241" : {
					"cause" : "虚拟机没有内存交换磁盘，内存预留必须和内存大小相等。",
					"desc" : "虚拟机没有内存交换磁盘，内存预留必须和内存大小相等。",
					"solution" : "请开户内存交换磁盘或者检查内存预留值与内存大小是否一致。"
				},
				"1070250" : {
					"cause" : "系统创建存储设备失败。",
					"desc" : "系统创建存储设备失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070251" : {
					"cause" : "系统删除存储设备失败。",
					"desc" : "系统删除存储设备失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070252" : {
					"cause" : "系统发生未知错误。",
					"desc" : "系统发生未知错误。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070253" : {
					"cause" : "修改XML文件名失败。",
					"desc" : "修改XML文件名失败。",
					"solution" : "请检查共享目录的操作权限。"
				},
				"1070254" : {
					"cause" : "系统创建导出目录失败。",
					"desc" : "系统创建导出目录失败。",
					"solution" : "请检查共享目录的操作权限。"
				},
				"1070255" : {
					"cause" : "主机执行命令失败。",
					"desc" : "主机执行命令失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070256" : {
					"cause" : "虚拟机不支持跨可用分区迁移。",
					"desc" : "虚拟机不支持跨可用分区迁移。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1070280" : {
					"cause" : "不允许绑定维护模式的主机。",
					"desc" : "不允许绑定维护模式的主机。",
					"solution" : "请联系系统管理员或者查看帮助文档。"
				},
				"1070281" : {
					"cause" : "由于关机过程中虚拟机重启或内部异常，关机失败，请登录虚拟机查看系统日志。",
					"desc" : "由于关机过程中虚拟机重启或内部异常，关机失败，请登录虚拟机查看系统日志。",
					"solution" : "请登录虚拟机查看系统日志。"
				},
				"1070300" : {
					"cause" : "虚拟机UUID重复。",
					"desc" : "虚拟机UUID重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070388" : {
					"cause" : "vnc密码参数输入错误，vnc密码只能输入英文字母和数字，请输入合法的参数后重试。",
					"desc" : "vnc密码参数输入错误，vnc密码只能输入英文字母和数字，请输入合法的参数后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070389" : {
					"cause" : "不允许再次延时删除回收中虚拟机。",
					"desc" : "不允许再次延时删除回收中虚拟机。",
					"solution" : "请按照指导操作。"
				},
				"1070452" : {
					"cause" : "没有合适的虚拟机模板用于重装操作系统。",
					"desc" : "没有合适的虚拟机模板用于重装操作系统。",
					"solution" : "请选择其它的虚拟机模板。"
				},
				"1070497" : {
					"cause" : "查询内存交换磁盘失败",
					"desc" : "查询内存交换磁盘失败",
					"solution" : "请联系技术支持工程师"
				},
				"1070498" : {
					"cause" : "系统操作超时",
					"desc" : "系统操作超时",
					"solution" : "请联系技术支持工程师"
				},
				"1070499" : {
					"cause" : "系统内部错误，请检查系统运行状态",
					"desc" : "系统内部错误，请检查系统运行状态",
					"solution" : "请联系技术支持工程师"
				},
				"1070500" : {
					"cause" : "系统内部错误。",
					"desc" : "系统内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070501" : {
					"cause" : "注册修复虚拟机任务失败。",
					"desc" : "注册修复虚拟机任务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070502" : {
					"cause" : "停止虚拟机失败。",
					"desc" : "停止虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070503" : {
					"cause" : "用虚拟机模板克隆新的虚拟机失败。",
					"desc" : "用虚拟机模板克隆新的虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070504" : {
					"cause" : "卸载旧虚拟机的磁盘失败。",
					"desc" : "卸载旧虚拟机的磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070505" : {
					"cause" : "卸载新虚拟机的磁盘失败。",
					"desc" : "卸载新虚拟机的磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070506" : {
					"cause" : "将新虚拟机磁盘挂载到旧虚拟机上失败。",
					"desc" : "将新虚拟机磁盘挂载到旧虚拟机上失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070507" : {
					"cause" : "将修复好的虚拟机的磁盘挂载到故障虚拟机上失败。",
					"desc" : "将修复好的虚拟机的磁盘挂载到故障虚拟机上失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070508" : {
					"cause" : "启动虚拟机失败。",
					"desc" : "启动虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070509" : {
					"cause" : "删除新虚拟机失败。",
					"desc" : "删除新虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070511" : {
					"cause" : "虚拟机正在执行其它任务，无法执行此操作，请稍后重试。",
					"desc" : "虚拟机正在执行其它任务，无法执行此操作，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070512" : {
					"cause" : "目标存储容量不足。",
					"desc" : "目标存储容量不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070513" : {
					"cause" : "只支持将磁盘容量调大。",
					"desc" : "只支持将磁盘容量调大。",
					"solution" : "请输入比当前磁盘容量大的数值。"
				},
				"1070514" : {
					"cause" : "集群下不存在支持创建精简配置磁盘的存储。",
					"desc" : "集群下不存在支持创建精简配置磁盘的存储。",
					"solution" : "请重新选择合适的集群进行操作。"
				},
				"1070515" : {
					"cause" : "目的主机故障。",
					"desc" : "目的主机故障。",
					"solution" : "请检查目的主机状态是否正常。"
				},
				"1070516" : {
					"cause" : "无法访问虚拟机文件。",
					"desc" : "无法访问虚拟机文件。",
					"solution" : "请检查虚拟机文件是否存在。"
				},
				"1070517" : {
					"cause" : "目标存储空间不足。",
					"desc" : "目标存储空间不足。",
					"solution" : "请检查目标存储的空间是否足够。"
				},
				"1070518" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请检查参数。"
				},
				"1070519" : {
					"cause" : "目标存储不支持迁移。",
					"desc" : "目标存储不支持迁移。",
					"solution" : "请检查目标数据存储是否支持迁移。"
				},
				"1070520" : {
					"cause" : "无法访问目标数据存储。",
					"desc" : "无法访问目标数据存储。",
					"solution" : "请检查目标存储的状态是否正常。"
				},
				"1070521" : {
					"cause" : "模板虚拟机不支持迁移。",
					"desc" : "模板虚拟机不支持迁移。",
					"solution" : "请确认虚拟机是否为模板虚拟机。"
				},
				"1070522" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070523" : {
					"cause" : "迁移超时。",
					"desc" : "迁移超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070524" : {
					"cause" : "配置错误。",
					"desc" : "配置错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070525" : {
					"cause" : "当前虚拟机正在执行冷迁移，无法执行该操作。",
					"desc" : "当前虚拟机正在执行冷迁移，无法执行该操作。",
					"solution" : "请确认虚拟机状态是否正常。"
				},
				"1070526" : {
					"cause" : "注册卷失败。",
					"desc" : "注册卷失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070527" : {
					"cause" : "虚拟机状态不正确。",
					"desc" : "虚拟机状态不正确。",
					"solution" : "请确认虚拟机状态。"
				},
				"1070528" : {
					"cause" : "虚拟机时钟模式不合法。",
					"desc" : "虚拟机时钟模式不合法。",
					"solution" : "请选择合适的虚拟机时钟模式。"
				},
				"1070529" : {
					"cause" : "虚拟机操作系统不支持打开CPU热插开关。",
					"desc" : "虚拟机操作系统不支持打开CPU热插开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070530" : {
					"cause" : "虚拟机不支持启用CPU热插拔。",
					"desc" : "虚拟机不支持启用CPU热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070531" : {
					"cause" : "CPU热插拔开关非法。",
					"desc" : "CPU热插拔开关非法。",
					"solution" : "请选择合适的CPU热插拔开关。"
				},
				"1070532" : {
					"cause" : "虚拟机操作系统不支持打开内存热插开关。",
					"desc" : "虚拟机操作系统不支持打开内存热插开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070533" : {
					"cause" : "内存热插拔开关非法。",
					"desc" : "内存热插拔开关非法。",
					"solution" : "请选择合适的内存热插拔开关。"
				},
				"1070534" : {
					"cause" : "主机返回失败。",
					"desc" : "主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070535" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070536" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070537" : {
					"cause" : "主机返回失败。",
					"desc" : "主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070538" : {
					"cause" : "在线修改CPU成功，修改内存重启生效。",
					"desc" : "在线修改CPU成功，修改内存重启生效。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070539" : {
					"cause" : "在线修改CPU重启生效，修改内存成功。",
					"desc" : "在线修改CPU重启生效，修改内存成功。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070541" : {
					"cause" : "存在不受快照影响磁盘的虚拟机不能做内存快照。",
					"desc" : "存在不受快照影响磁盘的虚拟机不能做内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070542" : {
					"cause" : "磁盘不存在或不属于虚拟机。",
					"desc" : "磁盘不存在或不属于虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070543" : {
					"cause" : "虚拟机必须为关机或开机状态。",
					"desc" : "虚拟机必须为关机或开机状态。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070544" : {
					"cause" : "运行态且有快照的虚拟机不能迁移磁盘。",
					"desc" : "运行态且有快照的虚拟机不能迁移磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070545" : {
					"cause" : "虚拟机存在共享磁盘，不能进行该操作。",
					"desc" : "虚拟机存在共享磁盘，不能进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070546" : {
					"cause" : "虚拟机是链接克隆虚拟机，不允许该操作。",
					"desc" : "虚拟机是链接克隆虚拟机，不允许该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070547" : {
					"cause" : "准备网络失败。",
					"desc" : "准备网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070548" : {
					"cause" : "准备磁盘失败。",
					"desc" : "准备磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070549" : {
					"cause" : "计算节点准备迁移失败。",
					"desc" : "计算节点准备迁移失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070550" : {
					"cause" : "VMWARE不支持此操作。",
					"desc" : "VMWARE不支持此操作。",
					"solution" : "请在FusionCompute下执行。"
				},
				"1070551" : {
					"cause" : "主机与数据存储未关联。",
					"desc" : "主机与数据存储未关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070552" : {
					"cause" : "无法访问虚拟机磁盘。",
					"desc" : "无法访问虚拟机磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070553" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请刷新后重试。"
				},
				"1070554" : {
					"cause" : "文件模式虚拟机不支持整机迁移。",
					"desc" : "文件模式虚拟机不支持整机迁移。",
					"solution" : "请选择非文件模式的虚拟机迁移。"
				},
				"1070555" : {
					"cause" : "无法在包含 vApp 的群集上禁用 DRS。",
					"desc" : "无法在包含 vApp 的群集上禁用 DRS。",
					"solution" : "请先在虚拟化环境上手动删除集群上的所有vApp。"
				},
				"1070580" : {
					"cause" : "虚拟机磁盘存在多种不同的存储类型，不允许创建快照。",
					"desc" : "虚拟机磁盘存在多种不同的存储类型，不允许创建快照。",
					"solution" : "请查看帮助手册。"
				},
				"1070600" : {
					"cause" : "虚拟机状态错误",
					"desc" : "虚拟机状态错误",
					"solution" : "请联系技术支持工程师"
				},
				"1075000" : {
					"cause" : "虚拟机配置错误。",
					"desc" : "虚拟机配置错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075002" : {
					"cause" : "不支持该操作。",
					"desc" : "不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075005" : {
					"cause" : "虚拟机不支持CPU热插拔。",
					"desc" : "虚拟机不支持CPU热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075006" : {
					"cause" : "虚拟机状态冲突，不允许此操作。",
					"desc" : "虚拟机状态冲突，不允许此操作。",
					"solution" : "请刷新虚拟机的状态。"
				},
				"1075007" : {
					"cause" : "该虚拟机不支持内存热插拔。",
					"desc" : "该虚拟机不支持内存热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075009" : {
					"cause" : "虚拟设备的数量超过最大值。",
					"desc" : "虚拟设备的数量超过最大值。",
					"solution" : "请联系系统管理员。"
				},
				"1075099" : {
					"cause" : "输入内存大小不是4MB的倍数。",
					"desc" : "输入内存大小不是4MB的倍数。",
					"solution" : "请联系系统管理员。"
				},
				"1075013" : {
					"cause" : "主机故障不允许操作。",
					"desc" : "主机故障不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075014" : {
					"cause" : "VMWare产品没有足够的licenses。",
					"desc" : "VMWare产品没有足够的licenses。",
					"solution" : "请联系技术支持工程师，购买VMWare产品的licenses，并注册，方可使用。"
				},
				"1075015" : {
					"cause" : "VMware Tools响应异常",
					"desc" : "VMware Tools响应异常",
					"solution" : "请联系系统管理员"
				},
				"1075016" : {
					"cause" : "创建虚拟机时自定义配置虚拟机失败。",
					"desc" : "创建虚拟机时自定义配置虚拟机失败。",
					"solution" : "请检查虚拟机模板的配置是否正确。"
				},
				"1075017" : {
					"cause" : "资源不足，无法满足配置的HA故障切换级别。",
					"desc" : "资源不足，无法满足配置的HA故障切换级别。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"1075018" : {
					"cause" : "主机的CPU资源不足，无法满足预留。",
					"desc" : "主机的CPU资源不足，无法满足预留。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"1075019" : {
					"cause" : "主机的内存资源不足，无法满足预留。",
					"desc" : "主机的内存资源不足，无法满足预留。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"1075020" : {
					"cause" : "磁盘没有挂在在虚拟机上，不能进行扩容操作。",
					"desc" : "磁盘没有挂在在虚拟机上，不能进行扩容操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075021" : {
					"cause" : "请求中的虚拟机id错误。",
					"desc" : "请求中的虚拟机id错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075022" : {
					"cause" : "目标磁盘大小应大于原磁盘大小。",
					"desc" : "目标磁盘大小应大于原磁盘大小。",
					"solution" : "请修改扩容的大小。"
				},
				"1075023" : {
					"cause" : "该磁盘存在快照或为链接克隆虚拟机的系统磁盘。",
					"desc" : "该磁盘存在快照或为链接克隆虚拟机的系统磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075024" : {
					"cause" : "系统错误。",
					"desc" : "系统错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075025" : {
					"cause" : "磁盘扩容正在进行，单个虚拟机不能同时操作多个磁盘扩容任务。",
					"desc" : "磁盘扩容正在进行，单个虚拟机不能同时操作多个磁盘扩容任务。",
					"solution" : "请稍等。"
				},
				"1075026" : {
					"cause" : "模板虚拟机的磁盘不能进行扩容。",
					"desc" : "模板虚拟机的磁盘不能进行扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075027" : {
					"cause" : "目标磁盘大小应小于最大上限。",
					"desc" : "目标磁盘大小应小于最大上限。",
					"solution" : "请修改扩容的大小。"
				},
				"1075028" : {
					"cause" : "共享磁盘不允许扩容。",
					"desc" : "共享磁盘不允许扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075029" : {
					"cause" : "当前存类型不支持创建非持久化磁盘差分磁盘.",
					"desc" : "当前存类型不支持创建非持久化磁盘差分磁盘.",
					"solution" : "请联系技术支持工程师。"
				},
				"1075030" : {
					"cause" : "非持久化磁盘必须是不受快照影响磁盘。",
					"desc" : "非持久化磁盘必须是不受快照影响磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075031" : {
					"cause" : "磁盘必须是普通磁盘才能设置为非持久化",
					"desc" : "磁盘必须是普通磁盘才能设置为非持久化",
					"solution" : "请联系技术支持工程师。"
				},
				"1075032" : {
					"cause" : "磁盘必须是虚拟化存储才能进行非持久化设置",
					"desc" : "磁盘必须是虚拟化存储才能进行非持久化设置",
					"solution" : "请联系技术支持工程师。"
				},
				"1075033" : {
					"cause" : "BSB无法查询到指定磁盘",
					"desc" : "BSB无法查询到指定磁盘",
					"solution" : "请联系技术支持工程师。"
				},
				"1075034" : {
					"cause" : "磁盘状态或绑定的虚拟机状态冲突，无法修改磁盘持久化属性",
					"desc" : "磁盘状态或绑定的虚拟机状态冲突，无法修改磁盘持久化属性",
					"solution" : "请联系技术支持工程师。"
				},
				"1075035" : {
					"cause" : "当前存储类型不支持创建精简磁盘。",
					"desc" : "当前存储类型不支持创建精简磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075036" : {
					"cause" : "磁盘存在快照，不允许修改不受快照影响参数。",
					"desc" : "磁盘存在快照，不允许修改不受快照影响参数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075037" : {
					"cause" : "该磁盘不支持迁移，如果是共享卷，请和虚拟机解绑定后重新迁移;如果是非持久化磁盘，请关闭虚拟机后重新迁移；如果存在快照，请关闭虚拟机或删除快照后重新迁移；如果磁盘正在进行创建或拷贝等操作时，请在磁盘状态正常，无操作时重新迁移；如果是链接克隆系统磁盘、非虚拟化类型磁盘，则无法支持迁移。",
					"desc" : "该磁盘不支持迁移，如果是共享卷，请和虚拟机解绑定后重新迁移;如果是非持久化磁盘，请关闭虚拟机后重新迁移；如果存在快照，请关闭虚拟机或删除快照后重新迁移；如果磁盘正在进行创建或拷贝等操作时，请在磁盘状态正常，无操作时重新迁移；如果是链接克隆系统磁盘、非虚拟化类型磁盘，则无法支持迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075038" : {
					"cause" : "目的数据存储不是虚拟化存储，不支持迁移。",
					"desc" : "目的数据存储不是虚拟化存储，不支持迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075039" : {
					"cause" : "扩容磁盘失败。",
					"desc" : "扩容磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075040" : {
					"cause" : "磁盘大小不是1024的倍数。",
					"desc" : "磁盘大小不是1024的倍数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075041" : {
					"cause" : "查询磁盘迁移进度超时",
					"desc" : "查询磁盘迁移进度超时",
					"solution" : "请联系技术支持工程师。"
				},
				"1075042" : {
					"cause" : "任务被取消",
					"desc" : "任务被取消",
					"solution" : "请联系技术支持工程师。"
				},
				"1075043" : {
					"cause" : "无主机可同时访问源数据存储和目的数据存储",
					"desc" : "无主机可同时访问源数据存储和目的数据存储",
					"solution" : "请联系技术支持工程师。"
				},
				"1075044" : {
					"cause" : "磁盘正在迁移中。",
					"desc" : "磁盘正在迁移中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075045" : {
					"cause" : "参数refreshflag无效",
					"desc" : "参数refreshflag无效",
					"solution" : "请联系技术支持工程师。"
				},
				"1075046" : {
					"cause" : "调用FusionStorage协议扩容磁盘失败。",
					"desc" : "调用FusionStorage协议扩容磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075047" : {
					"cause" : "非持久化磁盘不能设置为受快照影响磁盘。",
					"desc" : "非持久化磁盘不能设置为受快照影响磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075048" : {
					"cause" : "虚拟机没有网卡，无法设置为网络启动。",
					"desc" : "虚拟机没有网卡，无法设置为网络启动。",
					"solution" : "请选择合适的启动方式。"
				},
				"1075049" : {
					"cause" : "虚拟机没有磁盘，无法设置为硬盘启动。",
					"desc" : "虚拟机没有磁盘，无法设置为硬盘启动。",
					"solution" : "请选择合适的启动方式。"
				},
				"1075050" : {
					"cause" : "虚拟机计算机名不满足规则：主机名长度不超过13、只包含字母、数字和中划线且不能纯数字。",
					"desc" : "虚拟机计算机名不满足规则：主机名长度不超过13、只包含字母、数字和中划线且不能纯数字。",
					"solution" : "请选择合适的计算机名。"
				},
				"1075051" : {
					"cause" : "虚拟机模板没有安装VMware Tools，部署虚拟机自定义配置（计算机名称）失败。",
					"desc" : "虚拟机模板没有安装VMware Tools，部署虚拟机自定义配置（计算机名称）失败。",
					"solution" : "请给虚拟机模板安装最新的Vmware Tools。"
				},
				"1075054" : {
					"cause" : "虚拟机创建或配置失败，设备清单中包含无效的值。",
					"desc" : "虚拟机创建或配置失败，设备清单中包含无效的值。",
					"solution" : "请联系系统管理员。"
				},
				"1075055" : {
					"cause" : "当前虚拟化环境不支持该操作。",
					"desc" : "当前虚拟化环境不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075056" : {
					"cause" : "该存储类型不支持冷迁移。",
					"desc" : "该存储类型不支持冷迁移。",
					"solution" : "请保证虚拟机在运行，如果已经运行，请联系技术工程师。"
				},
				"1075059" : {
					"cause" : "虚拟机的当前配置不支持基本块存储向虚拟化热迁移。",
					"desc" : "虚拟机的当前配置不支持基本块存储向虚拟化热迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075060" : {
					"cause" : "该磁盘存在父节点，不允许此操作。",
					"desc" : "该磁盘存在父节点，不允许此操作。",
					"solution" : "null"
				},
				"1075061" : {
					"cause" : "容灾存储组内存储资源不足，无法执行该操作。",
					"desc" : "容灾存储组内存储资源不足，无法执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075062" : {
					"cause" : "小于2043G的磁盘最大只能扩容到2043G。",
					"desc" : "小于2043G的磁盘最大只能扩容到2043G。",
					"solution" : "请重新输入磁盘大小。"
				},
				"1075063" : {
					"cause" : "磁盘大小大于目标存储最大磁盘规格。",
					"desc" : "磁盘大小大于目标存储最大磁盘规格。",
					"solution" : "请选择其它目标存储。"
				},
				"1075064" : {
					"cause" : "源磁盘的配置模式和目的磁盘的配置模式不一致。",
					"desc" : "源磁盘的配置模式和目的磁盘的配置模式不一致。",
					"solution" : "请选择一致的配置模式。"
				},
				"1075065" : {
					"cause" : "非持久化磁盘不支持在线扩容。",
					"desc" : "非持久化磁盘不支持在线扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075066" : {
					"cause" : "非虚拟化磁盘不支持在线克隆。",
					"desc" : "非虚拟化磁盘不支持在线克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075067" : {
					"cause" : "模板和链接克隆虚拟机所在的数据存储必须是相同的存储类型。",
					"desc" : "模板和链接克隆虚拟机所在的数据存储必须是相同的存储类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075068" : {
					"cause" : "模板和链接克隆虚拟机不支持跨FusionStorage类型的数据存储部署。",
					"desc" : "模板和链接克隆虚拟机不支持跨FusionStorage类型的数据存储部署。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075069" : {
					"cause" : "共享磁盘不支持此操作",
					"desc" : "共享磁盘不支持此操作",
					"solution" : "请联系技术支持工程师。"
				},
				"1075079" : {
					"cause" : "虚拟机限制不支持此操作。",
					"desc" : "虚拟机限制不支持此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075070" : {
					"cause" : "目的主机的CPU配置与当前虚拟机的CPU配置不兼容，迁移虚拟机失败。",
					"desc" : "目的主机的CPU配置与当前虚拟机的CPU配置不兼容，迁移虚拟机失败。",
					"solution" : "请确认主机CPU配置与当前虚拟机的CPU配置兼容。"
				},
				"1075071" : {
					"cause" : "系统正在执行其他任务，请稍后再试。",
					"desc" : "系统正在执行其他任务，请稍后再试。",
					"solution" : "请稍后再试。"
				},
				"1075072" : {
					"cause" : "导出虚拟机过程中，创建源虚拟机快照失败。",
					"desc" : "导出虚拟机过程中，创建源虚拟机快照失败。",
					"solution" : "请联系技术支持工程师"
				},
				"1075073" : {
					"cause" : "虚拟机存在独立磁盘，不允许导出。",
					"desc" : "虚拟机存在独立磁盘，不允许导出。",
					"solution" : "请删除独立磁盘后重试"
				},
				"1075080" : {
					"cause" : "虚拟机有备份策略或备份集，不允许转为模板。",
					"desc" : "虚拟机有备份策略或备份集，不允许转为模板。",
					"solution" : "请先删除备份策略或备份集。"
				},
				"1075081" : {
					"cause" : "在线克隆虚拟机只支持克隆单台。",
					"desc" : "在线克隆虚拟机只支持克隆单台。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075082" : {
					"cause" : "当前状态不支持克隆虚拟机。",
					"desc" : "当前状态不支持克隆虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080000" : {
					"cause" : "子网的输入信息不符合要求。",
					"desc" : "子网的输入信息不符合要求。",
					"solution" : "请按照提示输入符合要求的子网信息。"
				},
				"1080001" : {
					"cause" : "子网或掩码前缀格式不合法。",
					"desc" : "子网或掩码前缀格式不合法。",
					"solution" : "请填写正确的子网IP/掩码。"
				},
				"1080002" : {
					"cause" : "保留IP地址段结束地址小于起始地址。",
					"desc" : "保留IP地址段结束地址小于起始地址。",
					"solution" : "请确保保留IP段的结束地址不小于起始地址。"
				},
				"1080003" : {
					"cause" : "保留IP段的起始IP地址或结束IP地址不在子网内。",
					"desc" : "保留IP段的起始IP地址或结束IP地址不在子网内。",
					"solution" : "请输入正确的保留IP段信息。"
				},
				"1080004" : {
					"cause" : "网关不在子网内。",
					"desc" : "网关不在子网内。",
					"solution" : "请输入正确的网关信息。"
				},
				"1080005" : {
					"cause" : "子网不存在或者当前子网已被删除。",
					"desc" : "子网不存在或者当前子网已被删除。",
					"solution" : "请刷新页面确认子网是否已经被删除。"
				},
				"1080006" : {
					"cause" : "不能指定已被使用的VLAN ID。",
					"desc" : "不能指定已被使用的VLAN ID。",
					"solution" : "请分配没有被使用的VLAN ID。"
				},
				"1080007" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080008" : {
					"cause" : "当前子网名称已经存在。",
					"desc" : "当前子网名称已经存在。",
					"solution" : "请填写唯一的子网名称。"
				},
				"1080009" : {
					"cause" : "资源集群所选子网中{0}已经不存在。",
					"desc" : "资源集群所选子网中{0}已经不存在。",
					"solution" : "请选择存在的子网。"
				},
				"1080010" : {
					"cause" : "资源集群所选子网中{0}已经被其它资源集群使用。",
					"desc" : "资源集群所选子网中{0}已经被其它资源集群使用。",
					"solution" : "请选择没有被资源集群使用的子网。"
				},
				"1080011" : {
					"cause" : "当前子网已经被外部网络或组织内部网络使用，删除失败。",
					"desc" : "当前子网已经被外部网络或组织内部网络使用，删除失败。",
					"solution" : "请查看子网是否被某个资源集群使用。"
				},
				"1080012" : {
					"cause" : "当前子网已经被网络使用，修改失败。",
					"desc" : "当前子网已经被网络使用，修改失败。",
					"solution" : "请查看子网是否被某个网络使用。"
				},
				"1080013" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080014" : {
					"cause" : "DHCP服务IP地址不合法。",
					"desc" : "DHCP服务IP地址不合法。",
					"solution" : "请输入正确的DHCP信息。"
				},
				"1080015" : {
					"cause" : "汇聚交换机不存在。",
					"desc" : "汇聚交换机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080016" : {
					"cause" : "VLAN ID已经被使用。",
					"desc" : "VLAN ID已经被使用。",
					"solution" : "请输入正确的VLAN ID。"
				},
				"1080017" : {
					"cause" : "子网所在网段已经被使用。",
					"desc" : "子网所在网段已经被使用。",
					"solution" : "请输入正确的子网网段。"
				},
				"1080018" : {
					"cause" : "删除子网失败，此子网正在创建或删除中。",
					"desc" : "删除子网失败，此子网正在创建或删除中。",
					"solution" : "请稍候再试。"
				},
				"1080019" : {
					"cause" : "主DNS服务器IP地址不合法。",
					"desc" : "主DNS服务器IP地址不合法。",
					"solution" : "请输入正确的DNS信息。"
				},
				"1080020" : {
					"cause" : "备DNS服务器IP地址不合法。",
					"desc" : "备DNS服务器IP地址不合法。",
					"solution" : "请输入正确的DNS信息。"
				},
				"1080021" : {
					"cause" : "主WINS服务器IP地址不合法。",
					"desc" : "主WINS服务器IP地址不合法。",
					"solution" : "请输入正确的WINS信息。"
				},
				"1080022" : {
					"cause" : "备WINS服务器IP地址不合法。",
					"desc" : "备WINS服务器IP地址不合法。",
					"solution" : "请输入正确的WINS信息。"
				},
				"1080023" : {
					"cause" : "修改管理子网中，没有足够IP地址分配。",
					"desc" : "修改管理子网中，没有足够IP地址分配。",
					"solution" : "请输入更大的子网网段。"
				},
				"1080024" : {
					"cause" : "数据库中没有管理子网信息。",
					"desc" : "数据库中没有管理子网信息。",
					"solution" : "请确认系统中的管理子网信息是否存在。"
				},
				"1080025" : {
					"cause" : "创建子网失败。",
					"desc" : "创建子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080026" : {
					"cause" : "管理子网分配IP地址失败。",
					"desc" : "管理子网分配IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080027" : {
					"cause" : "更新管理子网信息失败。",
					"desc" : "更新管理子网信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080028" : {
					"cause" : "更新CNA信息失败。",
					"desc" : "更新CNA信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080029" : {
					"cause" : "修改IP地址操作的参数检查失败。",
					"desc" : "修改IP地址操作的参数检查失败。",
					"solution" : "请检查输入参数是否正确。"
				},
				"1080030" : {
					"cause" : "修改IP地址操作的IP地址参数无效。",
					"desc" : "修改IP地址操作的IP地址参数无效。",
					"solution" : "请检查输入IP参数是否有效。"
				},
				"1080031" : {
					"cause" : "修改IP地址操作的掩码参数无效，不能大于24位。",
					"desc" : "修改IP地址操作的掩码参数无效，不能大于24位。",
					"solution" : "请检查输入掩码参数是否有效或者是否大于24位。"
				},
				"1080032" : {
					"cause" : "修改IP地址操作的网关参数无效。",
					"desc" : "修改IP地址操作的网关参数无效。",
					"solution" : "请检查输入网关参数是否有效。"
				},
				"1080033" : {
					"cause" : "修改IP地址操作的VLAN参数无效。",
					"desc" : "修改IP地址操作的VLAN参数无效。",
					"solution" : "请检查输入VLAN参数是否有效。"
				},
				"1080034" : {
					"cause" : "指定的IP地址与网关IP地址冲突。",
					"desc" : "指定的IP地址与网关IP地址冲突。",
					"solution" : "请确保指定的IP地址与网关IP地址是否在同一网段。"
				},
				"1080035" : {
					"cause" : "保留IP地址操作失败。",
					"desc" : "保留IP地址操作失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080036" : {
					"cause" : "获取CNA信息失败。",
					"desc" : "获取CNA信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080037" : {
					"cause" : "获取云管理IP失败。",
					"desc" : "获取云管理IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080038" : {
					"cause" : "更新管理IP地址记录失败。",
					"desc" : "更新管理IP地址记录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080039" : {
					"cause" : "查询子网信息失败。",
					"desc" : "查询子网信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080040" : {
					"cause" : "管理子网信息已经存在。",
					"desc" : "管理子网信息已经存在。",
					"solution" : "请检查输入的子网信息是否与目前的一致。"
				},
				"1080041" : {
					"cause" : "删除子网失败。",
					"desc" : "删除子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080042" : {
					"cause" : "子网被端口组使用，修改失败。",
					"desc" : "子网被端口组使用，修改失败。",
					"solution" : "请先删除端口组再试。"
				},
				"1080043" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080044" : {
					"cause" : "输入的保留IP段地址范围有重叠。",
					"desc" : "输入的保留IP段地址范围有重叠。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080045" : {
					"cause" : "保留IP总个数超过128个。",
					"desc" : "保留IP总个数超过128个。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080046" : {
					"cause" : "保留IP段的起始IP地址或结束IP地址为空。",
					"desc" : "保留IP段的起始IP地址或结束IP地址为空。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080047" : {
					"cause" : "子网IP和掩码的与运算结果必须和子网IP相等。",
					"desc" : "子网IP和掩码的与运算结果必须和子网IP相等。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080048" : {
					"cause" : "该子网已经被集群使用，不允许删除。",
					"desc" : "该子网已经被集群使用，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080049" : {
					"cause" : "子网已经分配了4096个IP，超出了系统的能力。",
					"desc" : "子网已经分配了4096个IP，超出了系统的能力。",
					"solution" : "请重新选择网络。"
				},
				"1080050" : {
					"cause" : "子网中没有可用的IP。",
					"desc" : "子网中没有可用的IP。",
					"solution" : "请重新选择网络。"
				},
				"1080051" : {
					"cause" : "子网中可用IP数量不足。",
					"desc" : "子网中可用IP数量不足。",
					"solution" : "请重新选择网络。"
				},
				"1080052" : {
					"cause" : "当前网络的子网与VPC下其他网络的子网重叠。",
					"desc" : "当前网络的子网与VPC下其他网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080053" : {
					"cause" : "子网内没有可用IP，预留IP已经将子网占满。",
					"desc" : "子网内没有可用IP，预留IP已经将子网占满。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080054" : {
					"cause" : "当前网络的子网与VPN下远端用户网络的子网重叠。",
					"desc" : "当前网络的子网与VPN下远端用户网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080055" : {
					"cause" : "当前网络的子网与VSA网络的子网重叠。",
					"desc" : "当前网络的子网与VSA网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080056" : {
					"cause" : "子网所在网段已经被外部网络或者DHCP服务器使用。",
					"desc" : "子网所在网段已经被外部网络或者DHCP服务器使用。",
					"solution" : "null"
				},
				"1080057" : {
					"cause" : "子网所在网段已经被物理管理网络使用。",
					"desc" : "子网所在网段已经被物理管理网络使用。",
					"solution" : "null"
				},
				"1080058" : {
					"cause" : "子网所在网段已经被业务安装网络使用。",
					"desc" : "子网所在网段已经被业务安装网络使用。",
					"solution" : "null"
				},
				"1080059" : {
					"cause" : "保留IP段中包含已经分配出去的IP。",
					"desc" : "保留IP段中包含已经分配出去的IP。",
					"solution" : "null"
				},
				"1080060" : {
					"cause" : "该子网已经被集群使用，不允许修改。",
					"desc" : "该子网已经被集群使用，不允许修改。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080061" : {
					"cause" : "私有IP已被分配。",
					"desc" : "私有IP已被分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080062" : {
					"cause" : "指定的私有IP不在子网中。",
					"desc" : "指定的私有IP不在子网中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080063" : {
					"cause" : "网络中没有需要修复的IP。",
					"desc" : "网络中没有需要修复的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080064" : {
					"cause" : "指定的私有IP已被系统保留或在保留的IP段内。",
					"desc" : "指定的私有IP已被系统保留或在保留的IP段内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080065" : {
					"cause" : "指定的IP不在子网的可用IP段中。",
					"desc" : "指定的IP不在子网的可用IP段中。",
					"solution" : "请重新输入IP。"
				},
				"1080066" : {
					"cause" : "子网的可用IP段未包括已分配的IP。",
					"desc" : "子网的可用IP段未包括已分配的IP。",
					"solution" : "请重新输入可用IP段。"
				},
				"1080067" : {
					"cause" : "只有静态注入或内部dhcp类型的子网才能指定IP。",
					"desc" : "只有静态注入或内部dhcp类型的子网才能指定IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080068" : {
					"cause" : "指定IP预占时，指定的私有IP在保留IP段中。",
					"desc" : "指定IP预占时，指定的私有IP在保留IP段中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080070" : {
					"cause" : "子网中最多只能有65536个可用IP。",
					"desc" : "子网中最多只能有65536个可用IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080071" : {
					"cause" : "非法的ipv6子网(子网或掩码非法；子网与掩码不匹配；非法子网：::/128，::1/128；系统保留子网：FF00::/8，FE80::/10)。",
					"desc" : "非法的ipv6子网(子网或掩码非法；子网与掩码不匹配；非法子网：::/128，::1/128；系统保留子网：FF00::/8，FE80::/10)。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080101" : {
					"cause" : "可用IP段中包含了FM的浮动IP或管理IP。",
					"desc" : "可用IP段中包含了FM的浮动IP或管理IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1082000" : {
					"cause" : "可用管理IP地址段范围有重叠",
					"desc" : "可用管理IP地址段范围有重叠",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082001" : {
					"cause" : "可用管理IP地址段和网关冲突",
					"desc" : "可用管理IP地址段和网关冲突",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"10820010" : {
					"cause" : "选择的多个网络冲突。",
					"desc" : "选择的多个网络冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1082002" : {
					"cause" : "可用管理IP地址段内IP超过最大个数10000",
					"desc" : "可用管理IP地址段内IP超过最大个数10000",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082003" : {
					"cause" : "校验IP不在可用管理IP地址段内",
					"desc" : "校验IP不在可用管理IP地址段内",
					"solution" : "请确认GM IP在可用管理IP地址段内。"
				},
				"1082004" : {
					"cause" : "更新可用管理IP地址段信息异常",
					"desc" : "更新可用管理IP地址段信息异常",
					"solution" : "请联系技术支持工程师。"
				},
				"1082005" : {
					"cause" : "可用管理IP地址段内IP数量不够",
					"desc" : "可用管理IP地址段内IP数量不够",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082006" : {
					"cause" : "可用管理IP地址段不在管理子网内",
					"desc" : "可用管理IP地址段不在管理子网内",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082007" : {
					"cause" : "可用管理IP地址段与VDI预留IP冲突",
					"desc" : "可用管理IP地址段与VDI预留IP冲突",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082008" : {
					"cause" : "网关与VDI预留IP冲突",
					"desc" : "网关与VDI预留IP冲突",
					"solution" : "请确认网关不在VDI预留IP内。"
				},
				"1083001" : {
					"cause" : "子网掩码格式错误。",
					"desc" : "子网掩码格式错误。",
					"solution" : "请输入正确的子网掩码格式，例如255.255.255.0。"
				},
				"1083002" : {
					"cause" : "网关不在网段中。",
					"desc" : "网关不在网段中。",
					"solution" : "网关不在网段中。"
				},
				"1083003" : {
					"cause" : "起始结束IP地址不在网段中。",
					"desc" : "起始结束IP地址不在网段中。",
					"solution" : "起始结束IP不在网段中。"
				},
				"1083004" : {
					"cause" : "起始IP地址大于结束IP地址。",
					"desc" : "起始IP地址大于结束IP地址。",
					"solution" : "起始IP必须小于等于结束IP。"
				},
				"1083006" : {
					"cause" : "设置GMN外部IP失败。",
					"desc" : "设置GMN外部IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1083007" : {
					"cause" : "未配置组网模式，不能修改管理子网。",
					"desc" : "未配置组网模式，不能修改管理子网。",
					"solution" : "修改管理子网前，请先配置组网模式。"
				},
				"1083008" : {
					"cause" : "修改子网失败，子网已经加入集群，请重新打开页面。",
					"desc" : "修改子网失败，子网已经加入集群，请重新打开页面。",
					"solution" : "请重新打开子网修改页面，再修改子网。"
				},
				"1089998" : {
					"cause" : "当前系统存在子网或VLAN池或路由，或配置了汇聚交换机IP地址，不允许修改组网模式。",
					"desc" : "当前系统存在子网或VLAN池或路由，或配置了汇聚交换机IP地址，不允许修改组网模式。",
					"solution" : "请与系统管理员确认是否要执行该操作，如果确认要执行，请将相关子网，VLAN池，汇聚交换机IP，路由删除后，再修改组网模式。"
				},
				"1089999" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090000" : {
					"cause" : "VLAN池输入信息不符合要求。",
					"desc" : "VLAN池输入信息不符合要求。",
					"solution" : "请按照提示输入正确的VLAN池信息。"
				},
				"1090001" : {
					"cause" : "VLAN池不存在。",
					"desc" : "VLAN池不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090002" : {
					"cause" : "VLAN池的VLAN范围与存在的VLAN池有交叉或者包含。",
					"desc" : "VLAN池的VLAN范围与存在的VLAN池有交叉或者包含。",
					"solution" : "请填写正确的VLAN范围。"
				},
				"1090003" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090004" : {
					"cause" : "当前VLAN池名称已经存在。",
					"desc" : "当前VLAN池名称已经存在。",
					"solution" : "请填写唯一的VLAN池名称。"
				},
				"1090005" : {
					"cause" : "资源集群所选VLAN池中{0}已经不存在。",
					"desc" : "资源集群所选VLAN池中{0}已经不存在。",
					"solution" : "请选择存在的VLAN池。"
				},
				"1090006" : {
					"cause" : "资源集群所选VLAN池中{0}已经被其它资源集群使用。",
					"desc" : "资源集群所选VLAN池中{0}已经被其它资源集群使用。",
					"solution" : "请选择没有被资源集群使用的VLAN池。"
				},
				"1090007" : {
					"cause" : "当前VLAN池已经被外部网络或组织内部网络使用，删除失败。",
					"desc" : "当前VLAN池已经被外部网络或组织内部网络使用，删除失败。",
					"solution" : "请查看VLAN池是否被某个网络资源使用。"
				},
				"1090008" : {
					"cause" : "当前VLAN池已经被资源集群使用，修改失败。",
					"desc" : "当前VLAN池已经被资源集群使用，修改失败。",
					"solution" : "请查看VLAN池是否被某个资源集群使用。"
				},
				"1090009" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090010" : {
					"cause" : "当前VLAN池中的VLAN ID已经被使用。",
					"desc" : "当前VLAN池中的VLAN ID已经被使用。",
					"solution" : "请输入没有使用的VLAN ID。"
				},
				"1090011" : {
					"cause" : "当前VLAN池正被使用，删除失败。",
					"desc" : "当前VLAN池正被使用，删除失败。",
					"solution" : "请在VLAN池没有被使用的时候再删除。"
				},
				"1090012" : {
					"cause" : "DVS关联了VLAN POOL。",
					"desc" : "DVS关联了VLAN POOL。",
					"solution" : "请解关联DVS与VLAN POOL"
				},
				"1090013" : {
					"cause" : "VLAN池已经被端口组使用，修改失败。",
					"desc" : "VLAN池已经被端口组使用，修改失败。",
					"solution" : "请先删除端口组再试。"
				},
				"1090014" : {
					"cause" : "VLAN池不能关联同一集群下的多个DVS。",
					"desc" : "VLAN池不能关联同一集群下的多个DVS。",
					"solution" : "请检查参数。"
				},
				"1090015" : {
					"cause" : "基于该关联关系，已经存在网络，不允许解关联.",
					"desc" : "基于该关联关系，已经存在网络，不允许解关联.",
					"solution" : "请检查参数。"
				},
				"1090016" : {
					"cause" : "该DVS所属的资源集群已被VDC使用，无法解关联。",
					"desc" : "该DVS所属的资源集群已被VDC使用，无法解关联。",
					"solution" : "请联系系统管理员。"
				},
				"1090017" : {
					"cause" : "集群中的DVS关联的VLAN池没有包含当前VDC所使用的所有VLAN，无法扩容。",
					"desc" : "集群中的DVS关联的VLAN池没有包含当前VDC所使用的所有VLAN，无法扩容。",
					"solution" : "请联系系统管理员。"
				},
				"1090018" : {
					"cause" : "VLAN不可用。",
					"desc" : "VLAN不可用。",
					"solution" : "请联系系统管理员。"
				},
				"1090019" : {
					"cause" : "配置了VTEP IP的DVS才能关联VXLAN池。请在虚拟化环境上为DVS配置了VTEP IP后，更新虚拟化环境重试。",
					"desc" : "配置了VTEP IP的DVS才能关联VXLAN池。请在虚拟化环境上为DVS配置了VTEP IP后，更新虚拟化环境重试。",
					"solution" : "请在FusionCompute为DVS配置了VTEP IP后，更新虚拟化环境后重试。"
				},
				"1090020" : {
					"cause" : "VLAN池已经被使用。",
					"desc" : "VLAN池已经被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1090050" : {
					"cause" : "VLAN不在VLAN池内。",
					"desc" : "VLAN不在VLAN池内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090053" : {
					"cause" : "VLAN池的VLAN段包含VSA网络已经使用的VLAN ID。",
					"desc" : "VLAN池的VLAN段包含VSA网络已经使用的VLAN ID。",
					"solution" : "请重新输入VLAN段信息。"
				},
				"1090054" : {
					"cause" : "VLAN池{0}的VLAN段中包含被使用的VLAN{1}。",
					"desc" : "VLAN池{0}的VLAN段中包含被使用的VLAN{1}。",
					"solution" : "请修改VLAN段后重试。"
				},
				"1090055" : {
					"cause" : "用途是管理的VLAN池不支持VXLAN。",
					"desc" : "用途是管理的VLAN池不支持VXLAN。",
					"solution" : "请重新选择VLAN。"
				},
				"1090056" : {
					"cause" : "没有可用的设备对接VLAN",
					"desc" : "没有可用的设备对接VLAN",
					"solution" : "请联系系统管理员"
				},
				"1090057" : {
					"cause" : "用途是管理的VLAN池不支持绑定DVS。",
					"desc" : "用途是管理的VLAN池不支持绑定DVS。",
					"solution" : "请不要绑定。"
				},
				"1090058" : {
					"cause" : "vlan不存在。",
					"desc" : "vlan不存在。",
					"solution" : "请重新选择VLAN。"
				},
				"1100001" : {
					"cause" : "通讯异常，无法连接。",
					"desc" : "通讯异常，无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1100002" : {
					"cause" : "用户名或密码错误，登录失败。",
					"desc" : "用户名或密码错误，登录失败。",
					"solution" : "请到系统配置当中填写正确的用户和密码。"
				},
				"1100003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1100004" : {
					"cause" : "FusionStorage存储已经达到最大数目。",
					"desc" : "FusionStorage存储已经达到最大数目。",
					"solution" : "请联系技术支持工程师。"
				},
				"1100005" : {
					"cause" : "原始密码输入错误3次。",
					"desc" : "原始密码输入错误3次。",
					"solution" : "请等待5分钟后操作。"
				},
				"1100006" : {
					"cause" : "用户不存在。",
					"desc" : "用户不存在。",
					"solution" : "请使用存在的用户操作。"
				},
				"1100007" : {
					"cause" : "本端修改uhm用户密码失败。",
					"desc" : "本端修改uhm用户密码失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1100008" : {
					"cause" : "进程重启失败。",
					"desc" : "进程重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1100009" : {
					"cause" : "FusionStorage管理IP重复。",
					"desc" : "FusionStorage管理IP重复。",
					"solution" : "请修改管理IP后重试。"
				},
				"1100012" : {
					"cause" : "FusionStorage域名重复。",
					"desc" : "FusionStorage域名重复。",
					"solution" : "请修改域名后重试。"
				},
				"1100010" : {
					"cause" : "FusionStorage正在与FusionManager通讯。",
					"desc" : "FusionStorage正在与FusionManager通讯。",
					"solution" : "请在集群操作完成后重试。"
				},
				"1100011" : {
					"cause" : "FusionStorage主IP重复了",
					"desc" : "FusionStorage主IP重复了",
					"solution" : "FusionStorage主IP不能重复"
				},
				"1100100" : {
					"cause" : "可能缺少Vmware SDK工具包。",
					"desc" : "可能缺少Vmware SDK工具包。",
					"solution" : "请确保安装Vmware SDK工具包再重试。如果确定已经安装Vmware SDK工具包，请联系技术支持工程师。"
				},
				"1100101" : {
					"cause" : "Vmware不支持该功能。",
					"desc" : "Vmware不支持该功能。",
					"solution" : "请联系系统管理员。"
				},
				"1110001" : {
					"cause" : "租户ID为空。",
					"desc" : "租户ID为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1110002" : {
					"cause" : "该租户已经分配租户VDC。",
					"desc" : "该租户已经分配租户VDC。",
					"solution" : "不能重复给同一个租户分配VDC。"
				},
				"1110003" : {
					"cause" : "租户VDC规格不满足需求:CPU，内存，存储最大值不在合法范围内。",
					"desc" : "租户VDC规格不满足需求:CPU，内存，存储最大值不在合法范围内。",
					"solution" : "请按照提示填写正确的VDC规格信息。"
				},
				"1110004" : {
					"cause" : "租户VDC规格中选择的资源集群列表为空。",
					"desc" : "租户VDC规格中选择的资源集群列表为空。",
					"solution" : "请按照提示填写正确的VDC规格信息。"
				},
				"1110005" : {
					"cause" : "租户VDC规格中选择的资源集群不存在。",
					"desc" : "租户VDC规格中选择的资源集群不存在。",
					"solution" : "请按照提示填写正确的VDC规格信息。"
				},
				"1110006" : {
					"cause" : "组织VDC不存在。",
					"desc" : "组织VDC不存在。",
					"solution" : "该组织VDC不存在，请刷新页面核实。"
				},
				"1110007" : {
					"cause" : "组织vdc存在关联的网络资源。",
					"desc" : "组织vdc存在关联的网络资源。",
					"solution" : "如需删除该组织VDC，请保证不存在资源与其关联。"
				},
				"1110008" : {
					"cause" : "租户VDC修改的VCPU上限少于已用容量。",
					"desc" : "租户VDC修改的VCPU上限少于已用容量。",
					"solution" : "租户VDC修改的VCPU上限必须要大于已用容量。"
				},
				"1110009" : {
					"cause" : "租户VDC修改的内存上限少于已用容量。",
					"desc" : "租户VDC修改的内存上限少于已用容量。",
					"solution" : "租户VDC修改的内存上限必须要大于已用容量。"
				},
				"1110010" : {
					"cause" : "租户VDC修改的存储上限少于已用容量。",
					"desc" : "租户VDC修改的存储上限少于已用容量。",
					"solution" : "租户VDC修改的存储上限必须要大于已用容量。"
				},
				"1110011" : {
					"cause" : "租户VDC规格为null。",
					"desc" : "租户VDC规格为null。",
					"solution" : "请联系技术支持工程师。"
				},
				"1110012" : {
					"cause" : "租户VDC ID列表为null。",
					"desc" : "租户VDC ID列表为null。",
					"solution" : "请联系技术支持工程师。"
				},
				"1110013" : {
					"cause" : "组织VDC名称重复。",
					"desc" : "组织VDC名称重复。",
					"solution" : "请输入新的组织VDC名称。"
				},
				"1110014" : {
					"cause" : "系统中组织VDC数量达到上限。",
					"desc" : "系统中组织VDC数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1110015" : {
					"cause" : "组织的组织VDC数量达到上限。",
					"desc" : "组织的组织VDC数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1110016" : {
					"cause" : "组织VDC下存在应用，不能删除。",
					"desc" : "组织VDC下存在应用，不能删除。",
					"solution" : "如需删除该组织VDC，请保证组织VDC下不存在应用。"
				},
				"1110017" : {
					"cause" : "组织VDC不存在。",
					"desc" : "组织VDC不存在。",
					"solution" : "该组织VDC已经被删除，请刷新页面核实。"
				},
				"1110018" : {
					"cause" : "可用分区不存在",
					"desc" : "可用分区不存在",
					"solution" : "该可用分区已经被删除，请与系统管理员核实。"
				},
				"1110019" : {
					"cause" : "组织VDC修改的内存上限少于已用容量。",
					"desc" : "组织VDC修改的内存上限少于已用容量。",
					"solution" : "组织VDC修改的内存上限必须大于已用容量。"
				},
				"1110020" : {
					"cause" : "组织VDC修改的存储上限少于已用容量。",
					"desc" : "组织VDC修改的存储上限少于已用容量。",
					"solution" : "组织VDC修改的存储上限必须大于已用容量。"
				},
				"1110021" : {
					"cause" : "组织VDC下存在VPC。",
					"desc" : "组织VDC下存在VPC。",
					"solution" : "如需删除该VDC，请保证VDC不存在VPC与其关联。"
				},
				"1110022" : {
					"cause" : "组织VDC下存在虚拟机，不能删除。",
					"desc" : "组织VDC下存在虚拟机，不能删除。",
					"solution" : "如需删除该组织VDC，请保证组织VDC下不存在虚拟机。"
				},
				"1110023" : {
					"cause" : "组织VDC关联的集群下有虚拟机，不允许解关联该集群。",
					"desc" : "组织VDC关联的集群下有虚拟机，不允许解关联该集群。",
					"solution" : "请先删除该集群下的虚拟机。"
				},
				"1110024" : {
					"cause" : "组织VDC关联的集群下有应用，不允许解关联该集群。",
					"desc" : "组织VDC关联的集群下有应用，不允许解关联该集群。",
					"solution" : "请先删除集群下的应用。"
				},
				"1110026" : {
					"cause" : "组织VDC修改的公网IP上限少于已用容量。",
					"desc" : "组织VDC修改的公网IP上限少于已用容量。",
					"solution" : "组织VDC修改的公网IP上限必须大于已用容量。"
				},
				"1110027" : {
					"cause" : "组织VDC修改的硬件虚拟防火墙上限少于已用容量。",
					"desc" : "组织VDC修改的硬件虚拟防火墙上限少于已用容量。",
					"solution" : "组织VDC修改的硬件虚拟防火墙上限必须大于已用容量。"
				},
				"1110028" : {
					"cause" : "组织VDC修改的软件虚拟防火墙上限少于已用容量。",
					"desc" : "组织VDC修改的软件虚拟防火墙上限少于已用容量。",
					"solution" : "组织VDC修改的软件虚拟防火墙上限必须大于已用容量。"
				},
				"1111112" : {
					"cause" : "vCenter处理失败。请登录vCenter查看详细的错误原因和处理建议。",
					"desc" : "vCenter处理失败。请登录vCenter查看详细的错误原因和处理建议。",
					"solution" : "请登录vCenter查看详细的错误原因和处理建议。"
				},
				"1111113" : {
					"cause" : "XenServer处理失败。",
					"desc" : "XenServer处理失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"1120001" : {
					"cause" : "修改时区失败。",
					"desc" : "修改时区失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120002" : {
					"cause" : "修改NTP配置失败。",
					"desc" : "修改NTP配置失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120003" : {
					"cause" : "BMC IP地址池更新失败。",
					"desc" : "BMC IP地址池更新失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120004" : {
					"cause" : "BMC IP地址池查询失败。",
					"desc" : "BMC IP地址池查询失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120005" : {
					"cause" : "BMC IP地址池的VLAN号和已有的子网VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和已有的子网VLAN号冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120006" : {
					"cause" : "BMC IP地址池的VLAN号和已有的VLAN池VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和已有的VLAN池VLAN号冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120007" : {
					"cause" : "没有配置组网模式，无法创建BMC IP地址池。",
					"desc" : "没有配置组网模式，无法创建BMC IP地址池。",
					"solution" : "请配置组网模式。"
				},
				"1120008" : {
					"cause" : "没有配置组网模式，无法修改BMC IP地址池。",
					"desc" : "没有配置组网模式，无法修改BMC IP地址池。",
					"solution" : "请配置组网模式。"
				},
				"1120009" : {
					"cause" : "BMC IP地址池的VLAN号和汇聚交换机上行端口的VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和汇聚交换机上行端口的VLAN号冲突。",
					"solution" : "请选择正确的VLAN号。"
				},
				"1120010" : {
					"cause" : "BMC IP地址池的IP和汇聚交换机上行端口的IP冲突。",
					"desc" : "BMC IP地址池的IP和汇聚交换机上行端口的IP冲突。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1120011" : {
					"cause" : "BMC IP地址池的IP和系统子网的IP冲突。",
					"desc" : "BMC IP地址池的IP和系统子网的IP冲突。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1120012" : {
					"cause" : "BMC IP地址池操作异常。",
					"desc" : "BMC IP地址池操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120013" : {
					"cause" : "BMC IP地址池创建失败。",
					"desc" : "BMC IP地址池创建失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1130000" : {
					"cause" : "没有可以分配的VLAN。",
					"desc" : "没有可以分配的VLAN。",
					"solution" : "请联系技术支持工程师。"
				},
				"1130001" : {
					"cause" : "修改配置文件失败。",
					"desc" : "修改配置文件失败。",
					"solution" : "修改配置文件失败。"
				},
				"1130002" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请确认桌面服务器是否正常。"
				},
				"1130010" : {
					"cause" : "增加的vlan中存在被其他vdc使用的vlan。",
					"desc" : "增加的vlan中存在被其他vdc使用的vlan。",
					"solution" : "请修改增加的vlan后重试。"
				},
				"1130011" : {
					"cause" : "增加的vlan中存在被外部网络使用的vlan。",
					"desc" : "增加的vlan中存在被外部网络使用的vlan。",
					"solution" : "请修改增加的vlan后重试。"
				},
				"1130012" : {
					"cause" : "减少的vlan中存在被使用的vlan。",
					"desc" : "减少的vlan中存在被使用的vlan。",
					"solution" : "请修改减少的vlan后重试。"
				},
				"1140001" : {
					"cause" : "数据中心名称重复。",
					"desc" : "数据中心名称重复。",
					"solution" : "请重新指定新的数据中心名称。"
				},
				"1140002" : {
					"cause" : "数据中心数量达到最大值。",
					"desc" : "数据中心数量达到最大值。",
					"solution" : "请确认数据中心数量是否超过了10个，如果超过了， 请删除无用的数据中心后， 再尝试创建。"
				},
				"1140003" : {
					"cause" : "指定的数据中心不存在。",
					"desc" : "指定的数据中心不存在。",
					"solution" : "请刷新页面， 确认该数据中心是否存在。"
				},
				"1140004" : {
					"cause" : "数据中心下有资源， 不允许删除。",
					"desc" : "数据中心下有资源， 不允许删除。",
					"solution" : "请将数据中心下的虚拟化环境删除后， 再尝试删除数据中心。"
				},
				"1140011" : {
					"cause" : "虚拟化环境名称重复。",
					"desc" : "虚拟化环境名称重复。",
					"solution" : "请重新输入。"
				},
				"1140012" : {
					"cause" : "超过虚拟化环境数量的最大限制。",
					"desc" : "超过虚拟化环境数量的最大限制。",
					"solution" : "请联系管理员。"
				},
				"1140013" : {
					"cause" : "虚拟化环境不存在。",
					"desc" : "虚拟化环境不存在。",
					"solution" : "请刷新页面， 确认该虚拟化环境是否存在。"
				},
				"1140014" : {
					"cause" : "虚拟化环境下存在集群已关联到资源分区，不允许删除。",
					"desc" : "虚拟化环境下存在集群已关联到资源分区，不允许删除。",
					"solution" : "请先将该虚拟化环境下的集群与资源分区解关联。"
				},
				"1140015" : {
					"cause" : "虚拟化环境中连接器信息重复。",
					"desc" : "虚拟化环境中连接器信息重复。",
					"solution" : "请重新输入。"
				},
				"1140016" : {
					"cause" : "系统内部通讯异常。",
					"desc" : "系统内部通讯异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1140017" : {
					"cause" : "虚拟化环境正在更新中，请稍后重试。",
					"desc" : "虚拟化环境正在更新中，请稍后重试。",
					"solution" : "请刷新页面， 确认该虚拟化环境是否在更新中的状态。"
				},
				"1140018" : {
					"cause" : "虚拟化环境端口和IP重复。",
					"desc" : "虚拟化环境端口和IP重复。",
					"solution" : "请重新输入。"
				},
				"1140019" : {
					"cause" : "DVS和VLAN池关联。",
					"desc" : "DVS和VLAN池关联。",
					"solution" : "请解关联DVS与VLAN池。"
				},
				"1140020" : {
					"cause" : "DVS和VSA网络关联。",
					"desc" : "DVS和VSA网络关联。",
					"solution" : "请解关联DVS与VSA网络。"
				},
				"1140021" : {
					"cause" : "资源分区名称已存在。",
					"desc" : "资源分区名称已存在。",
					"solution" : "请输入未存在的资源分区名称。"
				},
				"1140022" : {
					"cause" : "资源分区数量达到最大值。",
					"desc" : "资源分区数量达到最大值。",
					"solution" : "请联系技术支持工程师。"
				},
				"1140023" : {
					"cause" : "资源分区不存在。",
					"desc" : "资源分区不存在。",
					"solution" : "请确认资源分区是否存在。"
				},
				"1140024" : {
					"cause" : "资源分区下有资源，不允许删除。",
					"desc" : "资源分区下有资源，不允许删除。",
					"solution" : "请先删除资源分区下的ResourcePool资源。"
				},
				"1140025" : {
					"cause" : "资源分区下有服务器存在，不允许删除。",
					"desc" : "资源分区下有服务器存在，不允许删除。",
					"solution" : "请先删除资源分区下的服务器。"
				},
				"1140026" : {
					"cause" : "资源分区下有存储设备存在，不允许删除。",
					"desc" : "资源分区下有存储设备存在，不允许删除。",
					"solution" : "请先删除资源分区下的存储设备。"
				},
				"1140027" : {
					"cause" : "资源分区下有交换机存在，不允许删除。",
					"desc" : "资源分区下有交换机存在，不允许删除。",
					"solution" : "请先删除资源分区下的交换机。"
				},
				"1140028" : {
					"cause" : "VDC更新中，不允许此操作。",
					"desc" : "VDC更新中，不允许此操作。",
					"solution" : "请稍后重试。"
				},
				"1140029" : {
					"cause" : "选择的组织不存在。",
					"desc" : "选择的组织不存在。",
					"solution" : "组织已被删除，请核实创VDC选择的组织是否还存在。"
				},
				"1140040" : {
					"cause" : "同一个DVS的集群必须在一个资源分区内。",
					"desc" : "同一个DVS的集群必须在一个资源分区内。",
					"solution" : "请在正确的资源分区下操作，或选择正确的集群。"
				},
				"1140041" : {
					"cause" : "虚拟化环境已存在。",
					"desc" : "虚拟化环境已存在。",
					"solution" : "请修改虚拟化环境参数。"
				},
				"1140042" : {
					"cause" : "集群下存在组织VDC，不允许去关联。",
					"desc" : "集群下存在组织VDC，不允许去关联。",
					"solution" : "请先删除该集群下的组织VDC。"
				},
				"1140043" : {
					"cause" : "虚拟化环境下存在组织VDC，不能被删除。",
					"desc" : "虚拟化环境下存在组织VDC，不能被删除。",
					"solution" : "请先删除该虚拟化环境下的组织VDC。"
				},
				"1140044" : {
					"cause" : "存在与该集群相关的外部网络或组织网络，不允许解除关联。",
					"desc" : "存在与该集群相关的外部网络或组织网络，不允许解除关联。",
					"solution" : "请先删除与该集群相关的外部网络和组织网络。"
				},
				"1140045" : {
					"cause" : "该集群已经关联到资源分区。",
					"desc" : "该集群已经关联到资源分区。",
					"solution" : "TODO:Not Translated yet."
				},
				"1140046" : {
					"cause" : "集群不存在关联",
					"desc" : "集群不存在关联",
					"solution" : "请检查该集群的关联关系"
				},
				"1140047" : {
					"cause" : "当前DVS下不包含任何VSS。",
					"desc" : "当前DVS下不包含任何VSS。",
					"solution" : "请重新添加VSS。"
				},
				"1140048" : {
					"cause" : "虚拟化环境不存在已经关联的集群。",
					"desc" : "虚拟化环境不存在已经关联的集群。",
					"solution" : "请先关联集群。"
				},
				"1140049" : {
					"cause" : "存储不存在或者存储未关联，请确保存储已经存在或者已经更新虚拟化环境资源。",
					"desc" : "存储不存在或者存储未关联，请确保存储已经存在或者已经更新虚拟化环境资源。",
					"solution" : "请确保存储已经存在或者已经更新虚拟化环境资源。"
				},
				"1140050" : {
					"cause" : "待更新的源MAC地址不存在。",
					"desc" : "待更新的源MAC地址不存在。",
					"solution" : "请更新已存在的MAC地址。"
				},
				"1140051" : {
					"cause" : "MAC地址已存在。",
					"desc" : "MAC地址已存在。",
					"solution" : "请输入不存在MAC地址。"
				},
				"1140052" : {
					"cause" : "MAC地址在MAC地址段的范围之内。",
					"desc" : "MAC地址在MAC地址段的范围之内。",
					"solution" : "请输入不在MAC地址段中范围的MAC地址。"
				},
				"1140053" : {
					"cause" : "MAC地址段最多允许配置5个。",
					"desc" : "MAC地址段最多允许配置5个。",
					"solution" : "已达最大值，无法继续配置。"
				},
				"1140054" : {
					"cause" : "MAC地址段范围与其它MAC地址段交叉。",
					"desc" : "MAC地址段范围与其它MAC地址段交叉。",
					"solution" : "请输入与现有MAC地址段范围不交叉的MAC地址段。"
				},
				"1140055" : {
					"cause" : "不允许使用保留Mac地址段（28:6E:D4:88:B2:A1~28:6E:D4:88:C6:28）。",
					"desc" : "不允许使用保留Mac地址段（28:6E:D4:88:B2:A1~28:6E:D4:88:C6:28）。",
					"solution" : "请输入在保留MAC地址段之外的MAC地址段。"
				},
				"1140056" : {
					"cause" : "Mac地址段起始地址大于结束地址。",
					"desc" : "Mac地址段起始地址大于结束地址。",
					"solution" : "请输入起始地址小于结束地址的MAC地址段。"
				},
				"1140057" : {
					"cause" : "Mac地址段不允许为空。",
					"desc" : "Mac地址段不允许为空。",
					"solution" : "请至少输入一个MAC地址段。"
				},
				"1140058" : {
					"cause" : "MAC地址段包含了独立MAC地址。",
					"desc" : "MAC地址段包含了独立MAC地址。",
					"solution" : "请输入不包含独立MAC地址的MAC地址段。"
				},
				"1140059" : {
					"cause" : "MAC地址段重复。",
					"desc" : "MAC地址段重复。",
					"solution" : "请输入不存在MAC地址段。"
				},
				"1140060" : {
					"cause" : "MAC地址无效。",
					"desc" : "MAC地址无效。",
					"solution" : "请尝试其他有效地址。"
				},
				"1140061" : {
					"cause" : "该MAC地址段包含组播/广播地址，不允许使用。",
					"desc" : "该MAC地址段包含组播/广播地址，不允许使用。",
					"solution" : "请更换MAC地址段。"
				},
				"1140062" : {
					"cause" : "不允许使用组播/广播地址。",
					"desc" : "不允许使用组播/广播地址。",
					"solution" : "请更换MAC地址。"
				},
				"1140063" : {
					"cause" : "资源分区下有机框存在，不允许删除。",
					"desc" : "资源分区下有机框存在，不允许删除。",
					"solution" : "请先删除资源分区下的机框。"
				},
				"1140064" : {
					"cause" : "虚拟化环境下存在虚拟机，不能被删除。",
					"desc" : "虚拟化环境下存在虚拟机，不能被删除。",
					"solution" : "请先删除该虚拟化环境下的虚拟机。"
				},
				"1140065" : {
					"cause" : "资源分区下有容灾存储组，不允许删除。",
					"desc" : "资源分区下有容灾存储组，不允许删除。",
					"solution" : "请先删除资源分区下的容灾存储组。"
				},
				"1140066" : {
					"cause" : "存在与该集群关联的存储已经添加到容灾存储组，不允许解除关联。",
					"desc" : "存在与该集群关联的存储已经添加到容灾存储组，不允许解除关联。",
					"solution" : "请先从容灾存储组中移除与该集群关联的存储。"
				},
				"1140067" : {
					"cause" : "集群下DVS已关联Vlan池，不允许解除关联。",
					"desc" : "集群下DVS已关联Vlan池，不允许解除关联。",
					"solution" : "请先删除集群下DVS与Vlan池的关联关系。"
				},
				"1140068" : {
					"cause" : "集群已关联VSA网络或VTEP网络，不允许解除关联。",
					"desc" : "集群已关联VSA网络或VTEP网络，不允许解除关联。",
					"solution" : "请先删除集群下的VSA网络或VTEP网络。"
				},
				"1140069" : {
					"cause" : "资源分区下存在路由器，不允许修改物理组网模式。",
					"desc" : "资源分区下存在路由器，不允许修改物理组网模式。",
					"solution" : "请先从资源分区下删除路由器。"
				},
				"1140071" : {
					"cause" : "资源分区下有防火墙存在，不允许删除。",
					"desc" : "资源分区下有防火墙存在，不允许删除。",
					"solution" : "请先删除资源分区下的防火墙。"
				},
				"1140072" : {
					"cause" : "资源分区下有负载均衡存在，不允许删除。",
					"desc" : "资源分区下有负载均衡存在，不允许删除。",
					"solution" : "请先删除资源分区下的负载均衡。"
				},
				"1140073" : {
					"cause" : "资源分区下已存在一个汇聚交换机。",
					"desc" : "资源分区下已存在一个汇聚交换机。",
					"solution" : "请添加其他类型交换机，或删除已存在汇聚交换机后重试。"
				},
				"1150001" : {
					"cause" : "该存储类型是FusionStorage存储，不允许该操作。",
					"desc" : "该存储类型是FusionStorage存储，不允许该操作。",
					"solution" : "请尝试关闭虚拟机再操作，或者联系系统管理员。"
				},
				"1150002" : {
					"cause" : "FusionStorage系统异常。",
					"desc" : "FusionStorage系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150003" : {
					"cause" : "系统与FusionStorage无法连接。",
					"desc" : "系统与FusionStorage无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150004" : {
					"cause" : "与FusionStorage通信异常。",
					"desc" : "与FusionStorage通信异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150005" : {
					"cause" : "FusionStorage系统正在rebalance，请稍等。",
					"desc" : "FusionStorage系统正在rebalance，请稍等。",
					"solution" : "FusionStorage系统正在rebalance，请稍等。"
				},
				"1150006" : {
					"cause" : "存在{0}个主机扩容失败。{1}",
					"desc" : "存在{0}个主机扩容失败。{1}",
					"solution" : "请根据具体主机失败原因处理。"
				},
				"1150007" : {
					"cause" : "当前正在操作的存储池不存在。",
					"desc" : "当前正在操作的存储池不存在。",
					"solution" : "请刷新页面。"
				},
				"1150008" : {
					"cause" : "IP重复。",
					"desc" : "IP重复。",
					"solution" : "请检查IP是否重复。"
				},
				"1150009" : {
					"cause" : "IP格式非法。",
					"desc" : "IP格式非法。",
					"solution" : "请检查IP格式是否正确。"
				},
				"1150010" : {
					"cause" : "待扩容主机已经存在存储中。",
					"desc" : "待扩容主机已经存在存储中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150011" : {
					"cause" : "该主机已经存在FusionStorage进程，该主机可能正在被使用或存在旧数据。",
					"desc" : "该主机已经存在FusionStorage进程，该主机可能正在被使用或存在旧数据。",
					"solution" : "1、确认是否需要扩容该主机；2、执行清理节点的操作。"
				},
				"1150012" : {
					"cause" : "主机上的磁盘数量不足。",
					"desc" : "主机上的磁盘数量不足。",
					"solution" : "请保持主机上的磁盘数量与系统配置一致。"
				},
				"1150013" : {
					"cause" : "主机间磁盘容量不一致。",
					"desc" : "主机间磁盘容量不一致。",
					"solution" : "请保持主机磁盘容量一致。"
				},
				"1150014" : {
					"cause" : "主机间磁盘类型不一致。",
					"desc" : "主机间磁盘类型不一致。",
					"solution" : "请保持主机磁盘类型一致。"
				},
				"1150015" : {
					"cause" : "业务磁盘总数不在存储池磁盘总数规格范围内。",
					"desc" : "业务磁盘总数不在存储池磁盘总数规格范围内。",
					"solution" : "请确认业务磁盘总数在存储池磁盘总数规格范围内。"
				},
				"1150016" : {
					"cause" : "该主机可能：1、内存不达标；2、磁盘有旧数据；3、磁盘故障。",
					"desc" : "该主机可能：1、内存不达标；2、磁盘有旧数据；3、磁盘故障。",
					"solution" : "1、增加内存以达到FusionStorage系统要求；2、格式化该主机磁盘；3、更换故障硬盘。"
				},
				"1150017" : {
					"cause" : "FusionStorage系统繁忙。",
					"desc" : "FusionStorage系统繁忙。",
					"solution" : "请稍等。"
				},
				"1150018" : {
					"cause" : "FusionStorage与主机通信异常。",
					"desc" : "FusionStorage与主机通信异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150019" : {
					"cause" : "FusionStorage存在非法主机。",
					"desc" : "FusionStorage存在非法主机。",
					"solution" : "请排查非法主机后，再进行操作。"
				},
				"1150020" : {
					"cause" : "当前操作的存储存在正在减容主机，请稍后重试。",
					"desc" : "当前操作的存储存在正在减容主机，请稍后重试。",
					"solution" : "请稍后再操作。"
				},
				"1150021" : {
					"cause" : "磁盘数超过系统最大存储业务磁盘数。",
					"desc" : "磁盘数超过系统最大存储业务磁盘数。",
					"solution" : "请按照要求配置磁盘数。"
				},
				"1150022" : {
					"cause" : "存储中不存在指定的管理IP。",
					"desc" : "存储中不存在指定的管理IP。",
					"solution" : "请填写正确的管理IP。"
				},
				"1150023" : {
					"cause" : "没有FusionStorage客户端。",
					"desc" : "没有FusionStorage客户端。",
					"solution" : "请添加FusionStorage客户端。"
				},
				"1150024" : {
					"cause" : "减容的主机列表中包含多个已经加入到存储池中的主机，请逐一减容存储池中的主机。",
					"desc" : "减容的主机列表中包含多个已经加入到存储池中的主机，请逐一减容存储池中的主机。",
					"solution" : "请逐一减容存储池中的主机。"
				},
				"1150025" : {
					"cause" : "集群中包含多个已经加入到存储池中的主机，请逐一减容存储池中的主机后再删除。",
					"desc" : "集群中包含多个已经加入到存储池中的主机，请逐一减容存储池中的主机后再删除。",
					"solution" : "请逐一减容存储池中的主机后再删除。"
				},
				"1150026" : {
					"cause" : "扩容后的磁盘数目小于或等于当前系统单个节点磁盘数量。",
					"desc" : "扩容后的磁盘数目小于或等于当前系统单个节点磁盘数量。",
					"solution" : "请输入大于当前系统单节点磁盘数量的值。"
				},
				"1150027" : {
					"cause" : "FusionStorage安全级别的拓扑结构为异构",
					"desc" : "FusionStorage安全级别的拓扑结构为异构",
					"solution" : "请联系技术支持工程师。"
				},
				"1150028" : {
					"cause" : "存在分区正在进行数据均衡操作，请稍等。",
					"desc" : "存在分区正在进行数据均衡操作，请稍等。",
					"solution" : "请稍后再操作。"
				},
				"1150029" : {
					"cause" : "存储池名称错误。",
					"desc" : "存储池名称错误。",
					"solution" : "名称中只能包含字母、数字和下划线，且长度为1~64位。"
				},
				"1150030" : {
					"cause" : "系统中不存在FusionStorage存储池，不允许进行该操作。",
					"desc" : "系统中不存在FusionStorage存储池，不允许进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150031" : {
					"cause" : "管理集群使用的数据盘不存在或不可用。",
					"desc" : "管理集群使用的数据盘不存在或不可用。",
					"solution" : "请检查管理集群数据盘状态。"
				},
				"1150032" : {
					"cause" : "主机间的磁盘槽位号不一致",
					"desc" : "主机间的磁盘槽位号不一致",
					"solution" : "请将主机上的磁盘槽位号调整成一致。"
				},
				"1150033" : {
					"cause" : "VBS客户端已经存在。",
					"desc" : "VBS客户端已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150034" : {
					"cause" : "存在{0}个主机创建客户端失败。{1}",
					"desc" : "存在{0}个主机创建客户端失败。{1}",
					"solution" : "请根据具体主机失败原因处理。"
				},
				"1150035" : {
					"cause" : "存在{0}个主机清理节点失败。{1}",
					"desc" : "存在{0}个主机清理节点失败。{1}",
					"solution" : "请根据具体主机失败原因处理。"
				},
				"1150036" : {
					"cause" : "请求超时。",
					"desc" : "请求超时。",
					"solution" : "请先检查网络是否连通。"
				},
				"1150037" : {
					"cause" : "设置FusionStorage系统参数失败",
					"desc" : "设置FusionStorage系统参数失败",
					"solution" : "请联系技术支持工程师。"
				},
				"1150038" : {
					"cause" : "添加失败，请检查IP、端口、用户名和密码是否正确，网络是否连通。",
					"desc" : "添加失败，请检查IP、端口、用户名和密码是否正确，网络是否连通。",
					"solution" : "请检查Ip、用户名和密码是否正确，网络是否连通。"
				},
				"1150039" : {
					"cause" : "nvdimm故障，请更换。",
					"desc" : "nvdimm故障，请更换。",
					"solution" : "nvdimm故障，请更换。"
				},
				"1150040" : {
					"cause" : "获得结点的存储IP失败。",
					"desc" : "获得结点的存储IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150041" : {
					"cause" : "系统中已存在FusionStorage管理集群。",
					"desc" : "系统中已存在FusionStorage管理集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150043" : {
					"cause" : "管理集群使用的数据盘大小不一致。",
					"desc" : "管理集群使用的数据盘大小不一致。",
					"solution" : "请检查管理集群数据盘大小。"
				},
				"1150044" : {
					"cause" : "管理集群使用的数据盘类型不一致。",
					"desc" : "管理集群使用的数据盘类型不一致。",
					"solution" : "请检查管理集群数据盘类型。"
				},
				"1150045" : {
					"cause" : "管理集群使用的数据盘类型不一致。",
					"desc" : "管理集群使用的数据盘类型不一致。",
					"solution" : "请检查管理集群数据盘类型。"
				},
				"1150046" : {
					"cause" : "系统中存在FusionStorage存储池，不允许进行该操作。",
					"desc" : "系统中存在FusionStorage存储池，不允许进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150048" : {
					"cause" : "系统中存在非华为认证盘。",
					"desc" : "系统中存在非华为认证盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150050" : {
					"cause" : "删除客户端失败。",
					"desc" : "删除客户端失败。",
					"solution" : "请刷新页面。"
				},
				"1150051" : {
					"cause" : "存在正在减容的服务器。",
					"desc" : "存在正在减容的服务器。",
					"solution" : "请等待减容完成后再操作。"
				},
				"1150054" : {
					"cause" : "该网络设备已经不存在。",
					"desc" : "该网络设备已经不存在。",
					"solution" : "请刷新页面查看网络设备列表。"
				},
				"1150055" : {
					"cause" : "FusionStorageManager与主机无法连接。",
					"desc" : "FusionStorageManager与主机无法连接。",
					"solution" : "请检查FusionStorageManager与主机是否通信正常。"
				},
				"1150056" : {
					"cause" : "FusionStorageManager建立任务失败。",
					"desc" : "FusionStorageManager建立任务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150057" : {
					"cause" : "无可用FusionStorage逻辑设备。",
					"desc" : "无可用FusionStorage逻辑设备。",
					"solution" : "请检查FusionStorage逻辑设备是否可用。"
				},
				"1150058" : {
					"cause" : "安装文件不存在。",
					"desc" : "安装文件不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150059" : {
					"cause" : "没有可用的FusionStorage 逻辑设备，不能修改管理IP。",
					"desc" : "没有可用的FusionStorage 逻辑设备，不能修改管理IP。",
					"solution" : "请检查FusionStorage逻辑设备是否可用。"
				},
				"1150060" : {
					"cause" : "槽号范围内没有刀片。",
					"desc" : "槽号范围内没有刀片。",
					"solution" : "请调整槽号范围或接入刀片。"
				},
				"1150061" : {
					"cause" : "槽号范围内存在DB刀片。",
					"desc" : "槽号范围内存在DB刀片。",
					"solution" : "请重新调整槽号范围。"
				},
				"1150062" : {
					"cause" : "槽号范围最小为3。",
					"desc" : "槽号范围最小为3。",
					"solution" : "请重新调整槽号范围。"
				},
				"1150064" : {
					"cause" : "该逻辑设备存在存储集群，不允许删除。",
					"desc" : "该逻辑设备存在存储集群，不允许删除。",
					"solution" : "请先清理存储集群。"
				},
				"1150065" : {
					"cause" : "槽号范围存在交叉或包含。",
					"desc" : "槽号范围存在交叉或包含。",
					"solution" : "请填写正确的槽号范围。"
				},
				"1150067" : {
					"cause" : "安装dswareAgent失败。",
					"desc" : "安装dswareAgent失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150068" : {
					"cause" : "查询dsware存储状态失败。",
					"desc" : "查询dsware存储状态失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162003" : {
					"cause" : "系统没有可分配资源。",
					"desc" : "系统没有可分配资源。",
					"solution" : "请联系系统管理员。"
				},
				"1162004" : {
					"cause" : "网络不存在。",
					"desc" : "网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162005" : {
					"cause" : "该网络已被虚拟机使用。",
					"desc" : "该网络已被虚拟机使用。",
					"solution" : "请删除使用该网络的资源后重试。"
				},
				"1162011" : {
					"cause" : "当前网络已被ACL使用。",
					"desc" : "当前网络已被ACL使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162012" : {
					"cause" : "当前网络已开启SNAT。",
					"desc" : "当前网络已开启SNAT。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162013" : {
					"cause" : "当前网络已被VPN连接使用。",
					"desc" : "当前网络已被VPN连接使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162014" : {
					"cause" : "当前网络已被直连网络使用。",
					"desc" : "当前网络已被直连网络使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162015" : {
					"cause" : "外部网络已经被软件防火墙使用，无法删除。",
					"desc" : "外部网络已经被软件防火墙使用，无法删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162016" : {
					"cause" : "当前网络有手动申请IP，不能修改或删除。",
					"desc" : "当前网络有手动申请IP，不能修改或删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162017" : {
					"cause" : "当前网络已被VLB使用。",
					"desc" : "当前网络已被VLB使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162018" : {
					"cause" : "虚拟机被VLB关联，不允许此操作。",
					"desc" : "虚拟机被VLB关联，不允许此操作。",
					"solution" : "请将虚拟机从VLB中解关联后再试。"
				},
				"1162019" : {
					"cause" : "当前网络被DNAT使用。",
					"desc" : "当前网络被DNAT使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162020" : {
					"cause" : "当前网络被EIP使用。",
					"desc" : "当前网络被EIP使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162117" : {
					"cause" : "网络当前状态不支持该操作，请稍后重试。",
					"desc" : "网络当前状态不支持该操作，请稍后重试。",
					"solution" : "请稍候重试。"
				},
				"1162118" : {
					"cause" : "修改后的可用IP个数小于该网络已分配的IP个数。",
					"desc" : "修改后的可用IP个数小于该网络已分配的IP个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162200" : {
					"cause" : "VPC规格个数超过系统最大值。",
					"desc" : "VPC规格个数超过系统最大值。",
					"solution" : "null"
				},
				"1162201" : {
					"cause" : "VPC规格名称重复。",
					"desc" : "VPC规格名称重复。",
					"solution" : "null"
				},
				"1162202" : {
					"cause" : "VPC规格不存在。",
					"desc" : "VPC规格不存在。",
					"solution" : "null"
				},
				"1162203" : {
					"cause" : "VPC规格已被使用。",
					"desc" : "VPC规格已被使用。",
					"solution" : "null"
				},
				"1162500" : {
					"cause" : "外部网络不存在。",
					"desc" : "外部网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162501" : {
					"cause" : "网络超出规格。",
					"desc" : "网络超出规格。",
					"solution" : "请联系系统管理员。"
				},
				"1162502" : {
					"cause" : "子网不可用或被删除。",
					"desc" : "子网不可用或被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162503" : {
					"cause" : "VLAN已被使用或VLAN对应的VLAN池不可用。",
					"desc" : "VLAN已被使用或VLAN对应的VLAN池不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162504" : {
					"cause" : "子网不可用或被删除。",
					"desc" : "子网不可用或被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162505" : {
					"cause" : "VLAN已被使用或VLAN所在的VLAN池被删除。",
					"desc" : "VLAN已被使用或VLAN所在的VLAN池被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162506" : {
					"cause" : "DVS上创建了外部网络或者组织网络。",
					"desc" : "DVS上创建了外部网络或者组织网络。",
					"solution" : "请删除DVS上所有的网络。"
				},
				"1162507" : {
					"cause" : "VSS所在的DVS创建了外部网络或组织网络。",
					"desc" : "VSS所在的DVS创建了外部网络或组织网络。",
					"solution" : "请删除VSS上所有的网络。"
				},
				"1162508" : {
					"cause" : "VPC不存在。",
					"desc" : "VPC不存在。",
					"solution" : "null"
				},
				"1162509" : {
					"cause" : "创建虚拟防火墙上的子网失败。",
					"desc" : "创建虚拟防火墙上的子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162510" : {
					"cause" : "创建组织网络失败。",
					"desc" : "创建组织网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162511" : {
					"cause" : "创建DHCP子网失败。",
					"desc" : "创建DHCP子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162512" : {
					"cause" : "没有可用的外部网络。",
					"desc" : "没有可用的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162513" : {
					"cause" : "删除虚拟防火墙上的子网失败。",
					"desc" : "删除虚拟防火墙上的子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162514" : {
					"cause" : "网络不存在。",
					"desc" : "网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162515" : {
					"cause" : "该外部网络已经被当前VPC使用。",
					"desc" : "该外部网络已经被当前VPC使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162516" : {
					"cause" : "该网络不属于当前VPC。",
					"desc" : "该网络不属于当前VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162517" : {
					"cause" : "网络数量已经到达VPC的最大规格。",
					"desc" : "网络数量已经到达VPC的最大规格。",
					"solution" : "请联系系统管理员。"
				},
				"1162519" : {
					"cause" : "该网络不是完成状态，无法使用。",
					"desc" : "该网络不是完成状态，无法使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162520" : {
					"cause" : "该VLAN已被VLAN类型的网络使用，无法用于创建子网类型的网络。",
					"desc" : "该VLAN已被VLAN类型的网络使用，无法用于创建子网类型的网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162521" : {
					"cause" : "该vlan已被其他网络的子网使用。",
					"desc" : "该vlan已被其他网络的子网使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162522" : {
					"cause" : "该网络不是直连网络。",
					"desc" : "该网络不是直连网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162523" : {
					"cause" : "没有可用的VSA管理网络。",
					"desc" : "没有可用的VSA管理网络。",
					"solution" : "请联系系统管理员。"
				},
				"1162524" : {
					"cause" : "一个VPC下最多能创建200个DHCP的网络。",
					"desc" : "一个VPC下最多能创建200个DHCP的网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162525" : {
					"cause" : "没有可用的VTEP网络。",
					"desc" : "没有可用的VTEP网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162526" : {
					"cause" : "删除dhcpsubnet失败",
					"desc" : "删除dhcpsubnet失败",
					"solution" : "请联系技术支持工程师。"
				},
				"1162527" : {
					"cause" : "子网和公网IP池中的IP段冲突。",
					"desc" : "子网和公网IP池中的IP段冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162528" : {
					"cause" : "该手动分配IP不存在。",
					"desc" : "该手动分配IP不存在。",
					"solution" : "请刷新列表后重试。"
				},
				"1162529" : {
					"cause" : "外部网络的DHCP服务器不存在。",
					"desc" : "外部网络的DHCP服务器不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1162530" : {
					"cause" : "DHCP服务器的状态不允许操作。",
					"desc" : "DHCP服务器的状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1162531" : {
					"cause" : "一个申请了软件防火墙的VPC最多可创建200个路由网络。",
					"desc" : "一个申请了软件防火墙的VPC最多可创建200个路由网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162532" : {
					"cause" : "一个资源分区下最多创建199个内部DHCP的外部网络。",
					"desc" : "一个资源分区下最多创建199个内部DHCP的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162545" : {
					"cause" : "外部网络的VLAN和选择的DVS没有关联。",
					"desc" : "外部网络的VLAN和选择的DVS没有关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163001" : {
					"cause" : "虚拟防火墙当前状态不允许操作。",
					"desc" : "虚拟防火墙当前状态不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163002" : {
					"cause" : "设置虚拟防火墙属性失败。",
					"desc" : "设置虚拟防火墙属性失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163003" : {
					"cause" : "虚拟防火墙与VPC关联关系不正常。",
					"desc" : "虚拟防火墙与VPC关联关系不正常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163004" : {
					"cause" : "资源分区下没有可用的防火墙。",
					"desc" : "资源分区下没有可用的防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163005" : {
					"cause" : "虚拟防火墙不在当前资源分区下。",
					"desc" : "虚拟防火墙不在当前资源分区下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163006" : {
					"cause" : "当前虚拟防火墙已与VPC关联。",
					"desc" : "当前虚拟防火墙已与VPC关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163007" : {
					"cause" : "VPC已经关联了虚拟防火墙。",
					"desc" : "VPC已经关联了虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163008" : {
					"cause" : "VPC下存在网络，不能释放虚拟防火墙。",
					"desc" : "VPC下存在网络，不能释放虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163009" : {
					"cause" : "虚拟防火墙未关联VPC，不需要释放。",
					"desc" : "虚拟防火墙未关联VPC，不需要释放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163010" : {
					"cause" : "防火墙资源ID不存在。",
					"desc" : "防火墙资源ID不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163012" : {
					"cause" : "预留的防火墙已经被使用，请修配置文件。",
					"desc" : "预留的防火墙已经被使用，请修配置文件。",
					"solution" : "请修改配置文件。"
				},
				"1163013" : {
					"cause" : "VPC下存在弹性IP，无法释放虚拟防火墙。",
					"desc" : "VPC下存在弹性IP，无法释放虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163014" : {
					"cause" : "该VPC已经创建了授权，不能再次授权。",
					"desc" : "该VPC已经创建了授权，不能再次授权。",
					"solution" : "请联系技术支持工程师。"
				},
				"1164200" : {
					"cause" : "资源分区没有可用的公网IP。",
					"desc" : "资源分区没有可用的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1166001" : {
					"cause" : "当前ACL不存在。",
					"desc" : "当前ACL不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1166003" : {
					"cause" : "防火墙已冻结，不能创建ACL。",
					"desc" : "防火墙已冻结，不能创建ACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166004" : {
					"cause" : "虚拟防火墙没有就绪，不能删除ACL。",
					"desc" : "虚拟防火墙没有就绪，不能删除ACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166005" : {
					"cause" : "虚拟防火墙没有就绪，不能创建ACL规则。",
					"desc" : "虚拟防火墙没有就绪，不能创建ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166006" : {
					"cause" : "虚拟防火墙已冻结，不能创建ACL规则。",
					"desc" : "虚拟防火墙已冻结，不能创建ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166007" : {
					"cause" : "ACL已经存在。",
					"desc" : "ACL已经存在。",
					"solution" : "请联系系统管理员。"
				},
				"1166009" : {
					"cause" : "底层设备创建ACL失败。",
					"desc" : "底层设备创建ACL失败。",
					"solution" : "请联系系统管理员。"
				},
				"1166011" : {
					"cause" : "底层设备创建ACL规则失败。",
					"desc" : "底层设备创建ACL规则失败。",
					"solution" : "请联系系统管理员。"
				},
				"1166012" : {
					"cause" : "底层设备删除ACL规则失败。",
					"desc" : "底层设备删除ACL规则失败。",
					"solution" : "请联系系统管理员。"
				},
				"1166013" : {
					"cause" : "ACL没有就绪，不能删除。",
					"desc" : "ACL没有就绪，不能删除。",
					"solution" : "请联系系统管理员。"
				},
				"1166014" : {
					"cause" : "ACL状态不为就绪。",
					"desc" : "ACL状态不为就绪。",
					"solution" : "请联系系统管理员。"
				},
				"1166015" : {
					"cause" : "ACL状态不为就绪。",
					"desc" : "ACL状态不为就绪。",
					"solution" : "请联系系统管理员。"
				},
				"1166016" : {
					"cause" : "当前VPC状态不能创建FWACL。",
					"desc" : "当前VPC状态不能创建FWACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166017" : {
					"cause" : "当前网络不是路由网络，不能用来创建NetACL。",
					"desc" : "当前网络不是路由网络，不能用来创建NetACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166018" : {
					"cause" : "VPC没有申请路由器。",
					"desc" : "VPC没有申请路由器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162550": {
					"cause":"当前路由器不支持创建VXLAN的网络。",
					"desc":"当前路由器不支持创建VXLAN的网络。",
					"solution":"请联系技术支持工程师。"
				},
                "1162650": {
					"cause":"组织网络查询超时。",
					"desc":"组织网络查询超时。",
					"solution":"请联系技术支持工程师。"
				},
				"1166019" : {
					"cause" : "弹性IP与ACL不属于同一个虚拟防火墙。",
					"desc" : "弹性IP与ACL不属于同一个虚拟防火墙。",
					"solution" : "请联系系统管理员。"
				},
				"1166020" : {
					"cause" : "当前ACL不是FWACL，不能创建FWACL规则。",
					"desc" : "当前ACL不是FWACL，不能创建FWACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166021" : {
					"cause" : "当前ACL不是NetACL，不能创建NetACL规则。",
					"desc" : "当前ACL不是NetACL，不能创建NetACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166022" : {
					"cause" : "ACL规则不存在。",
					"desc" : "ACL规则不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1166023" : {
					"cause" : "网络不是完成状态，不能创建NetACL规则。",
					"desc" : "网络不是完成状态，不能创建NetACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166025" : {
					"cause" : "ACL规则未处于稳态，不允许操作。",
					"desc" : "ACL规则未处于稳态，不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1166027" : {
					"cause" : "防火墙规则不属于指定VPC。",
					"desc" : "防火墙规则不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1166028" : {
					"cause" : "当前组网方式不支持域内ACL。",
					"desc" : "当前组网方式不支持域内ACL。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167002" : {
					"cause" : "SNAT不存在。",
					"desc" : "SNAT不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167007" : {
					"cause" : "没有可用的公网端口。",
					"desc" : "没有可用的公网端口。",
					"solution" : "请联系系统管理员。"
				},
				"1167011" : {
					"cause" : "DNAT不存在。",
					"desc" : "DNAT不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167012" : {
					"cause" : "底层设备配置SNAT失败。",
					"desc" : "底层设备配置SNAT失败。",
					"solution" : "请联系系统管理员。"
				},
				"1167015" : {
					"cause" : "底层设备配置NAT失败。",
					"desc" : "底层设备配置NAT失败。",
					"solution" : "请联系系统管理员。"
				},
				"1167019" : {
					"cause" : "正在开启SNAT。",
					"desc" : "正在开启SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167021" : {
					"cause" : "该公网IP池没有可用IP。",
					"desc" : "该公网IP池没有可用IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167029" : {
					"cause" : "正在关闭SNAT。",
					"desc" : "正在关闭SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167030" : {
					"cause" : "DNAT不是处于成功状态。",
					"desc" : "DNAT不是处于成功状态。",
					"solution" : "请联系系统管理员。"
				},
				"1167032" : {
					"cause" : "减少的端口中有端口被使用了。",
					"desc" : "减少的端口中有端口被使用了。",
					"solution" : "请联系系统管理员。"
				},
				"1167033" : {
					"cause" : "该虚拟机没有可以设置DNAT的网卡。",
					"desc" : "该虚拟机没有可以设置DNAT的网卡。",
					"solution" : "请联系系统管理员。"
				},
				"1167034" : {
					"cause" : "该资源分区没有配置公网访问虚拟机的参数。",
					"desc" : "该资源分区没有配置公网访问虚拟机的参数。",
					"solution" : "请联系系统管理员。"
				},
				"1167035" : {
					"cause" : "只有路由网络才能开启SNAT。",
					"desc" : "只有路由网络才能开启SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167036" : {
					"cause" : "该网络已经开启了SNAT。",
					"desc" : "该网络已经开启了SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167037" : {
					"cause" : "不支持该协议。",
					"desc" : "不支持该协议。",
					"solution" : "请联系系统管理员。"
				},
				"1167038" : {
					"cause" : "网络不在指定的VPC中。",
					"desc" : "网络不在指定的VPC中。",
					"solution" : "请联系系统管理员。"
				},
				"1167039" : {
					"cause" : "网络没有创建成功。",
					"desc" : "网络没有创建成功。",
					"solution" : "请联系系统管理员。"
				},
				"1167040" : {
					"cause" : "SNAT不属于指定VPC。",
					"desc" : "SNAT不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167041" : {
					"cause" : "该虚拟机已经设置了DNAT。",
					"desc" : "该虚拟机已经设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167045" : {
					"cause" : "该网卡和私有端口已经配置了DNAT。",
					"desc" : "该网卡和私有端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167046" : {
					"cause" : "创建外部子接口失败。",
					"desc" : "创建外部子接口失败。",
					"solution" : "请联系系统管理员。"
				},
				"1167047" : {
					"cause" : "该私有IP和私有端口已经配置了DNAT。",
					"desc" : "该私有IP和私有端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167048" : {
					"cause" : "该公网IP和公网端口已经配置了DNAT。",
					"desc" : "该公网IP和公网端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167049" : {
					"cause" : "VPC下无可用的公网IP。",
					"desc" : "VPC下无可用的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167050" : {
					"cause" : "VPC下的公网IP地址已被使用。",
					"desc" : "VPC下的公网IP地址已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1167051" : {
					"cause" : "已超过VDC下的公网IP上限。",
					"desc" : "已超过VDC下的公网IP上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167052" : {
					"cause" : "已超过VDC下的硬件虚拟防火墙上限。",
					"desc" : "已超过VDC下的硬件虚拟防火墙上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167053" : {
					"cause" : "已超过VDC下的软件虚拟防火墙上限。",
					"desc" : "已超过VDC下的软件虚拟防火墙上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167054" : {
					"cause" : "指定的公网IP非VPC下的公网IP。",
					"desc" : "指定的公网IP非VPC下的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167055" : {
					"cause" : "指定的公网IP不存在。",
					"desc" : "指定的公网IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167056" : {
					"cause" : "指定的公网IP与VPC下已开启SNAT的公网IP不一致。",
					"desc" : "指定的公网IP与VPC下已开启SNAT的公网IP不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1167057" : {
					"cause" : "VPC下存在公网IP，不允许释放虚拟防火墙。",
					"desc" : "VPC下存在公网IP，不允许释放虚拟防火墙。",
					"solution" : "请联系系统管理员。"
				},
				"1167058" : {
					"cause" : "公网IP池中不存在要申请的IP。",
					"desc" : "公网IP池中不存在要申请的IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167059" : {
					"cause" : "所在资源分区下可用的公网IP不足。",
					"desc" : "所在资源分区下可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167060" : {
					"cause" : "指定公网IP池内可用的公网IP不足。",
					"desc" : "指定公网IP池内可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167061" : {
					"cause" : "虚拟防火墙所在外部网络可用的公网IP不足。",
					"desc" : "虚拟防火墙所在外部网络可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167062" : {
					"cause" : "公网端口已被占用。",
					"desc" : "公网端口已被占用。",
					"solution" : "请联系系统管理员。"
				},
				"1167063" : {
					"cause" : "虚拟机或网络不属于指定VPC。",
					"desc" : "虚拟机或网络不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167064" : {
					"cause" : "DNAT不属于指定VPC。",
					"desc" : "DNAT不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167200" : {
					"cause" : "该弹性IP不存在。",
					"desc" : "该弹性IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167202" : {
					"cause" : "弹性IP和虚拟机已绑定。",
					"desc" : "弹性IP和虚拟机已绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167204" : {
					"cause" : "指定网卡无法设置弹性IP。",
					"desc" : "指定网卡无法设置弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167205" : {
					"cause" : "该弹性IP未被绑定。",
					"desc" : "该弹性IP未被绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167207" : {
					"cause" : "指定网卡不存在。",
					"desc" : "指定网卡不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167208" : {
					"cause" : "该弹性IP已经冻结。",
					"desc" : "该弹性IP已经冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1167209" : {
					"cause" : "该弹性IP已经恢复。",
					"desc" : "该弹性IP已经恢复。",
					"solution" : "请联系系统管理员。"
				},
				"1167210" : {
					"cause" : "该弹性IP正在绑定。",
					"desc" : "该弹性IP正在绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167211" : {
					"cause" : "该弹性IP正在解绑。",
					"desc" : "该弹性IP正在解绑。",
					"solution" : "请联系系统管理员。"
				},
				"1167212" : {
					"cause" : "该弹性IP正在冻结。",
					"desc" : "该弹性IP正在冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1167213" : {
					"cause" : "该弹性IP正在恢复。",
					"desc" : "该弹性IP正在恢复。",
					"solution" : "请联系系统管理员。"
				},
				"1167214" : {
					"cause" : "申请的公网IP超过上限。",
					"desc" : "申请的公网IP超过上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167215" : {
					"cause" : "没有可以绑定弹性IP的网卡。",
					"desc" : "没有可以绑定弹性IP的网卡。",
					"solution" : "请联系系统管理员。"
				},
				"1167216" : {
					"cause" : "弹性IP所在的VPC与网卡所在的VPC不一致。",
					"desc" : "弹性IP所在的VPC与网卡所在的VPC不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1167217" : {
					"cause" : "该弹性IP有ACL规则。",
					"desc" : "该弹性IP有ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1167218" : {
					"cause" : "该私有IP不存在。",
					"desc" : "该私有IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167219" : {
					"cause" : "VPN使用了该弹性IP",
					"desc" : "VPN使用了该弹性IP",
					"solution" : "请联系系统管理员。"
				},
				"1167220" : {
					"cause" : "不允许使用静态注入网络配置类型。",
					"desc" : "不允许使用静态注入网络配置类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167222" : {
					"cause" : "绑定的弹性IP已达到最大值。",
					"desc" : "绑定的弹性IP已达到最大值。",
					"solution" : "请联系系统管理员。"
				},
				"1167223" : {
					"cause" : "弹性IP和F5中的VLB进行了绑定",
					"desc" : "弹性IP和F5中的VLB进行了绑定",
					"solution" : "请联系系统管理员。"
				},
				"1167224" : {
					"cause" : "私有IP绑定了弹性IP。",
					"desc" : "私有IP绑定了弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167226" : {
					"cause" : "弹性IP和私有IP进行了绑定",
					"desc" : "弹性IP和私有IP进行了绑定",
					"solution" : "请联系系统管理员。"
				},
				"1167228" : {
					"cause" : "网卡设置了DNAT。",
					"desc" : "网卡设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167229" : {
					"cause" : "私有IP设置了DNAT。",
					"desc" : "私有IP设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167230" : {
					"cause" : "弹性IP和软件负载均衡器进行了绑定。",
					"desc" : "弹性IP和软件负载均衡器进行了绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167231" : {
					"cause" : "正在修改IP带宽。",
					"desc" : "正在修改IP带宽。",
					"solution" : "请联系系统管理员。"
				},
				"1167232" : {
					"cause" : "弹性IP不属于VPC。",
					"desc" : "弹性IP不属于VPC。",
					"solution" : "请联系系统管理员。"
				},
				"1167300" : {
					"cause" : "IP池中有名称冲突。",
					"desc" : "IP池中有名称冲突。",
					"solution" : "请重新输入名称。"
				},
				"1167301" : {
					"cause" : "有公网IP地址已经被其他公网IP池使用。",
					"desc" : "有公网IP地址已经被其他公网IP池使用。",
					"solution" : "请修改公网IP段。"
				},
				"1167302" : {
					"cause" : "公网IP池不存在。",
					"desc" : "公网IP池不存在。",
					"solution" : "请重新刷新公网IP池列表。"
				},
				"1167303" : {
					"cause" : "IP池中有IP地址已被分配或正在使用，不允许删除。",
					"desc" : "IP池中有IP地址已被分配或正在使用，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167304" : {
					"cause" : "IP池中有IP地址不在。",
					"desc" : "IP池中有IP地址不在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167305" : {
					"cause" : "IP池中有IP地址已作他用。",
					"desc" : "IP池中有IP地址已作他用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167306" : {
					"cause" : "一个公网IP池中最多能添加1024个IP地址段。",
					"desc" : "一个公网IP池中最多能添加1024个IP地址段。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167307" : {
					"cause" : "一个资源分区最多能添加16个IP池。",
					"desc" : "一个资源分区最多能添加16个IP池。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167308" : {
					"cause" : "该IP和资源分区不匹配。",
					"desc" : "该IP和资源分区不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1167309" : {
					"cause" : "公网IP段和外部网络的子网冲突。",
					"desc" : "公网IP段和外部网络的子网冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167310" : {
					"cause" : "IP地址已被释放。",
					"desc" : "IP地址已被释放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167311" : {
					"cause" : "公网IP池中的IP地址段冲突。",
					"desc" : "公网IP池中的IP地址段冲突。",
					"solution" : "请联系技术支持工程师。"
				},
                "1167321" : {
					"cause" : "公网IP个数超出系统最大规格。",
					"desc" : "公网IP个数超出系统最大规格。",
					"solution" : "请联系技术支持工程师。"
				},
				"1169002" : {
					"cause" : "该IP未被设置在虚拟防火墙上。",
					"desc" : "该IP未被设置在虚拟防火墙上。",
					"solution" : "请联系系统管理员。"
				},
				"1169101" : {
					"cause" : "该IP带宽规格不存在。",
					"desc" : "该IP带宽规格不存在。",
					"solution" : "请刷新列表后重试。"
				},
				"1169103" : {
					"cause" : "IP带宽规格个数超过系统最大值。",
					"desc" : "IP带宽规格个数超过系统最大值。",
					"solution" : "null"
				},
				"1169105" : {
					"cause" : "底层设备配置IP带宽失败。",
					"desc" : "底层设备配置IP带宽失败。",
					"solution" : "请联系系统管理员。"
				},
				"1170011" : {
					"cause" : "当前资源分区下VSA管理网络个数超过最大值16个。",
					"desc" : "当前资源分区下VSA管理网络个数超过最大值16个。",
					"solution" : "请重新进行组网规划。"
				},
				"1170012" : {
					"cause" : "网络名称重复。",
					"desc" : "网络名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1170014" : {
					"cause" : "VSA网络的IP段和已经有的IP段之间有冲突",
					"desc" : "VSA网络的IP段和已经有的IP段之间有冲突",
					"solution" : "请重新规划网络"
				},
				"1170015" : {
					"cause" : "网络被使用",
					"desc" : "网络被使用",
					"solution" : "请不使用时进行操作"
				},
				"1170016" : {
					"cause" : "VSA网络不存在",
					"desc" : "VSA网络不存在",
					"solution" : ""
				},
				"1170017" : {
					"cause" : "VLAN编号在当前当前资源分区下已经存在。",
					"desc" : "VLAN编号在当前当前资源分区下已经存在。",
					"solution" : "请重新选择VLAN编号。"
				},
				"1170018" : {
					"cause" : "要创建的子网在其他资源分区下已经存在",
					"desc" : "要创建的子网在其他资源分区下已经存在",
					"solution" : "请重新输入子网信息。"
				},
				"1170021" : {
					"cause" : "可用IP段不合法。",
					"desc" : "可用IP段不合法。",
					"solution" : "请重新进行组网规划。"
				},
				"1170022" : {
					"cause" : "可用IP地址段范围有重叠。",
					"desc" : "可用IP地址段范围有重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1170024" : {
					"cause" : "VLAN和VLAN池中的VLAN冲突。",
					"desc" : "VLAN和VLAN池中的VLAN冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1170025" : {
					"cause" : "子网可用IP总个数超过VRM最大限制规模128个",
					"desc" : "子网可用IP总个数超过VRM最大限制规模128个",
					"solution" : "请重新输入子网信息。"
				},
				"1170026" : {
					"cause" : "VSA网络和外部网络冲突",
					"desc" : "VSA网络和外部网络冲突",
					"solution" : "请重新输入。"
				},
				"1170027" : {
					"cause" : "VSA网络和VPC下的网络冲突。",
					"desc" : "VSA网络和VPC下的网络冲突。",
					"solution" : "请重新输入。"
				},
				"1170028" : {
					"cause" : "只有FusionComputer支持创建DHCP服务器。",
					"desc" : "只有FusionComputer支持创建DHCP服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1170029" : {
					"cause" : "同一资源分区下，VLAN和其它VSA管理网络不同，子网也不能相同。",
					"desc" : "同一资源分区下，VLAN和其它VSA管理网络不同，子网也不能相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180000" : {
					"cause" : "VPC下的DHCP VSA不存在。",
					"desc" : "VPC下的DHCP VSA不存在。",
					"solution" : "请联系系统管理员。"
				},
				"11800120" : {
					"cause" : "虚拟机状态不为运行中。",
					"desc" : "虚拟机状态不为运行中。",
					"solution" : "请联系系统管理员。"
				},
				"1180100" : {
					"cause" : "DHCP服务器不存在。",
					"desc" : "DHCP服务器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180101" : {
					"cause" : "创建VSA虚拟机失败。",
					"desc" : "创建VSA虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180102" : {
					"cause" : "添加VSA外部接口失败。",
					"desc" : "添加VSA外部接口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180103" : {
					"cause" : "添加VSA失败。",
					"desc" : "添加VSA失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180104" : {
					"cause" : "vsa虚拟机模板不存在。",
					"desc" : "vsa虚拟机模板不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1180105" : {
					"cause" : "VPC已经申请了虚拟防火墙。",
					"desc" : "VPC已经申请了虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180107" : {
					"cause" : "外部网络不是普通子网类型，无法用于创建软件防火墙。",
					"desc" : "外部网络不是普通子网类型，无法用于创建软件防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180108" : {
					"cause" : "外部网络中没有可用的IP。",
					"desc" : "外部网络中没有可用的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180109" : {
					"cause" : "外部网络和VPC不属于同一个资源分区。",
					"desc" : "外部网络和VPC不属于同一个资源分区。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180110" : {
					"cause" : "外部网络ip分配方式不为静态注入，无法用于创建软件防火墙。",
					"desc" : "外部网络ip分配方式不为静态注入，无法用于创建软件防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180111" : {
					"cause" : "软件防火墙状态不允许操作。",
					"desc" : "软件防火墙状态不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180112" : {
					"cause" : "无法获取到软件防火墙VSA虚拟机网卡ip。",
					"desc" : "无法获取到软件防火墙VSA虚拟机网卡ip。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180113" : {
					"cause" : "没有可用的外部网络。",
					"desc" : "没有可用的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180114" : {
					"cause" : "没有可用的vsa管理网络。",
					"desc" : "没有可用的vsa管理网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180115" : {
					"cause" : "没有可用的vtep网络。",
					"desc" : "没有可用的vtep网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180116" : {
					"cause" : "vsa不在当前vpc下。",
					"desc" : "vsa不在当前vpc下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180117" : {
					"cause" : "没有firewall vsa存在。",
					"desc" : "没有firewall vsa存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180118" : {
					"cause" : "外部网络无效。",
					"desc" : "外部网络无效。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180119" : {
					"cause" : "该资源分区下已经存在外部网络的DHCP服务器。",
					"desc" : "该资源分区下已经存在外部网络的DHCP服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180121" : {
					"cause" : "创建VSA虚拟机失败。",
					"desc" : "创建VSA虚拟机失败。",
					"solution" : "请联系系统管理员。"
				},
				"1180122" : {
					"cause" : "资源分区下有内部DHCP类型的外部网络，不允许删除DHCP服务器。",
					"desc" : "资源分区下有内部DHCP类型的外部网络，不允许删除DHCP服务器。",
					"solution" : "请联系系统管理员。"
				},
				"1180123" : {
					"cause" : "主机网卡类型不支持vxlan。",
					"desc" : "主机网卡类型不支持vxlan。",
					"solution" : "请联系系统管理员。"
				},
				"1180125" : {
					"cause" : "添加路由失败。",
					"desc" : "添加路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180126" : {
					"cause" : "DHCP服务器状态不允许此操作。",
					"desc" : "DHCP服务器状态不允许此操作。",
					"solution" : "请刷新后重新尝试。"
				},
				"1180127" : {
					"cause" : "删除路由失败。",
					"desc" : "删除路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180128" : {
					"cause" : "删除DHCP Subnet失败。",
					"desc" : "删除DHCP Subnet失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180129" : {
					"cause" : "虚拟化环境没有接入VSAM。",
					"desc" : "虚拟化环境没有接入VSAM。",
					"solution" : "请先接入VSAM，然后重试%u"
				},
				"1180130" : {
					"cause" : "只有FusionComputer支持创建DHCP服务器。",
					"desc" : "只有FusionComputer支持创建DHCP服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181000" : {
					"cause" : "VPC名称已存在。",
					"desc" : "VPC名称已存在。",
					"solution" : "null"
				},
				"1181001" : {
					"cause" : "所选VDC下没有资源或者该VDC下没有可用的网络。",
					"desc" : "所选VDC下没有资源或者该VDC下没有可用的网络。",
					"solution" : "null"
				},
				"1181002" : {
					"cause" : "VPC不存在。",
					"desc" : "VPC不存在。",
					"solution" : "null"
				},
				"1181003" : {
					"cause" : "最大内部网络个数小于当前VPC下内部网络的个数。",
					"desc" : "最大内部网络个数小于当前VPC下内部网络的个数。",
					"solution" : "null"
				},
				"1181004" : {
					"cause" : "最大直连网络个数小于当前VPC下直连网络的个数。",
					"desc" : "最大直连网络个数小于当前VPC下直连网络的个数。",
					"solution" : "null"
				},
				"1181005" : {
					"cause" : "最大路由网络个数小于当前VPC下路由网络的个数。",
					"desc" : "最大路由网络个数小于当前VPC下路由网络的个数。",
					"solution" : "null"
				},
				"1181006" : {
					"cause" : "最大弹性IP个数小于当前VPC下弹性IP的个数。",
					"desc" : "最大弹性IP个数小于当前VPC下弹性IP的个数。",
					"solution" : "null"
				},
				"1181007" : {
					"cause" : "VPC下已有网络，不允许删除。",
					"desc" : "VPC下已有网络，不允许删除。",
					"solution" : "null"
				},
				"1181008" : {
					"cause" : "VPC已关联了虚拟防火墙，不允许删除。",
					"desc" : "VPC已关联了虚拟防火墙，不允许删除。",
					"solution" : "null"
				},
				"1181010" : {
					"cause" : "vlan不在指定的VPC下。",
					"desc" : "vlan不在指定的VPC下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181011" : {
					"cause" : "网关与子网内系统保留的IP重复。子网内第二个和第三个IP为系统保留IP，不能作为网关使用。",
					"desc" : "网关与子网内系统保留的IP重复。子网内第二个和第三个IP为系统保留IP，不能作为网关使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181012" : {
					"cause" : "VPC下已有弹性IP，不允许删除。",
					"desc" : "VPC下已有弹性IP，不允许删除。",
					"solution" : "null"
				},
				"1181013" : {
					"cause" : "VPC下有安全组，不允许删除。",
					"desc" : "VPC下有安全组，不允许删除。",
					"solution" : "null"
				},
				"1181014" : {
					"cause" : "当前资源分区下的VPC数量达到上限。",
					"desc" : "当前资源分区下的VPC数量达到上限。",
					"solution" : "null"
				},
				"1181015" : {
					"cause" : "VPC当前状态不允许操作。",
					"desc" : "VPC当前状态不允许操作。",
					"solution" : "null"
				},
				"1181016" : {
					"cause" : "VPC下已经部署了服务，不允许删除。",
					"desc" : "VPC下已经部署了服务，不允许删除。",
					"solution" : "请先删除服务，在尝试删除。"
				},
				"1181017" : {
					"cause" : "VPC下存在路由器，不能删除。",
					"desc" : "VPC下存在路由器，不能删除。",
					"solution" : "请先删除路由器，再尝试删除"
				},
				"1182000" : {
					"cause" : "每个VPC下仅能创建一个VPN网关，不允许创建多个VPN网关。",
					"desc" : "每个VPC下仅能创建一个VPN网关，不允许创建多个VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1182001" : {
					"cause" : "VPC未申请硬件类型的VFW，不允许创建VPN网关。",
					"desc" : "VPC未申请硬件类型的VFW，不允许创建VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1182002" : {
					"cause" : "VPN网关不存在。",
					"desc" : "VPN网关不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1182003" : {
					"cause" : "VPN网关已被使用。",
					"desc" : "VPN网关已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1182004" : {
					"cause" : "VPN网关名称重复。",
					"desc" : "VPN网关名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1182005" : {
					"cause" : "VPN网关与VPC不匹配。",
					"desc" : "VPN网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1182006" : {
					"cause" : "VPC下没有可用的弹性IP，无法创建VPN网关。",
					"desc" : "VPC下没有可用的弹性IP，无法创建VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1183000" : {
					"cause" : "远端网关地址与VPC下的远端网关地址冲突。",
					"desc" : "远端网关地址与VPC下的远端网关地址冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1183001" : {
					"cause" : "远端网关地址与VPN网关IP地址冲突。",
					"desc" : "远端网关地址与VPN网关IP地址冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1183002" : {
					"cause" : "远端网关不存在。",
					"desc" : "远端网关不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1183003" : {
					"cause" : "远端网关子网信息不存在。",
					"desc" : "远端网关子网信息不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1183004" : {
					"cause" : "远端网关已被使用。",
					"desc" : "远端网关已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1183005" : {
					"cause" : "远端网关名称重复。",
					"desc" : "远端网关名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1183006" : {
					"cause" : "远端网关与VPC不匹配。",
					"desc" : "远端网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1183007" : {
					"cause" : "网络个数超过远端网关的限额。",
					"desc" : "网络个数超过远端网关的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1183008" : {
					"cause" : "远端网关个数达到VPC下的限额。",
					"desc" : "远端网关个数达到VPC下的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1184000" : {
					"cause" : "用户网关与本端网关冲突。",
					"desc" : "用户网关与本端网关冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184001" : {
					"cause" : "用户网关与VPC下的其他用户网关冲突。",
					"desc" : "用户网关与VPC下的其他用户网关冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184002" : {
					"cause" : "本端网关与VPC下的本端网关不同。",
					"desc" : "本端网关与VPC下的本端网关不同。",
					"solution" : "请联系系统管理员。"
				},
				"1184003" : {
					"cause" : "远端用户的子网相互冲突。",
					"desc" : "远端用户的子网相互冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184004" : {
					"cause" : "远端用户子网与VPC下的远端用户子网冲突。",
					"desc" : "远端用户子网与VPC下的远端用户子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184005" : {
					"cause" : "远端用户子网与VPC下的子网冲突。",
					"desc" : "远端用户子网与VPC下的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184006" : {
					"cause" : "VPN连接名称重复。",
					"desc" : "VPN连接名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1184007" : {
					"cause" : "VPN连接已存在。",
					"desc" : "VPN连接已存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184008" : {
					"cause" : "VPN连接不存在。",
					"desc" : "VPN连接不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184009" : {
					"cause" : "VPN连接与VPC不匹配。",
					"desc" : "VPN连接与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184010" : {
					"cause" : "VPN连接状态不允许操作。",
					"desc" : "VPN连接状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1184011" : {
					"cause" : "VPN连接本端子网不存在。",
					"desc" : "VPN连接本端子网不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184012" : {
					"cause" : "IKE策略的鉴权方式不允许修改。",
					"desc" : "IKE策略的鉴权方式不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184013" : {
					"cause" : "IKE策略的认证算法不允许修改。",
					"desc" : "IKE策略的认证算法不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184014" : {
					"cause" : "IKE策略的加密算法不允许修改。",
					"desc" : "IKE策略的加密算法不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184015" : {
					"cause" : "IKE策略的DH算法不允许修改。",
					"desc" : "IKE策略的DH算法不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184016" : {
					"cause" : "IKE策略的生命周期不允许修改。",
					"desc" : "IKE策略的生命周期不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184017" : {
					"cause" : "ESP策略的认证算法不允许修改。",
					"desc" : "ESP策略的认证算法不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184018" : {
					"cause" : "ESP策略的加密算法不允许修改。",
					"desc" : "ESP策略的加密算法不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184019" : {
					"cause" : "DPD检测重传时间间隔不允许修改。",
					"desc" : "DPD检测重传时间间隔不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184020" : {
					"cause" : "DPD检测超时时间不允许修改。",
					"desc" : "DPD检测超时时间不允许修改。",
					"solution" : "请联系系统管理员。"
				},
				"1184021" : {
					"cause" : "本端网关不是弹性IP。",
					"desc" : "本端网关不是弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1184022" : {
					"cause" : "本端网络与VPC不匹配。",
					"desc" : "本端网络与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184023" : {
					"cause" : "VPN个数达到VPC下的限额。",
					"desc" : "VPN个数达到VPC下的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1184024" : {
					"cause" : "远端子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"desc" : "远端子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"solution" : "请联系系统管理员。"
				},
				"1184025" : {
					"cause" : "底层创建VPN连接失败。",
					"desc" : "底层创建VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184026" : {
					"cause" : "底层修改VPN连接失败。",
					"desc" : "底层修改VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184027" : {
					"cause" : "底层删除VPN连接失败。",
					"desc" : "底层删除VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184028" : {
					"cause" : "本端网关与VPC不匹配。",
					"desc" : "本端网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184029" : {
					"cause" : "L2tp client可以使用的子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"desc" : "L2tp client可以使用的子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"solution" : "请联系系统管理员。"
				},
				"1184030" : {
					"cause" : "一个VPC只能创建一个类型为L2TP的VPN连接，该VPC下L2TP的VPN连接已存在，不允许创建多个L2TP类型的VPN连接。",
					"desc" : "一个VPC只能创建一个类型为L2TP的VPN连接，该VPC下L2TP的VPN连接已存在，不允许创建多个L2TP类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184031" : {
					"cause" : "该网络与VPC下的远端网络冲突。",
					"desc" : "该网络与VPC下的远端网络冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184032" : {
					"cause" : "该网络与L2TP类型VPN的子网冲突。",
					"desc" : "该网络与L2TP类型VPN的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184033" : {
					"cause" : "L2TP类型的VPN子网信息与其他L2TP类型的VPN子网冲突。",
					"desc" : "L2TP类型的VPN子网信息与其他L2TP类型的VPN子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184034" : {
					"cause" : "远端用户子网与L2TP类型VPN的子网冲突。",
					"desc" : "远端用户子网与L2TP类型VPN的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184035" : {
					"cause" : "L2TP类型的VPN子网与远端用户子网冲突。",
					"desc" : "L2TP类型的VPN子网与远端用户子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184036" : {
					"cause" : "L2TP类型的VPN用户名称重复。",
					"desc" : "L2TP类型的VPN用户名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1184039" : {
					"cause" : "VPC未申请硬件类型的VFW。",
					"desc" : "VPC未申请硬件类型的VFW。",
					"solution" : "请联系系统管理员。"
				},
				"1184040" : {
					"cause" : "当前VPC没有创建VPN网关，请先创建。",
					"desc" : "当前VPC没有创建VPN网关，请先创建。",
					"solution" : "请联系系统管理员。"
				},
				"1184041" : {
					"cause" : "当前VPC已存在IPSec类型的VPN连接，不允许创建其他类型的VPN连接。",
					"desc" : "当前VPC已存在IPSec类型的VPN连接，不允许创建其他类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184042" : {
					"cause" : "当前VPC已存在L2TP类型的VPN连接，不允许创建其他类型的VPN连接。",
					"desc" : "当前VPC已存在L2TP类型的VPN连接，不允许创建其他类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184043" : {
					"cause" : "软件防火墙只支持Ipsec类型的VPN连接，不支持其他类型。",
					"desc" : "软件防火墙只支持Ipsec类型的VPN连接，不支持其他类型。",
					"solution" : "请联系系统管理员。"
				},
				"1184044" : {
					"cause" : "L2TP类型的VPN连接允许接入的用户个数超过系统限制。",
					"desc" : "L2TP类型的VPN连接允许接入的用户个数超过系统限制。",
					"solution" : "请联系系统管理员。"
				},
				"1184045" : {
					"cause" : "底层创建VPN用户失败。",
					"desc" : "底层创建VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184046" : {
					"cause" : "底层修改VPN用户失败。",
					"desc" : "底层修改VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184047" : {
					"cause" : "底层删除VPN用户失败。",
					"desc" : "底层删除VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184048" : {
					"cause" : "底层创建VPN失败。",
					"desc" : "底层创建VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184049" : {
					"cause" : "底层修改VPN失败。",
					"desc" : "底层修改VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184050" : {
					"cause" : "底层删除VPN失败。",
					"desc" : "底层删除VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184051" : {
					"cause" : "L2TP类型的VPN连接用户名与防火墙SSH用户重名。",
					"desc" : "L2TP类型的VPN连接用户名与防火墙SSH用户重名。",
					"solution" : "请联系系统管理员。"
				},
				"1184052" : {
					"cause" : "L2TP VPN连接名称是l2tp(不区分大小写)，名称非法。",
					"desc" : "L2TP VPN连接名称是l2tp(不区分大小写)，名称非法。",
					"solution" : "请联系系统管理员。"
				},
				"1184053" : {
					"cause" : "IKE预共享原密码不正确。",
					"desc" : "IKE预共享原密码不正确。",
					"solution" : "请联系系统管理员。"
				},
				"1184054" : {
					"cause" : "隧道加密原密码不正确。",
					"desc" : "隧道加密原密码不正确。",
					"solution" : "请联系系统管理员。"
				},
				"1184055" : {
					"cause" : "L2TP VPN用户原密码不正确。",
					"desc" : "L2TP VPN用户原密码不正确。",
					"solution" : "请联系系统管理员。"
				},
				"1184056" : {
					"cause" : "L2TP VPN服务异常。",
					"desc" : "L2TP VPN服务异常。",
					"solution" : "请联系系统管理员。"
				},
				"1184057" : {
					"cause" : "L2TP VPN用户不存在。",
					"desc" : "L2TP VPN用户不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184058" : {
					"cause" : "L2TP VPN用户当前状态不允许操作。",
					"desc" : "L2TP VPN用户当前状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1184059" : {
					"cause" : "L2TP VPN用户不属于该VPC。",
					"desc" : "L2TP VPN用户不属于该VPC。",
					"solution" : "请联系系统管理员。"
				},
				"1184060" : {
					"cause" : "该网络暂时不可以添加L2TP用户。",
					"desc" : "该网络暂时不可以添加L2TP用户。",
					"solution" : "请联系系统管理员。"
				},
				"1184061" : {
					"cause" : "该网络未被申请，不能创建L2TP VPN用户。",
					"desc" : "该网络未被申请，不能创建L2TP VPN用户。",
					"solution" : "请联系系统管理员。"
				},
				"1190501" : {
					"cause" : "设备已存在",
					"desc" : "设备已存在",
					"solution" : "请确认是否设备已存在"
				},
				"1190502" : {
					"cause" : "设备不可达，icmp无法ping通设备",
					"desc" : "设备不可达，icmp无法ping通设备",
					"solution" : "请确认网络状况是否异常"
				},
				"1190503" : {
					"cause" : "IP地址重复",
					"desc" : "IP地址重复",
					"solution" : "请确认是否为重复接入"
				},
				"1190504" : {
					"cause" : "数据库添加操作失败",
					"desc" : "数据库添加操作失败",
					"solution" : "请确认添加逻辑是否正常"
				},
				"1190505" : {
					"cause" : "业务添加失败",
					"desc" : "业务添加失败",
					"solution" : "请确认添加逻辑是否正常"
				},
				"1190507" : {
					"cause" : "设备不存在.",
					"desc" : "设备不存在.",
					"solution" : "请确认设备存在."
				},
				"1190508" : {
					"cause" : "业务删除失败",
					"desc" : "业务删除失败",
					"solution" : "请确认设备是否可删除"
				},
				"1190509" : {
					"cause" : "业务正在运行无法进行删除",
					"desc" : "业务正在运行无法进行删除",
					"solution" : "请先停止正在运行的业务在进行删除操作"
				},
				"1190510" : {
					"cause" : "业务更新失败",
					"desc" : "业务更新失败",
					"solution" : "请检查更新信息是否正确"
				},
				"1190511" : {
					"cause" : "数据库更新操作失败",
					"desc" : "数据库更新操作失败",
					"solution" : "请检查更新信息是否正确"
				},
				"1190512" : {
					"cause" : "用户名或密码错误。",
					"desc" : "用户名或密码错误。",
					"solution" : "请输入正确的用户名和密码。"
				},
				"1190513" : {
					"cause" : "设备端口名称非法。",
					"desc" : "设备端口名称非法。",
					"solution" : "请输入正确的设备端口名称。"
				},
				"1190514" : {
					"cause" : "查询设备端口名称失败。",
					"desc" : "查询设备端口名称失败。",
					"solution" : "请输入正确的设备端口名称。"
				},
				"1190515" : {
					"cause" : "登录设备失败。",
					"desc" : "登录设备失败。",
					"solution" : "请输入正确的接入参数。"
				},
				"1190533" : {
					"cause" : "BMC IP与 OS IP冲突.",
					"desc" : "BMC IP与 OS IP冲突.",
					"solution" : "请输入正确的BMC IP和OS IP。"
				},
				"1200001" : {
					"cause" : "部署服务不存在。",
					"desc" : "部署服务不存在。",
					"solution" : "请刷新页面。"
				},
				"1200002" : {
					"cause" : "部署服务停止失败。",
					"desc" : "部署服务停止失败。",
					"solution" : "请重试。"
				},
				"1200003" : {
					"cause" : "修改网卡失败。",
					"desc" : "修改网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200004" : {
					"cause" : "部署服务虚拟机无法连接。",
					"desc" : "部署服务虚拟机无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200006" : {
					"cause" : "认证失败。",
					"desc" : "认证失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200007" : {
					"cause" : "任务不存在。",
					"desc" : "任务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200008" : {
					"cause" : "修改路由失败。",
					"desc" : "修改路由失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200009" : {
					"cause" : "部署服务虚拟机上静态路由文件创建失败。",
					"desc" : "部署服务虚拟机上静态路由文件创建失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200010" : {
					"cause" : "部署服务虚拟机上静态路由文件不存在。",
					"desc" : "部署服务虚拟机上静态路由文件不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200011" : {
					"cause" : "创建部署服务虚拟机失败。",
					"desc" : "创建部署服务虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200012" : {
					"cause" : "启动部署服务虚拟机失败。",
					"desc" : "启动部署服务虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200013" : {
					"cause" : "部署服务已存在。",
					"desc" : "部署服务已存在。",
					"solution" : "请刷新页面。"
				},
				"1200014" : {
					"cause" : "部署服务状态冲突不允许执行该操作。",
					"desc" : "部署服务状态冲突不允许执行该操作。",
					"solution" : "请刷新页面后重试。"
				},
				"1200015" : {
					"cause" : "部署服务虚拟机模板不存在。",
					"desc" : "部署服务虚拟机模板不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200016" : {
					"cause" : "部署服务虚拟机获取ip失败。",
					"desc" : "部署服务虚拟机获取ip失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200017" : {
					"cause" : "部署服务非运行态",
					"desc" : "部署服务非运行态",
					"solution" : "请检查部署服务的状态"
				},
				"1200023" : {
					"cause" : "部署服务的网络超过上限",
					"desc" : "部署服务的网络超过上限",
					"solution" : "请联系系统管理员"
				},
				"1200024" : {
					"cause" : "部署服务的路由网络超过上限",
					"desc" : "部署服务的路由网络超过上限",
					"solution" : "请联系系统管理员"
				},
				"1200025" : {
					"cause" : "部署服务网络重复",
					"desc" : "部署服务网络重复",
					"solution" : "请移除重复的网络"
				},
				"1200090" : {
					"cause" : "该存储类型不支持拷贝。",
					"desc" : "该存储类型不支持拷贝。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211001" : {
					"cause" : "组播IP池不存在。",
					"desc" : "组播IP池不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"1211002" : {
					"cause" : "组播IP池已被使用。",
					"desc" : "组播IP池已被使用。",
					"solution" : "请刷新页面后重试。"
				},
				"1211003" : {
					"cause" : "没有可用的组播IP池。",
					"desc" : "没有可用的组播IP池。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211004" : {
					"cause" : "组播IP已回收。",
					"desc" : "组播IP已回收。",
					"solution" : "请刷新页面后重试。"
				},
				"1211005" : {
					"cause" : "资源分区不存在。",
					"desc" : "资源分区不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"1211006" : {
					"cause" : "和已有组播IP池有重叠。",
					"desc" : "和已有组播IP池有重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211007" : {
					"cause" : "一个资源分区最多创建8个组播IP池",
					"desc" : "一个资源分区最多创建8个组播IP池",
					"solution" : "请联系技术支持工程师。"
				},
				"1220001" : {
					"cause" : "路由器的当前状态不允许操作",
					"desc" : "路由器的当前状态不允许操作",
					"solution" : "请联系系统管理员。"
				},
				"1220002" : {
					"cause" : "没有接入汇聚交换机",
					"desc" : "没有接入汇聚交换机",
					"solution" : "请联系系统管理员，接入汇聚交换机"
				},
				"1220003" : {
					"cause" : "指定的VPC内已经创建了路由器",
					"desc" : "指定的VPC内已经创建了路由器",
					"solution" : ""
				},
				"1220004" : {
					"cause" : "VPC中存在路由网络，不能删除路由器",
					"desc" : "VPC中存在路由网络，不能删除路由器",
					"solution" : ""
				},
				"1220006" : {
					"cause" : "当前组网模式不支持硬件路由器。",
					"desc" : "当前组网模式不支持硬件路由器。",
					"solution" : ""
				},
				"1220007" : {
					"cause" : "路由器不属于指定VPC。",
					"desc" : "路由器不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1221001" : {
					"cause" : "Vrf 不存在",
					"desc" : "Vrf 不存在",
					"solution" : "Please contact the system administrator."
				},
				"1260001" : {
					"cause" : "适配包正在使用，禁止卸载。",
					"desc" : "适配包正在使用，禁止卸载。",
					"solution" : "请稍候重试。"
				},
				"1290002" : {
					"cause" : "VSAM不存在。",
					"desc" : "VSAM不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290006" : {
					"cause" : "恢复VSAM数据失败，请重试。",
					"desc" : "恢复VSAM数据失败，请重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290007" : {
					"cause" : "VSAM正在审计中。",
					"desc" : "VSAM正在审计中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290011" : {
					"cause" : "添加或者删除静态ip-mac绑定，mac重复。",
					"desc" : "添加或者删除静态ip-mac绑定，mac重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290012" : {
					"cause" : "VSA虚拟机不存在。",
					"desc" : "VSA虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290013" : {
					"cause" : "VSA上DHCP服务功能未开启。",
					"desc" : "VSA上DHCP服务功能未开启。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290026" : {
					"cause" : "域名不合法。",
					"desc" : "域名不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290035" : {
					"cause" : "dhcp服务器上有任务正在运行，请稍后再试。",
					"desc" : "dhcp服务器上有任务正在运行，请稍后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290044" : {
					"cause" : "DHCP relay服务异常。",
					"desc" : "DHCP relay服务异常。",
					"solution" : "请稍后重试。"
				},
				"1290045" : {
					"cause" : "接口IP段冲突。",
					"desc" : "接口IP段冲突。",
					"solution" : "请换一个子网IP重新尝试。"
				},
				"1290046" : {
					"cause" : "接口上面已经配置了路由信息，不允许删除。",
					"desc" : "接口上面已经配置了路由信息，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290063" : {
					"cause" : "系统服务虚拟机时间与其管理节点不一致，请联系管理员处理保证系统时间一致。",
					"desc" : "系统服务虚拟机时间与其管理节点不一致，请联系管理员处理保证系统时间一致。",
					"solution" : "系统服务虚拟机时间与其管理节点不一致，请联系管理员处理保证系统时间一致。"
				},
				"1290643" : {
					"cause" : "VSAM连接异常。",
					"desc" : "VSAM连接异常，请检查VSAM虚拟机状态，以及确认网络配置是否正确。",
					"solution" : "VSAM连接异常，请检查VSAM虚拟机状态，以及确认网络配置是否正确。"
				},
				"1290644" : {
					"cause" : "VSAM虚拟机正在连接，请稍后重试。",
					"desc" : "VSAM虚拟机正在连接，请稍后重试。",
					"solution" : "VSAM虚拟机正在连接，请稍后重试。"
				},
				"1290646" : {
					"cause" : "管理ip不在同一网段。",
					"desc" : "管理ip不在同一网段。",
					"solution" : "管理ip不在同一网段。"
				},
				"1290647" : {
					"cause" : "管理ip冲突。",
					"desc" : "管理ip冲突。",
					"solution" : "管理ip冲突。"
				},
				"1290648" : {
					"cause" : "vsam单节点部署时，管理ip必须相同。",
					"desc" : "vsam单节点部署时，管理ip必须相同。",
					"solution" : "vsam单节点部署时，管理ip必须相同。"
				},
				"1290649" : {
					"cause" : "网关和管理ip冲突。",
					"desc" : "网关和管理ip冲突。",
					"solution" : "网关和管理ip冲突。"
				},
				"1290650" : {
					"cause" : "IP不合法。",
					"desc" : "IP不合法。",
					"solution" : "IP不合法。"
				},
				"1290651" : {
					"cause" : "子网掩码不合法。",
					"desc" : "子网掩码不合法。",
					"solution" : "子网掩码不合法。"
				},
				"1310002" : {
					"cause" : "该安全组中的安全规则数超过上限。",
					"desc" : "该安全组中的安全规则数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310003" : {
					"cause" : "安全规则不存在。",
					"desc" : "安全规则不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310021" : {
					"cause" : "网卡不属于当前虚拟机。",
					"desc" : "网卡不属于当前虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310022" : {
					"cause" : "虚拟机状态不允许此操作。",
					"desc" : "虚拟机状态不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310023" : {
					"cause" : "网卡不属于安全组所在的VPC内。",
					"desc" : "网卡不属于安全组所在的VPC内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310024" : {
					"cause" : "网卡所属的网络类型不允许网卡加入安全组。",
					"desc" : "网卡所属的网络类型不允许网卡加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310025" : {
					"cause" : "待添加成员已经加入安全组，不允许再加入其他安全组。",
					"desc" : "待添加成员已经加入安全组，不允许再加入其他安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310026" : {
					"cause" : "待加入安全组的成员列表中有重复成员。",
					"desc" : "待加入安全组的成员列表中有重复成员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310027" : {
					"cause" : "待退出安全组的成员不存在。",
					"desc" : "待退出安全组的成员不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310028" : {
					"cause" : "默认安全组下没有规则。",
					"desc" : "默认安全组下没有规则。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310029" : {
					"cause" : "网卡不属于FusionComputer，不能进行安全组操作。",
					"desc" : "网卡不属于FusionComputer，不能进行安全组操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310030" : {
					"cause" : "安全组审计中，无法进行操作。",
					"desc" : "安全组审计中，无法进行操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310031" : {
					"cause" : "网卡正在加入安全组。",
					"desc" : "网卡正在加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310032" : {
					"cause" : "网卡正在退出安全组。",
					"desc" : "网卡正在退出安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310033" : {
					"cause" : "安全组中的成员数超过上限。",
					"desc" : "安全组中的成员数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310034" : {
					"cause" : "网卡类型不适合加入安全组。",
					"desc" : "网卡类型不适合加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310050" : {
					"cause" : "当前VPC下有同名的安全组。",
					"desc" : "当前VPC下有同名的安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310051" : {
					"cause" : "当前VPC下的安全组总数超过上限。",
					"desc" : "当前VPC下的安全组总数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310052" : {
					"cause" : "安全组不存在。",
					"desc" : "安全组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310053" : {
					"cause" : "安全组被授权访问其他安全组。",
					"desc" : "安全组被授权访问其他安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310054" : {
					"cause" : "安全组中有成员。",
					"desc" : "安全组中有成员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310055" : {
					"cause" : "查询安全组时，请求的查询数量超限。",
					"desc" : "查询安全组时，请求的查询数量超限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310056" : {
					"cause" : "安全规则中的IpRange非法。",
					"desc" : "安全规则中的IpRange非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310057" : {
					"cause" : "安全规则中的端口号非法。",
					"desc" : "安全规则中的端口号非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310058" : {
					"cause" : "要添加的规则和安全组中的其他规则相同。",
					"desc" : "要添加的规则和安全组中的其他规则相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310059" : {
					"cause" : "被授权的安全组不存在。",
					"desc" : "被授权的安全组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310063" : {
					"cause" : "安全规则处于创建中。",
					"desc" : "安全规则处于创建中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310064" : {
					"cause" : "安全规则处于删除中。",
					"desc" : "安全规则处于删除中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310065" : {
					"cause" : "vpc下没有FusionComputer资源。",
					"desc" : "vpc下没有FusionComputer资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310066" : {
					"cause" : "安全组名称非法。",
					"desc" : "安全组名称非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310067" : {
					"cause" : "删除失败，请先将虚拟机网卡退出安全组再删除。",
					"desc" : "删除失败，请先将虚拟机网卡退出安全组再删除。",
					"solution" : "请先将虚拟机网卡退出安全组再删除。"
				},
				"1310074" : {
					"cause" : "安全组不属于指定VPC。",
					"desc" : "安全组不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310075": {
					"cause":"虚拟机属于共享VPC或者不在当前VDC内，不支持配置浮动IP地址。",
					"desc":"虚拟机属于共享VPC或者不在当前VDC内，不支持配置浮动IP地址。",
					"solution":"虚拟机属于共享VPC或者不在当前VDC内，不支持配置浮动IP地址。"
				},
				"1310076" : {
					"cause" : "一个网卡最多只能配置一个浮动IP。",
					"desc" : "一个网卡最多只能配置一个浮动IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310077" : {
					"cause" : "最多只能删除一个浮动IP。",
					"desc" : "最多只能删除一个浮动IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310079" : {
					"cause" : "浮动IP地址不存在。",
					"desc" : "浮动IP地址不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400001" : {
					"cause" : "连接虚拟机备份管理服务器超时。",
					"desc" : "连接虚拟机备份管理服务器超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400002" : {
					"cause" : "连接虚拟机备份管理服务器失败：用户名或密码不正确，或者用户账户被锁定。",
					"desc" : "连接虚拟机备份管理服务器失败：用户名或密码不正确，或者用户账户被锁定。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400003" : {
					"cause" : "未配置虚拟机备份管理服务器。",
					"desc" : "未配置虚拟机备份管理服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400004" : {
					"cause" : "连接虚拟机备份管理服务器失败。",
					"desc" : "连接虚拟机备份管理服务器失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400005" : {
					"cause" : "连接虚拟机备份管理服务器失败：服务端不响应。",
					"desc" : "连接虚拟机备份管理服务器失败：服务端不响应。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400006" : {
					"cause" : "虚拟机备份管理服务器不存在该记录。",
					"desc" : "虚拟机备份管理服务器不存在该记录。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400007" : {
					"cause" : "执行备份任务失败。",
					"desc" : "执行备份任务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400008" : {
					"cause" : "执行恢复任务失败。",
					"desc" : "执行恢复任务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400009" : {
					"cause" : "查询任务失败：任务不属于该任务类型。",
					"desc" : "查询任务失败：任务不属于该任务类型。",
					"solution" : "请选择合适的任务。"
				},
				"1400010" : {
					"cause" : "许可文件过期或未授权给该用户。",
					"desc" : "许可文件过期或未授权给该用户。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400011" : {
					"cause" : "指定的任务不存在。",
					"desc" : "指定的任务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1400181" : {
					"cause" : "查询任务失败：任务不属于该虚拟机。",
					"desc" : "查询任务失败：任务不属于该虚拟机。",
					"solution" : "请选择合适的任务或者虚拟机。"
				},
				"1400182" : {
					"cause" : "虚拟机备份管理服务器不存在指定类型的存储。",
					"desc" : "虚拟机备份管理服务器不存在指定类型的存储。",
					"solution" : "请选择合适的存储类型。"
				},
				"1400183" : {
					"cause" : "虚拟机备份管理服务器不存在指定虚拟机的虚拟化环境。",
					"desc" : "虚拟机备份管理服务器不存在指定虚拟机的虚拟化环境。",
					"solution" : "请选择合适的虚拟机。"
				},
				"1400184" : {
					"cause" : "查询任务失败：任务不属于备份或者恢复任务。",
					"desc" : "查询任务失败：任务不属于备份或者恢复任务。",
					"solution" : "请选择合适的任务。"
				},
				"1400191" : {
					"cause" : "备份策略不属于该虚拟机。",
					"desc" : "备份策略不属于该虚拟机。",
					"solution" : "请检查后重试。"
				},
				"1400193" : {
					"cause" : "虚拟机存在备份集，不能删除。",
					"desc" : "虚拟机存在备份集，不能删除。",
					"solution" : "删除虚拟机前请先删除备份集。"
				},
				"1400194" : {
					"cause" : "虚拟机存在备份策略，不能删除。",
					"desc" : "虚拟机存在备份策略，不能删除。",
					"solution" : "删除虚拟机前请先删除备份策略。"
				},
				"1400195" : {
					"cause" : "无可用的备份服务器。",
					"desc" : "无可用的备份服务器。",
					"solution" : "请检查后重试。"
				},
				"1400196" : {
					"cause" : "该虚拟机为VSA虚拟机，无法删除。",
					"desc" : "该虚拟机为VSA虚拟机，无法删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410000" : {
					"cause" : "null",
					"desc" : "null",
					"solution" : "请配置CS云备份服务器。"
				},
				"1410001" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410002" : {
					"cause" : "datastore不存在。",
					"desc" : "datastore不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1410003" : {
					"cause" : "卷被冻结。",
					"desc" : "卷被冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1410004" : {
					"cause" : "卷状态不是冻结状态。",
					"desc" : "卷状态不是冻结状态。",
					"solution" : "请联系系统管理员。"
				},
				"1410005" : {
					"cause" : "未挂载的卷不允许卸载。",
					"desc" : "未挂载的卷不允许卸载。",
					"solution" : "请联系系统管理员。"
				},
				"1410006" : {
					"cause" : "计量配置路径创建失败。",
					"desc" : "计量配置路径创建失败。",
					"solution" : "请联系系统管理员。"
				},
				"1410007" : {
					"cause" : "该卷没有挂载到指定的虚拟机无法执行卸载卷操作。",
					"desc" : "该卷没有挂载到指定的虚拟机无法执行卸载卷操作。",
					"solution" : "请联系系统管理员。"
				},
				"1410008" : {
					"cause" : "卷状态为非创建状态不能被删除。",
					"desc" : "卷状态为非创建状态不能被删除。",
					"solution" : "请联系系统管理员。"
				},
				"1410009" : {
					"cause" : "卷所在的集群与虚拟机所在的集群不一致。",
					"desc" : "卷所在的集群与虚拟机所在的集群不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1410010" : {
					"cause" : "卷所在的虚拟化环境类型和虚拟机不一致。",
					"desc" : "卷所在的虚拟化环境类型和虚拟机不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1410011" : {
					"cause" : "集群下找不到满足条件的存储介质为“SAN-SATA”类型的数据存储，无法执行该操作。",
					"desc" : "集群下找不到满足条件的存储介质为“SAN-SATA”类型的数据存储，无法执行该操作。",
					"solution" : "请联系系统管理员。"
				},
				"1410012" : {
					"cause" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足。",
					"solution" : "请联系系统管理员。"
				},
				"1410013" : {
					"cause" : "集群下找不到满足条件的存储介质为“SAN-SSD”类型的数据存储，无法执行该操作。",
					"desc" : "集群下找不到满足条件的存储介质为“SAN-SSD”类型的数据存储，无法执行该操作。",
					"solution" : "请联系系统管理员。"
				},
				"1410014" : {
					"cause" : "集群下找不到满足条件的存储介质为“SAN-SAS&FC”类型的数据存储，无法执行该操作。",
					"desc" : "集群下找不到满足条件的存储介质为“SAN-SAS&FC”类型的数据存储，无法执行该操作。",
					"solution" : "请联系系统管理员。"
				},
				"1410015" : {
					"cause" : "可能的原因：1、集群下存储或CPU资源不足；2、集群下无满足磁盘存储条件的存储；3、创建虚拟机选择的模板虚拟机不可用。",
					"desc" : "可能的原因：1、集群下存储或CPU资源不足；2、集群下无满足磁盘存储条件的存储；3、创建虚拟机选择的模板虚拟机不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410016" : {
					"cause" : "卷正在被虚拟机使用。",
					"desc" : "卷正在被虚拟机使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410017" : {
					"cause" : "不允许对该主机执行该类操作，否则会导致与虚拟化环境断连。",
					"desc" : "不允许对该主机执行该类操作，否则会导致与虚拟化环境断连。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410018" : {
					"cause" : "指定的存储资源不足或者无法使虚拟机正常启动。",
					"desc" : "指定的存储资源不足或者无法使虚拟机正常启动。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410019" : {
					"cause" : "集群下容灾存储资源不足或者无法找到满足虚拟机能够正常启动的容灾存储。",
					"desc" : "集群下容灾存储资源不足或者无法找到满足虚拟机能够正常启动的容灾存储。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410020" : {
					"cause" : "指定主机下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"desc" : "指定主机下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410021" : {
					"cause" : "挂载块存储失败，虚拟机所在的vpc和块存储所在的vpc不是同一个。",
					"desc" : "挂载块存储失败，虚拟机所在的vpc和块存储所在的vpc不是同一个。",
					"solution" : "请检查虚拟机与块存储。"
				},
				"1410022" : {
					"cause" : "NAS存储普通磁盘不支持在线扩容。",
					"desc" : "NAS存储普通磁盘不支持在线扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410023" : {
					"cause" : "指定的卷未挂载到当前虚拟机。",
					"desc" : "指定的卷未挂载到当前虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1410024" : {
					"cause" : "源卷不是当前虚拟机的系统盘。",
					"desc" : "源卷不是当前虚拟机的系统盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1420000" : {
					"cause" : "未配置CS云备份服务器。",
					"desc" : "未配置CS云备份服务器。",
					"solution" : "null"
				},
				"1420001" : {
					"cause" : "连接CommVault服务器失败。",
					"desc" : "连接CommVault服务器失败。",
					"solution" : "null"
				},
				"1420002" : {
					"cause" : "CommVault服务器名无效。",
					"desc" : "CommVault服务器名无效。",
					"solution" : "请输入正确的计算机名。"
				},
				"1420003" : {
					"cause" : "用户名和密码不匹配。",
					"desc" : "用户名和密码不匹配。",
					"solution" : "请输入正确的用户名和密码。"
				},
				"1420004" : {
					"cause" : "CommVault客户端未安装。",
					"desc" : "CommVault客户端未安装。",
					"solution" : "请在FM上安装CommVault客户端。"
				},
				"1502003" : {
					"cause" : "参数vxlan输入不合法，应为4096-16777215。",
					"desc" : "参数vxlan输入不合法，应为4096-16777215。",
					"solution" : "请输入正确的vxlan信息。"
				},
				"1502004" : {
					"cause" : "vxlan池的起始vxlan必须小于等于结束vxlan。",
					"desc" : "vxlan池的起始vxlan必须小于等于结束vxlan。",
					"solution" : "输入正确的vxlan信息。"
				},
				"1502005" : {
					"cause" : "vxlan池间不能重叠。",
					"desc" : "vxlan池间不能重叠。",
					"solution" : "输入正确的vxlan信息。"
				},
				"1502006" : {
					"cause" : "vtep信息不完整。",
					"desc" : "vtep信息不完整。",
					"solution" : "输入完整的vtep信息。"
				},
				"1502007" : {
					"cause" : "vtep ip不正确。",
					"desc" : "vtep ip不正确。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502008" : {
					"cause" : "vtep mask必须介于0-32之间。",
					"desc" : "vtep mask必须介于0-32之间。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502009" : {
					"cause" : "vtep gw不正确。",
					"desc" : "vtep gw不正确。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502010" : {
					"cause" : "vtep vlan必须介于0-4094之间。",
					"desc" : "vtep vlan必须介于0-4094之间。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502043" : {
					"cause" : "该存储类型不支持迁移。",
					"desc" : "该存储类型不支持迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"1502044" : {
					"cause" : "共享磁盘不能为厚置备延迟置零磁盘。",
					"desc" : "共享磁盘不能为厚置备延迟置零磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"1510001" : {
					"cause" : "任务取消失败。",
					"desc" : "任务取消失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1510002" : {
					"cause" : "任务状态已变化。",
					"desc" : "任务状态已变化。",
					"solution" : "请联系技术支持工程师。"
				},
				"1510003" : {
					"cause" : "任务不存在。",
					"desc" : "任务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1510006" : {
					"cause" : "任务类型不支持取消。",
					"desc" : "任务类型不支持取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600001" : {
					"cause" : "可用分区删除失败，存在已经关联的资源。",
					"desc" : "可用分区删除失败，存在已经关联的资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600002" : {
					"cause" : "可用分区不存在。",
					"desc" : "可用分区不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600003" : {
					"cause" : "可用分区去关联失败，待去关联的资源不存在。",
					"desc" : "可用分区去关联失败，待去关联的资源不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600004" : {
					"cause" : "资源类型无法识别。",
					"desc" : "资源类型无法识别。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600005" : {
					"cause" : "可用分区去关联失败，待去关联的资源不属于该可用分区。",
					"desc" : "可用分区去关联失败，待去关联的资源不属于该可用分区。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600006" : {
					"cause" : "可用分区创建失败，名称重复。",
					"desc" : "可用分区创建失败，名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600007" : {
					"cause" : "资源分区去关联集群失败，该集群已经与可用分区关联。",
					"desc" : "资源分区去关联集群失败，该集群已经与可用分区关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600008" : {
					"cause" : "可用分区关联失败，待关联的资源已经与可用分区关联。",
					"desc" : "可用分区关联失败，待关联的资源已经与可用分区关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600009" : {
					"cause" : "可用分区关联失败，可用分区下的集群不能跨虚拟化环境。",
					"desc" : "可用分区关联失败，可用分区下的集群不能跨虚拟化环境。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600010" : {
					"cause" : "可用分区下未关联任何集群。",
					"desc" : "可用分区下未关联任何集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600011" : {
					"cause" : "可用分区创建失败，数量已达最大值。",
					"desc" : "可用分区创建失败，数量已达最大值。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600012" : {
					"cause" : "可用分区下存在资源，去关联集群失败。",
					"desc" : "可用分区下存在资源，去关联集群失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600013" : {
					"cause" : "可用分区关联集群失败，集群未关联资源分区。",
					"desc" : "可用分区关联集群失败，集群未关联资源分区。",
					"solution" : "请联系技术支持工程师。"
				},
				"1600014" : {
					"cause" : "可用分区关联集群失败，可用分区下的集群需要有共同的存储.",
					"desc" : "可用分区关联集群失败，可用分区下的集群需要有共同的存储.",
					"solution" : "请联系技术支持工程师。"
				},
				"1600015" : {
					"cause" : "可用分区关联集群失败，可用分区下的集群需要有共同的DVS.",
					"desc" : "可用分区关联集群失败，可用分区下的集群需要有共同的DVS.",
					"solution" : "请联系技术支持工程师。"
				},
				"1600016" : {
					"cause" : "资源不属于该可用分区.",
					"desc" : "资源不属于该可用分区.",
					"solution" : "请联系技术支持工程师。"
				},
				"1700001" : {
					"cause" : "删除标签失败，待删除的标签与资源已经关联。",
					"desc" : "删除标签失败，待删除的标签与资源已经关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1700011" : {
					"cause" : "调度失败，没有找到满足标签属性的资源集群。",
					"desc" : "调度失败，没有找到满足标签属性的资源集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"1700012" : {
					"cause" : "调度失败，可用分区下没有可用的集群。",
					"desc" : "调度失败，可用分区下没有可用的集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"7000000" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"7000001" : {
					"cause" : "选中的资源集群已不存在。",
					"desc" : "选中的资源集群已不存在。",
					"solution" : "选中的资源集群已不存在。"
				},
				"7000002" : {
					"cause" : "当前状态不能执行关联操作，请刷新页面重试。",
					"desc" : "当前状态不能执行关联操作，请刷新页面重试。",
					"solution" : "请刷新页面重试。"
				},
				"7000003" : {
					"cause" : "当前状态不能执行去关联操作，请刷新页面重试。",
					"desc" : "当前状态不能执行去关联操作，请刷新页面重试。",
					"solution" : "请刷新页面重试。"
				},
				"7409000" : {
					"cause" : "手动备份系统内部异常.",
					"desc" : "手动备份系统内部异常.",
					"solution" : "请联系技术支持工程师。"
				},
                "1310083": {
	                "cause":"当前版本的FusionCompute不支持IPv6。",
	                "desc":"当前版本的FusionCompute不支持IPv6。",
	                "solution":"请联系技术支持工程师。"
	            },
                "1166029": {
	                "cause":"当前版本的软件路由器不支持ACL。",
	                "desc":"当前版本的软件路由器不支持ACL。",
	                "solution":"请联系技术支持工程师。"
	            },
                "1184062": {
	                "cause":"当前版本的软件路由器不支持VPN。",
	                "desc":"当前版本的软件路由器不支持VPN。",
	                "solution":"请联系技术支持工程师。"
	            },
                "1080156": {
	                "cause":"子网可用IP段与DHCP服务器IP或网关冲突。",
	                "desc":"子网可用IP段与DHCP服务器IP或网关冲突。",
	                "solution":"请填写合法的子网信息。"
	            },
                "1080157": {
	                "cause":"安全虚拟机资源不足,启动失败，请检查主机是否开启防病毒开关以及主机防病毒设置。",
	                "desc":"安全虚拟机资源不足，启动失败，请检查主机是否开启防病毒开关以及主机防病毒设置。",
	                "solution":"请检查主机是否开启防病毒开关以及主机防病毒设置。"
	            },
                "1080158": {
                    "cause":"安全服务虚拟机或安全用户虚拟机启动，预留内存必须是100%。",
                    "desc":"安全服务虚拟机或安全用户虚拟机启动，预留内存必须是100%。",
                    "solution":"请联系技术支持工程师。"
                },
                "1080159": {
                    "cause":"安全服务虚拟机不允许该操作。",
                    "desc":"安全服务虚拟机不允许该操作。",
                    "solution":"请联系技术支持工程师。"
                },
                "1080160": {
                    "cause":"主机的安全用户虚拟机个数已达上限或者主机安全开关未打开。",
                    "desc":"主机的安全用户虚拟机个数已达上限或者主机安全开关未打开。",
                    "solution":"请联系技术支持工程师。"
                },
                "1040173": {
	                "cause":"待校验的子网IP段与系统的DHCP服务子网IP段冲突。",
	                "desc":"待校验的子网IP段与系统的DHCP服务子网IP段冲突。",
	                "solution":"请填写合法的子网信息。"
	            },
	            "1070257":{
	                "cause":"解析excel文件失败。",
	                "desc":"解析excel文件失败。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "1070258":{
	            	"cause":"适配包已安装。",
	                "desc":"适配包已安装。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "1070259":{
	            	"cause":"删除FusionStorage失败。",
	                "desc":"删除FusionStorage失败。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "1002599":{
	            	"cause":"当前虚拟机没有纳管，不支持跨集群在线克隆虚拟机。",
	                "desc":"当前虚拟机没有纳管，不支持跨集群在线克隆虚拟机。",
	                "solution":"请将当前虚拟机纳管。"
	            },
	            "1002559":{
	            	"cause":"虚拟机包含有共享磁盘,不能将虚拟机分配。",
	                "desc":"虚拟机包含有共享磁盘,不能将虚拟机分配。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "1070175":{
	            	"cause":"链接克隆虚拟机不允许导出。",
	            	"desc":"链接克隆虚拟机不允许导出。",
	            	"solution":"请联系技术支持工程师。"
	            },
	            "1075075":{
	            	"cause":"此配置不支持自定义客户机操作系统“windows7Server64Guest”,请参见 vCenter 文档。",
	            	"desc":"此配置不支持自定义客户机操作系统“windows7Server64Guest”,请参见 vCenter 文档。",
	            	"solution":"请联系技术支持工程师。"
	            },
	            "100100006":{
	            	"cause":"模板文件和系统不匹配。",
	            	"desc":"模板文件和系统不匹配。",
	            	"solution":"请确认模板文件和系统是否匹配。"
	            },            
				"1162660": {
	                "cause":"对端网络不通。",
	                "desc":"对端网络不通。",
	                "solution":"请联系技术支持工程师。"
	            },
				"1162661": {
	                "cause":"密码错误。",
	                "desc":"密码错误。",
	                "solution":"请联系技术支持工程师。"
	            },
				"1162662": {
	                "cause":"禁止主备倒换失败。",
	                "desc":"禁止主备倒换失败。",
	                "solution":"请联系技术支持工程师。"
	            }
                
			};
			return exceptionMap;
		})