define([], function() {
			var exceptionMap = {
				"-1" : {
					"cause" : "函数内部错误.",
					"desc" : "函数内部错误.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0" : {
					"cause" : "成功.",
					"desc" : "成功.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0000000001" : {
					"cause" : "内部错误.",
					"desc" : "内部错误.",
					"solution" : "请联系系统管理员."
				},
				"0000010001" : {
					"cause" : "内部错误.",
					"desc" : "内部错误.",
					"solution" : "请联系系统管理员."
				},
				"0000010002" : {
					"cause" : "参数非法.",
					"desc" : "参数非法.",
					"solution" : "请修改输入参数."
				},
				"0000010003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系系统管理员，或查阅指导手册。"
				},
				"0000010004" : {
					"cause" : "无权限.",
					"desc" : "无权限.",
					"solution" : "请联系系统管理员."
				},
				"0000010005" : {
					"cause" : "对象不存在。",
					"desc" : "对象不存在。",
					"solution" : "对象不存在。"
				},
				"0000020000" : {
					"cause" : "数据库异常.",
					"desc" : "数据库异常.",
					"solution" : "请联系系统管理员."
				},
				            "0000030004": {
                "cause":"用户名或密码不正确。",
                "desc":"用户名或密码不正确。",
                "solution":"请输入正确的用户名和密码。"
            },
            "0000010007": {
                "cause":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                "desc":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                "solution":"请检查虚拟化环境接入信息是否输入正确。"
            },
				"0005001001" : {
					"cause" : "资源池名字已经存在.",
					"desc" : "资源池名字已经存在.",
					"solution" : "请尝试别的名字."
				},
				"0005001002" : {
					"cause" : "资源池IP地址已经存在.",
					"desc" : "资源池IP地址已经存在.",
					"solution" : "请尝试别的IP地址."
				},
				"0005001003" : {
					"cause" : "资源池地域已经存在.",
					"desc" : "资源池地域已经存在.",
					"solution" : "请尝试别的地域."
				},
				"0005001004" : {
					"cause" : "云资源池不存在或者状态不正常.",
					"desc" : "云资源池不存在或者状态不正常.",
					"solution" : "请检查云资源池状态."
				},
				"0005001005" : {
					"cause" : "云资源池正在更新.",
					"desc" : "云资源池正在更新.",
					"solution" : "请稍候再尝试."
				},
				"0005001006" : {
					"cause" : "查询失败，请检查云资源池连接状态.",
					"desc" : "查询失败，请检查云资源池连接状态.",
					"solution" : "请稍候再尝试."
				},
				"0005001102" : {
					"cause" : "资源调度失败，没有符合条件的资源池。",
					"desc" : "资源调度失败，没有符合条件的资源池。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005002100" : {
					"cause" : "删除失败，该资源已经分配给VDC使用。",
					"desc" : "删除失败，该资源已经分配给VDC使用。",
					"solution" : "请联系系统管理员。"
				},
				"0005002101" : {
					"cause" : "资源调度失败，没有符合条件的可用分区。",
					"desc" : "资源调度失败，没有符合条件的可用分区。",
					"solution" : "请联系系统管理员。"
				},
				"0005002102" : {
					"cause" : "删除失败，存在磁盘与之关联。",
					"desc" : "删除失败，存在磁盘与之关联。",
					"solution" : "请联系系统管理员。"
				},
				"0005002103" : {
					"cause" : "删除失败，存在虚拟机与之关联。",
					"desc" : "删除失败，存在虚拟机与之关联。",
					"solution" : "请联系系统管理员。"
				},
				"0005002104" : {
					"cause" : "删除失败，存在VDC与之关联。",
					"desc" : "删除失败，存在VDC与之关联。",
					"solution" : "请联系系统管理员。"
				},
				"0005003001" : {
					"cause" : "任务执行超时。",
					"desc" : "任务执行超时。",
					"solution" : "请联系系统管理员。"
				},
				"0005003002" : {
					"cause" : "查询资源池类型失败。",
					"desc" : "查询资源池类型失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005003003" : {
					"cause" : "修改服务实例失败。",
					"desc" : "修改服务实例失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005003004" : {
					"cause" : "删除服务实例失败。",
					"desc" : "删除服务实例失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005003005" : {
					"cause" : "修改配额失败。",
					"desc" : "修改配额失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005003006" : {
					"cause" : "创建服务实例失败。",
					"desc" : "创建服务实例失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005005101" : {
					"cause" : "删除标签失败，存在资源正在使用。",
					"desc" : "删除标签失败，存在资源正在使用。",
					"solution" : "请去关联该标签后，再尝试删除。"
				},
				"0005005102" : {
					"cause" : "修改标签失败，修改的标签已经存在。",
					"desc" : "修改标签失败，修改的标签已经存在。",
					"solution" : "请勿修改为已经存在的标签。"
				},
				"0005005103" : {
					"cause" : "关联标签失败，待关联的资源状态不可用。",
					"desc" : "关联标签失败，待关联的资源状态不可用。",
					"solution" : "请联系华为技术支持。"
				},
				"0005005105" : {
					"cause" : "关联标签失败，标签不存在。",
					"desc" : "关联标签失败，标签不存在。",
					"solution" : "请选择存在的标签。"
				},
				"0005010001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010002" : {
					"cause" : "数据库连接异常。",
					"desc" : "数据库连接异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010008" : {
					"cause" : "没有该操作的权限。",
					"desc" : "没有该操作的权限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010009" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010010" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请检查输入信息是否正确。"
				},
				"0005010011" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010012" : {
					"cause" : "系统与UHM断连，正在重试，请稍候。",
					"desc" : "系统与UHM断连，正在重试，请稍候。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010013" : {
					"cause" : "系统与VRM断连，正在重试，请稍候。",
					"desc" : "系统与VRM断连，正在重试，请稍候。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010014" : {
					"cause" : "系统与数据库断连，正在重试，请稍候。",
					"desc" : "系统与数据库断连，正在重试，请稍候。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010015" : {
					"cause" : "请求的资源总数已经超过资源配额上限。",
					"desc" : "请求的资源总数已经超过资源配额上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010016" : {
					"cause" : "参数内容超出长度限制。",
					"desc" : "参数内容超出长度限制。",
					"solution" : "请检查浏览器的JavaScript是否打开或请联系技术支持工程师。"
				},
				"0005010017" : {
					"cause" : "用户名或者密码有误，请检查。",
					"desc" : "用户名或者密码有误，请检查。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010018" : {
					"cause" : "VRM版本号错误。",
					"desc" : "VRM版本号错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010019" : {
					"cause" : "操作超时。",
					"desc" : "操作超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010020" : {
					"cause" : "Vmware内部错误，查询任务失败原因失败。",
					"desc" : "Vmware内部错误，查询任务失败原因失败。",
					"solution" : "请登录vsphere， 确认相关操作是否执行成功。"
				},
				"0005010021" : {
					"cause" : "虚拟化环境[{0}]连接状态不为成功。",
					"desc" : "虚拟化环境[{0}]连接状态不为成功。",
					"solution" : "待虚拟化环境连接状态成功后重试。"
				},
				"0005010022" : {
					"cause" : "虚拟化环境[{0}]设置语言不合法。",
					"desc" : "虚拟化环境[{0}]设置语言不合法。",
					"solution" : "请选择合适的语言进行设置。"
				},
				"0005010023" : {
					"cause" : "虚拟化环境[{0}]设置语言失败。",
					"desc" : "虚拟化环境[{0}]设置语言失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010024" : {
					"cause" : "虚拟化环境[{0}]通讯异常。",
					"desc" : "虚拟化环境[{0}]通讯异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010025" : {
					"cause" : "用户名或密码错误。",
					"desc" : "用户名或密码错误。",
					"solution" : "请修改用户名或密码。"
				},
				"0005010026" : {
					"cause" : "密码三次输入错误，帐户锁定5分钟。",
					"desc" : "密码三次输入错误，帐户锁定5分钟。",
					"solution" : "请等待5分钟再重试。"
				},
				"0005010027" : {
					"cause" : "帐户锁定中,再次登陆系统请等待5分钟。",
					"desc" : "帐户锁定中,再次登陆系统请等待5分钟。",
					"solution" : "请等待5分钟。"
				},
				"0005010028" : {
					"cause" : "用户不存在。",
					"desc" : "用户不存在。",
					"solution" : "请修改用户名。"
				},
				"0005010029" : {
					"cause" : "修改管理子网正在进行，请稍后重试。",
					"desc" : "修改管理子网正在进行，请稍后重试。",
					"solution" : "修改管理子网过快，请检查网络是否修改完成才可再次修改。"
				},
				"0005010030" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010031" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010032" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010033" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010034" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010035" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010036" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010037" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010038" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010039" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010040" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010041" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010042" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010043" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010044" : {
					"cause" : "操作对象不存在。",
					"desc" : "操作对象不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010045" : {
					"cause" : "无效的子网掩码。",
					"desc" : "无效的子网掩码。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010046" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010047" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010048" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010049" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010050" : {
					"cause" : "系统正在恢复中，请稍后重试。",
					"desc" : "系统正在恢复中，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010051" : {
					"cause" : "系统繁忙，请稍后重试。",
					"desc" : "系统繁忙，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010052" : {
					"cause" : "系统繁忙，请稍后重试。",
					"desc" : "系统繁忙，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010053" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010054" : {
					"cause" : "系统中该对象的状态冲突。",
					"desc" : "系统中该对象的状态冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010055" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010056" : {
					"cause" : "参数不合法。",
					"desc" : "参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010057" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010058" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010059" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010060" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010061" : {
					"cause" : "任务不存在。",
					"desc" : "任务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010062" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请检查虚拟机是否存在再操作。"
				},
				"0005010063" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010064" : {
					"cause" : "系统中该对象的状态冲突。",
					"desc" : "系统中该对象的状态冲突。",
					"solution" : "请检查对象状态或稍后重试。"
				},
				"0005010065" : {
					"cause" : "入参不合法。",
					"desc" : "入参不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010066" : {
					"cause" : "入参名称不合法。",
					"desc" : "入参名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010067" : {
					"cause" : "上限值的取值范围是1～100。",
					"desc" : "上限值的取值范围是1～100。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010068" : {
					"cause" : "“描述”参数不合法。",
					"desc" : "“描述”参数不合法。",
					"solution" : "“描述”参数不合法，请重新输入。"
				},
				"0005010069" : {
					"cause" : "入参不合法。",
					"desc" : "入参不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010070" : {
					"cause" : "“偏移”参数不合法。",
					"desc" : "“偏移”参数不合法。",
					"solution" : "“偏移”参数不合法，请重新输入。"
				},
				"0005010071" : {
					"cause" : "端口的取值范围是1～65535间的整数。",
					"desc" : "端口的取值范围是1～65535间的整数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010072" : {
					"cause" : "用户手机号码格式错误。",
					"desc" : "用户手机号码格式错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010073" : {
					"cause" : "用户Email格式错误。",
					"desc" : "用户Email格式错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010074" : {
					"cause" : "用户名已经存在。",
					"desc" : "用户名已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010075" : {
					"cause" : "用户选择角色不存在。",
					"desc" : "用户选择角色不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010076" : {
					"cause" : "修改用户失败。",
					"desc" : "修改用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010077" : {
					"cause" : "用户名长度错误。",
					"desc" : "用户名长度错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010078" : {
					"cause" : "用户名字符错误。",
					"desc" : "用户名字符错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010079" : {
					"cause" : "添加用户失败。",
					"desc" : "添加用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010080" : {
					"cause" : "不可删除当前用户本身。",
					"desc" : "不可删除当前用户本身。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010081" : {
					"cause" : "默认超级管理员不可被删除。",
					"desc" : "默认超级管理员不可被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010082" : {
					"cause" : "删除用户失败。",
					"desc" : "删除用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010083" : {
					"cause" : "修改密码错误。",
					"desc" : "修改密码错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010084" : {
					"cause" : "禁止修改其他用户密码。",
					"desc" : "禁止修改其他用户密码。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010085" : {
					"cause" : "原始密码不正确。",
					"desc" : "原始密码不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010086" : {
					"cause" : "域用户密码不可更改。",
					"desc" : "域用户密码不可更改。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010087" : {
					"cause" : "未到允许修改密码的时间。",
					"desc" : "未到允许修改密码的时间。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010088" : {
					"cause" : "密码已使用过。",
					"desc" : "密码已使用过。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010089" : {
					"cause" : "重置密码失败。",
					"desc" : "重置密码失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010090" : {
					"cause" : "查询用户失败。",
					"desc" : "查询用户失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010091" : {
					"cause" : "修改密码的最短时间间隔非法。",
					"desc" : "修改密码的最短时间间隔非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010092" : {
					"cause" : "密码有效期非法。",
					"desc" : "密码有效期非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010093" : {
					"cause" : "修改是否强制修改密码非法。",
					"desc" : "修改是否强制修改密码非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010094" : {
					"cause" : "密码重复使用次数非法。",
					"desc" : "密码重复使用次数非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010095" : {
					"cause" : "密码到期提前提示非法。",
					"desc" : "密码到期提前提示非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010096" : {
					"cause" : "密码已经到期。",
					"desc" : "密码已经到期。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010097" : {
					"cause" : "获取密码策略失败。",
					"desc" : "获取密码策略失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010098" : {
					"cause" : "修改密码策略失败。",
					"desc" : "修改密码策略失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010099" : {
					"cause" : "域信息的domain太长。",
					"desc" : "域信息的domain太长。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010100" : {
					"cause" : "该角色已存在。",
					"desc" : "该角色已存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010101" : {
					"cause" : "该角色不存在。",
					"desc" : "该角色不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010102" : {
					"cause" : "角色正在使用。",
					"desc" : "角色正在使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010103" : {
					"cause" : "所选权限不存在。",
					"desc" : "所选权限不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010104" : {
					"cause" : "创建角色失败。",
					"desc" : "创建角色失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010105" : {
					"cause" : "角色名非法。",
					"desc" : "角色名非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010106" : {
					"cause" : "修改角色失败。",
					"desc" : "修改角色失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010107" : {
					"cause" : "BMC用户名不合法。",
					"desc" : "BMC用户名不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010108" : {
					"cause" : "BMC密码不合法。",
					"desc" : "BMC密码不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010109" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010110" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010111" : {
					"cause" : "服务器处于维护模式，不能新增虚拟机。",
					"desc" : "服务器处于维护模式，不能新增虚拟机。",
					"solution" : "请退出维护模式再重试。"
				},
				"0005010112" : {
					"cause" : "服务器状态不能进行当前操作。",
					"desc" : "服务器状态不能进行当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010113" : {
					"cause" : "BMC用户名为空。",
					"desc" : "BMC用户名为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010114" : {
					"cause" : "BMC密码为空。",
					"desc" : "BMC密码为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010115" : {
					"cause" : "服务器已开机。",
					"desc" : "服务器已开机。",
					"solution" : "请确认服务器状态。"
				},
				"0005010116" : {
					"cause" : "服务器已关机。",
					"desc" : "服务器已关机。",
					"solution" : "请确认服务器状态。"
				},
				"0005010117" : {
					"cause" : "服务器已关机，不可重启。",
					"desc" : "服务器已关机，不可重启。",
					"solution" : "请直接启动服务器。"
				},
				"0005010118" : {
					"cause" : "服务器安全重启或安全下电的时候必须保证服务器上的虚拟机都处于关闭状态。",
					"desc" : "服务器安全重启或安全下电的时候必须保证服务器上的虚拟机都处于关闭状态。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010119" : {
					"cause" : "服务器通信异常。",
					"desc" : "服务器通信异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010120" : {
					"cause" : "虚拟机CPU数量不合法。",
					"desc" : "虚拟机CPU数量不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010121" : {
					"cause" : "CPU份额值不合法。",
					"desc" : "CPU份额值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010122" : {
					"cause" : "CPU上限值不合法。",
					"desc" : "CPU上限值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010123" : {
					"cause" : "虚拟机内存大小不合法。",
					"desc" : "虚拟机内存大小不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010124" : {
					"cause" : "虚拟机内存份额值不合法。",
					"desc" : "虚拟机内存份额值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010125" : {
					"cause" : "硬盘编号不合法。",
					"desc" : "硬盘编号不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010126" : {
					"cause" : "虚拟机硬盘大小不合法。",
					"desc" : "虚拟机硬盘大小不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010127" : {
					"cause" : "虚拟机硬盘超过最大数量。",
					"desc" : "虚拟机硬盘超过最大数量。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010128" : {
					"cause" : "虚拟机网卡端口组为空。",
					"desc" : "虚拟机网卡端口组为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010129" : {
					"cause" : "虚拟机网卡数量超过最大限制。",
					"desc" : "虚拟机网卡数量超过最大限制。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010130" : {
					"cause" : "虚拟机启动配置不合法。",
					"desc" : "虚拟机启动配置不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010131" : {
					"cause" : "虚拟机故障处理策略不合法。",
					"desc" : "虚拟机故障处理策略不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010132" : {
					"cause" : "源服务器和目的服务器不能相同。",
					"desc" : "源服务器和目的服务器不能相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010133" : {
					"cause" : "Tools未安装或未运行。",
					"desc" : "Tools未安装或未运行。",
					"solution" : "请先安装并启动Tools后再重试。"
				},
				"0005010134" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010135" : {
					"cause" : "服务器不存在。",
					"desc" : "服务器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010136" : {
					"cause" : "指定的资源集群不存在。",
					"desc" : "指定的资源集群不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010137" : {
					"cause" : "资源集群下存在虚拟机。",
					"desc" : "资源集群下存在虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010138" : {
					"cause" : "资源集群下存在服务器。",
					"desc" : "资源集群下存在服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010139" : {
					"cause" : "超出系统支持的资源集群数量最大限制（32个）。",
					"desc" : "超出系统支持的资源集群数量最大限制（32个）。",
					"solution" : "系统最多支持32个集群，如果新增，需要删除不再需要的集群。"
				},
				"0005010140" : {
					"cause" : "主机上存在不能自动迁移的虚拟机或者集群资源不足。",
					"desc" : "主机上存在不能自动迁移的虚拟机或者集群资源不足。",
					"solution" : "请检查后重试。"
				},
				"0005010141" : {
					"cause" : "虚拟机已挂载光驱。",
					"desc" : "虚拟机已挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010142" : {
					"cause" : "虚拟机未挂载光驱。",
					"desc" : "虚拟机未挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010143" : {
					"cause" : "共享URL不合法。",
					"desc" : "共享URL不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010144" : {
					"cause" : "磁盘未挂载到此虚拟机。",
					"desc" : "磁盘未挂载到此虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010145" : {
					"cause" : "虚拟机已挂载光驱。",
					"desc" : "虚拟机已挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010146" : {
					"cause" : "虚拟机未挂载光驱。",
					"desc" : "虚拟机未挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010147" : {
					"cause" : "虚拟机内存limit不合法。",
					"desc" : "虚拟机内存limit不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010148" : {
					"cause" : "操作系统类型不正确。",
					"desc" : "操作系统类型不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010149" : {
					"cause" : "操作系统版本不正确。",
					"desc" : "操作系统版本不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010150" : {
					"cause" : "虚拟机CPU预留值不合法。",
					"desc" : "虚拟机CPU预留值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010151" : {
					"cause" : "虚拟机内存预留值不合法。",
					"desc" : "虚拟机内存预留值不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010152" : {
					"cause" : "MAC地址重复，创建虚拟机/添加网卡失败。",
					"desc" : "MAC地址重复，创建虚拟机/添加网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010153" : {
					"cause" : "释放MAC出错，删除网卡失败。",
					"desc" : "释放MAC出错，删除网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010154" : {
					"cause" : "MAC资源不足，创建虚拟机/添加网卡失败。",
					"desc" : "MAC资源不足，创建虚拟机/添加网卡失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010155" : {
					"cause" : "虚拟机域信息长度超过1024字节。",
					"desc" : "虚拟机域信息长度超过1024字节。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010156" : {
					"cause" : "磁盘被虚拟机使用中。",
					"desc" : "磁盘被虚拟机使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010157" : {
					"cause" : "移动服务器时原资源集群和目标资源集群相同。",
					"desc" : "移动服务器时原资源集群和目标资源集群相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010158" : {
					"cause" : "MAC地址不合法。",
					"desc" : "MAC地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010159" : {
					"cause" : "共享磁盘不允许创建快照。",
					"desc" : "共享磁盘不允许创建快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010160" : {
					"cause" : "位置不能为空。",
					"desc" : "位置不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010161" : {
					"cause" : "存储标识不能为空。",
					"desc" : "存储标识不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010162" : {
					"cause" : "操作系统类型不能为空。",
					"desc" : "操作系统类型不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010163" : {
					"cause" : "快照状态不允许该操作。",
					"desc" : "快照状态不允许该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010164" : {
					"cause" : "硬盘插槽号不能重复。",
					"desc" : "硬盘插槽号不能重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010165" : {
					"cause" : "资源集群内最多只能有128个服务器。",
					"desc" : "资源集群内最多只能有128个服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010166" : {
					"cause" : "虚拟机快照不存在。",
					"desc" : "虚拟机快照不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010167" : {
					"cause" : "虚拟机快照不存在。",
					"desc" : "虚拟机快照不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010168" : {
					"cause" : "目标节点/资源集群不能满足虚拟机运行的存储条件。",
					"desc" : "目标节点/资源集群不能满足虚拟机运行的存储条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010169" : {
					"cause" : "虚拟机快照数超过限制。",
					"desc" : "虚拟机快照数超过限制。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010170" : {
					"cause" : "该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了，或磁盘状态不允许绑定虚拟机。",
					"desc" : "该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了，或磁盘状态不允许绑定虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010171" : {
					"cause" : "单个虚拟机绑定共享磁盘个数达到上限。",
					"desc" : "单个虚拟机绑定共享磁盘个数达到上限。",
					"solution" : "请尝试添加非共享磁盘。"
				},
				"0005010172" : {
					"cause" : "磁盘已经挂载到此虚拟机上，不能重复挂载。",
					"desc" : "磁盘已经挂载到此虚拟机上，不能重复挂载。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010173" : {
					"cause" : "休眠态虚拟机必须创建内存快照，请勾选内存快照后重试。",
					"desc" : "休眠态虚拟机必须创建内存快照，请勾选内存快照后重试。",
					"solution" : "请勾选内存快照后重试。"
				},
				"0005010174" : {
					"cause" : "端口组长度不合法。",
					"desc" : "端口组长度不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010175" : {
					"cause" : "需要挂载的磁盘不存在。",
					"desc" : "需要挂载的磁盘不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010176" : {
					"cause" : "将虚拟机克隆为模板虚拟机时，不能有磁盘存在。",
					"desc" : "将虚拟机克隆为模板虚拟机时，不能有磁盘存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010177" : {
					"cause" : "资源集群下存在处于“启动中”、“迁移中”等暂态的虚拟机。",
					"desc" : "资源集群下存在处于“启动中”、“迁移中”等暂态的虚拟机。",
					"solution" : "请确认资源集群下所有虚拟机的状态再重试。"
				},
				"0005010178" : {
					"cause" : "集群下存在使用iNIC网卡的主机，不能开启集群内存复用开关。",
					"desc" : "集群下存在使用iNIC网卡的主机，不能开启集群内存复用开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010179" : {
					"cause" : "资源集群下存在虚拟机内存预留值小于内存规格的虚拟机。",
					"desc" : "资源集群下存在虚拟机内存预留值小于内存规格的虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010180" : {
					"cause" : "指定位置下不存在存储条件满足虚拟机启动的节点。",
					"desc" : "指定位置下不存在存储条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010181" : {
					"cause" : "修改资源集群数据库失败。",
					"desc" : "修改资源集群数据库失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010182" : {
					"cause" : "资源集群内存复用开关为开所以迁移服务器失败。",
					"desc" : "资源集群内存复用开关为开所以迁移服务器失败。",
					"solution" : "请资源集群内存复用开关再重试。"
				},
				"0005010183" : {
					"cause" : "目的节点状态不支持迁移。",
					"desc" : "目的节点状态不支持迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010184" : {
					"cause" : "源节点或目的节点已经超过迁移并发数。",
					"desc" : "源节点或目的节点已经超过迁移并发数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010185" : {
					"cause" : "资源集群内迁移中的虚拟机数量最大个数是40个。",
					"desc" : "资源集群内迁移中的虚拟机数量最大个数是40个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010186" : {
					"cause" : "输入参数非法。",
					"desc" : "输入参数非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010187" : {
					"cause" : "指定虚拟机不是链接克隆虚拟机。",
					"desc" : "指定虚拟机不是链接克隆虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010188" : {
					"cause" : "系统正在连接指定存储资源。",
					"desc" : "系统正在连接指定存储资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010189" : {
					"cause" : "存储类型错误。",
					"desc" : "存储类型错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010190" : {
					"cause" : "存储资源不足。",
					"desc" : "存储资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010191" : {
					"cause" : "存储不存在。",
					"desc" : "存储不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010192" : {
					"cause" : "存储器不存在。",
					"desc" : "存储器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010193" : {
					"cause" : "查询条件错误。",
					"desc" : "查询条件错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010194" : {
					"cause" : "存储设备错误。",
					"desc" : "存储设备错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010195" : {
					"cause" : "存储资源已经存在。",
					"desc" : "存储资源已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010196" : {
					"cause" : "存储资源不存在。",
					"desc" : "存储资源不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010197" : {
					"cause" : "存储资源正在使用中。",
					"desc" : "存储资源正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010198" : {
					"cause" : "没有发现存储器。",
					"desc" : "没有发现存储器。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010199" : {
					"cause" : "存储正在使用中。",
					"desc" : "存储正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010200" : {
					"cause" : "存储资源名称重复。",
					"desc" : "存储资源名称重复。",
					"solution" : "请修改存储资源名称再重试。"
				},
				"0005010201" : {
					"cause" : "磁盘类型错误。",
					"desc" : "磁盘类型错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010202" : {
					"cause" : "磁盘不存在或者当前磁盘已被删除。",
					"desc" : "磁盘不存在或者当前磁盘已被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010203" : {
					"cause" : "磁盘状态不为使用中。",
					"desc" : "磁盘状态不为使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010204" : {
					"cause" : "磁盘大小非法。",
					"desc" : "磁盘大小非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010205" : {
					"cause" : "批量查询磁盘个数错误。",
					"desc" : "批量查询磁盘个数错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010206" : {
					"cause" : "磁盘正在被挂载中。",
					"desc" : "磁盘正在被挂载中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010207" : {
					"cause" : "子网不存在。",
					"desc" : "子网不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010208" : {
					"cause" : "子网数量最大值为50个。",
					"desc" : "子网数量最大值为50个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010209" : {
					"cause" : "子网地址不合法。",
					"desc" : "子网地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010210" : {
					"cause" : "子网地址段冲突。",
					"desc" : "子网地址段冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010211" : {
					"cause" : "子网掩码不合法。",
					"desc" : "子网掩码不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010212" : {
					"cause" : "网关不合法。",
					"desc" : "网关不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010213" : {
					"cause" : "子网已被关联端口组，不能被删除。",
					"desc" : "子网已被关联端口组，不能被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010214" : {
					"cause" : "网关必须在子网的范围内。",
					"desc" : "网关必须在子网的范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010215" : {
					"cause" : "修改子网属性，需要关闭子网内所有虚拟机。",
					"desc" : "修改子网属性，需要关闭子网内所有虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010216" : {
					"cause" : "虚拟交换机类型不合法。",
					"desc" : "虚拟交换机类型不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010217" : {
					"cause" : "虚拟机模板不允许创建快照。",
					"desc" : "虚拟机模板不允许创建快照。",
					"solution" : "请转换为虚拟机后重试。"
				},
				"0005010218" : {
					"cause" : "该虚拟机为链接克隆虚拟机，不允许创建快照。",
					"desc" : "该虚拟机为链接克隆虚拟机，不允许创建快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010219" : {
					"cause" : "虚拟机交换机不存在。",
					"desc" : "虚拟机交换机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010220" : {
					"cause" : "服务器端口不能为空。",
					"desc" : "服务器端口不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010221" : {
					"cause" : "上行端口不存在。",
					"desc" : "上行端口不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010222" : {
					"cause" : "上行端口已被使用。",
					"desc" : "上行端口已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010223" : {
					"cause" : "上行端口网卡类型与虚拟交换机类型不同。",
					"desc" : "上行端口网卡类型与虚拟交换机类型不同。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010224" : {
					"cause" : "上行端口聚合不存在。",
					"desc" : "上行端口聚合不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010225" : {
					"cause" : "上行端口聚合已被使用。",
					"desc" : "上行端口聚合已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010226" : {
					"cause" : "虚拟机交换机内的服务器不能重叠。",
					"desc" : "虚拟机交换机内的服务器不能重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010227" : {
					"cause" : "端口组存在，不能删除虚拟机交换机。",
					"desc" : "端口组存在，不能删除虚拟机交换机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010228" : {
					"cause" : "虚拟机交换机内有上行端口。",
					"desc" : "虚拟机交换机内有上行端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010229" : {
					"cause" : "虚拟机交换机内有上行端口聚合s。",
					"desc" : "虚拟机交换机内有上行端口聚合s。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010230" : {
					"cause" : "带宽限速不能小于0。",
					"desc" : "带宽限速不能小于0。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010231" : {
					"cause" : "带宽限速必须满足限速间隔。",
					"desc" : "带宽限速必须满足限速间隔。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010232" : {
					"cause" : "虚拟机网卡端口组不存在。",
					"desc" : "虚拟机网卡端口组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010233" : {
					"cause" : "端口组不属于此虚拟机交换机。",
					"desc" : "端口组不属于此虚拟机交换机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010234" : {
					"cause" : "端口组关联子网失败。",
					"desc" : "端口组关联子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010235" : {
					"cause" : "端口组关联子网失败。",
					"desc" : "端口组关联子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010236" : {
					"cause" : "端口组ID不合法。",
					"desc" : "端口组ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010237" : {
					"cause" : "优先级和上限带宽必须同时为空，或者同时不为空。",
					"desc" : "优先级和上限带宽必须同时为空，或者同时不为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010238" : {
					"cause" : "获取子网信息失败。",
					"desc" : "获取子网信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010239" : {
					"cause" : "端口组内的VM没有关闭。",
					"desc" : "端口组内的VM没有关闭。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010240" : {
					"cause" : "修改端口组属性，需要关闭端口组内所有虚拟机。",
					"desc" : "修改端口组属性，需要关闭端口组内所有虚拟机。",
					"solution" : "请到当前集群“虚拟机”页面，点击“高级”，输入端口组编号，查看该端口组对应的虚拟机。"
				},
				"0005010241" : {
					"cause" : "上行端口ID不合法。",
					"desc" : "上行端口ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010242" : {
					"cause" : "上行端口不唯一。",
					"desc" : "上行端口不唯一。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010243" : {
					"cause" : "上行端口的状态不合法。",
					"desc" : "上行端口的状态不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010244" : {
					"cause" : "聚合策略不合法。",
					"desc" : "聚合策略不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010245" : {
					"cause" : "上行端口聚合ID不合法。",
					"desc" : "上行端口聚合ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010246" : {
					"cause" : "上行端口聚合的名称不合法。",
					"desc" : "上行端口聚合的名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010247" : {
					"cause" : "创建上行端口聚合使用的上行端口数目的取值范围是1～8。",
					"desc" : "创建上行端口聚合使用的上行端口数目的取值范围是1～8。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010248" : {
					"cause" : "不能跨iNic网卡创建上行端口聚合。",
					"desc" : "不能跨iNic网卡创建上行端口聚合。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010249" : {
					"cause" : "创建上行端口聚合使用的上行端口有重复的。",
					"desc" : "创建上行端口聚合使用的上行端口有重复的。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010250" : {
					"cause" : "不能在不同类型的网卡上创建上行端口聚合。",
					"desc" : "不能在不同类型的网卡上创建上行端口聚合。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010251" : {
					"cause" : "操作不合法。",
					"desc" : "操作不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010252" : {
					"cause" : "系统平面不存在。",
					"desc" : "系统平面不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010253" : {
					"cause" : "上行端口ID和上行端口聚合ID只能选一个。",
					"desc" : "上行端口ID和上行端口聚合ID只能选一个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010254" : {
					"cause" : "系统平面ID不合法。",
					"desc" : "系统平面ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010255" : {
					"cause" : "管理系统平面不能被删除。",
					"desc" : "管理系统平面不能被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010256" : {
					"cause" : "子网地址冲突。",
					"desc" : "子网地址冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010257" : {
					"cause" : "优先级不合法。",
					"desc" : "优先级不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010258" : {
					"cause" : "CNA创建系统平面失败。",
					"desc" : "CNA创建系统平面失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010259" : {
					"cause" : "上限带宽不合法。",
					"desc" : "上限带宽不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010260" : {
					"cause" : "上一个更新任务仍在进行中。",
					"desc" : "上一个更新任务仍在进行中。",
					"solution" : "请稍后重试。"
				},
				"0005010261" : {
					"cause" : "虚拟交换机名称不合法。",
					"desc" : "虚拟交换机名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010262" : {
					"cause" : "端口组名称不合法。",
					"desc" : "端口组名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010263" : {
					"cause" : "子网名称不合法。",
					"desc" : "子网名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010264" : {
					"cause" : "系统平面名称不合法。",
					"desc" : "系统平面名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010265" : {
					"cause" : "系统平面名称不合法。",
					"desc" : "系统平面名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010266" : {
					"cause" : "用于创建系统平面的端口不存在。",
					"desc" : "用于创建系统平面的端口不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010267" : {
					"cause" : "存储系统接口数量不能超过4个。",
					"desc" : "存储系统接口数量不能超过4个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010268" : {
					"cause" : "系统平面已存在。",
					"desc" : "系统平面已存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010269" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010270" : {
					"cause" : "查询参数为空。",
					"desc" : "查询参数为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010271" : {
					"cause" : "指标标志或指标名称为空。",
					"desc" : "指标标志或指标名称为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010272" : {
					"cause" : "Urn为空。",
					"desc" : "Urn为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010273" : {
					"cause" : "时间格式不正确。",
					"desc" : "时间格式不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010274" : {
					"cause" : "时间粒度不正确。",
					"desc" : "时间粒度不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010275" : {
					"cause" : "已存在名称相同的资源集群。",
					"desc" : "已存在名称相同的资源集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010276" : {
					"cause" : "应用软件包分区空间不足，导出模板失败。",
					"desc" : "应用软件包分区空间不足，导出模板失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005010277" : {
					"cause" : "服务器正在执行此操作。",
					"desc" : "服务器正在执行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010278" : {
					"cause" : "虚拟机交换机名称重复。",
					"desc" : "虚拟机交换机名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010279" : {
					"cause" : "虚拟机已经为运行中状态，勿需启动。",
					"desc" : "虚拟机已经为运行中状态，勿需启动。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010280" : {
					"cause" : "虚拟机正在执行此操作。",
					"desc" : "虚拟机正在执行此操作。",
					"solution" : "请等待任务完成。"
				},
				"0005010281" : {
					"cause" : "虚拟机不存在序列号为1的硬盘。",
					"desc" : "虚拟机不存在序列号为1的硬盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010282" : {
					"cause" : "此虚拟机已经为停止状态，不能进行该操作。",
					"desc" : "此虚拟机已经为停止状态，不能进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010283" : {
					"cause" : "虚拟机正在休眠中。",
					"desc" : "虚拟机正在休眠中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010284" : {
					"cause" : "此虚拟机已经为休眠状态，不能进行该操作。",
					"desc" : "此虚拟机已经为休眠状态，不能进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010285" : {
					"cause" : "虚拟机正在停止中。",
					"desc" : "虚拟机正在停止中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010286" : {
					"cause" : "目标节点或目标节点所在资源集群资源不足，不能迁移。",
					"desc" : "目标节点或目标节点所在资源集群资源不足，不能迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010287" : {
					"cause" : "源节点和目的节点的内存复用开关设置需相同。",
					"desc" : "源节点和目的节点的内存复用开关设置需相同。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010288" : {
					"cause" : "虚拟机挂有共享磁盘，不能进行此操作。",
					"desc" : "虚拟机挂有共享磁盘，不能进行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010289" : {
					"cause" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"desc" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010290" : {
					"cause" : "查询数据失败。",
					"desc" : "查询数据失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010291" : {
					"cause" : "密码允许重复使用次数或密码到期提前提示天数，不正确。",
					"desc" : "密码允许重复使用次数或密码到期提前提示天数，不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010292" : {
					"cause" : "用户名或密码错误。",
					"desc" : "用户名或密码错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010293" : {
					"cause" : "首次登录请修改密码。",
					"desc" : "首次登录请修改密码。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010294" : {
					"cause" : "密码已过期，请修改密码。",
					"desc" : "密码已过期，请修改密码。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010295" : {
					"cause" : "密码即将过期，要修改密码吗？",
					"desc" : "密码即将过期，要修改密码吗？",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010296" : {
					"cause" : "登录失败。",
					"desc" : "登录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010297" : {
					"cause" : "用户ID为空。",
					"desc" : "用户ID为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010298" : {
					"cause" : "包含正反序账户名。",
					"desc" : "包含正反序账户名。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010299" : {
					"cause" : "密码长度非法。",
					"desc" : "密码长度非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010300" : {
					"cause" : "包含特殊字符。",
					"desc" : "包含特殊字符。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010301" : {
					"cause" : "角色名不能为空。",
					"desc" : "角色名不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010302" : {
					"cause" : "权限列表为空。",
					"desc" : "权限列表为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010303" : {
					"cause" : "磁盘做过快照不允许挂载到其他虚拟机。",
					"desc" : "磁盘做过快照不允许挂载到其他虚拟机。",
					"solution" : "请重新选择没有做过快照的磁盘挂载到其他虚拟机。"
				},
				"0005010304" : {
					"cause" : "磁盘类型不允许当前操作。",
					"desc" : "磁盘类型不允许当前操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010305" : {
					"cause" : "虚拟机内存快照失败。",
					"desc" : "虚拟机内存快照失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010306" : {
					"cause" : "虚拟机有快照存在，不能修改为模板或克隆模板。",
					"desc" : "虚拟机有快照存在，不能修改为模板或克隆模板。",
					"solution" : "删除该虚拟机快照或者选择不存在快照的虚拟机进行克隆。"
				},
				"0005010307" : {
					"cause" : "快照恢复虚拟机时，主机启动虚拟机失败。",
					"desc" : "快照恢复虚拟机时，主机启动虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010308" : {
					"cause" : "对虚拟机进行此操作时计算资源不足。",
					"desc" : "对虚拟机进行此操作时计算资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010309" : {
					"cause" : "该服务器正在扫描存储设备。",
					"desc" : "该服务器正在扫描存储设备。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010310" : {
					"cause" : "数据存储超过100个。",
					"desc" : "数据存储超过100个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010311" : {
					"cause" : "虚拟机交换机能够添加的上线链路数量达到上限。",
					"desc" : "虚拟机交换机能够添加的上线链路数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010312" : {
					"cause" : "端口组数量达到上限。",
					"desc" : "端口组数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010313" : {
					"cause" : "端口组数量达到上限。",
					"desc" : "端口组数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010314" : {
					"cause" : "如果修改前上限带宽和优先级都没有设置，则对上限带宽和优先级修改需要同时进行。",
					"desc" : "如果修改前上限带宽和优先级都没有设置，则对上限带宽和优先级修改需要同时进行。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010315" : {
					"cause" : "设置CNA的网卡映射关系失败。",
					"desc" : "设置CNA的网卡映射关系失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010316" : {
					"cause" : "上行端口聚合名称重复。",
					"desc" : "上行端口聚合名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010317" : {
					"cause" : "上行端口聚合成员端口速率规格不一致。",
					"desc" : "上行端口聚合成员端口速率规格不一致。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010318" : {
					"cause" : "上行端口不是上行端口聚合的成员端口。",
					"desc" : "上行端口不是上行端口聚合的成员端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010319" : {
					"cause" : "系统自动创建的管理上行端口聚合内的第一个成员端口不能删除。",
					"desc" : "系统自动创建的管理上行端口聚合内的第一个成员端口不能删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010320" : {
					"cause" : "需要输入要修改的参数。",
					"desc" : "需要输入要修改的参数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010321" : {
					"cause" : "当前服务器不存在此上行端口聚合。",
					"desc" : "当前服务器不存在此上行端口聚合。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010322" : {
					"cause" : "参数上行端口ID和操作必须同时存在或不存在。",
					"desc" : "参数上行端口ID和操作必须同时存在或不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010323" : {
					"cause" : "从上行端口聚合删除网口，一次只能删除1个。",
					"desc" : "从上行端口聚合删除网口，一次只能删除1个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010324" : {
					"cause" : "从上行端口聚合删除网口时，上行端口聚合内必须保留1个网口。",
					"desc" : "从上行端口聚合删除网口时，上行端口聚合内必须保留1个网口。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010325" : {
					"cause" : "向上行端口聚合内增加网口，一次最少增加1个。",
					"desc" : "向上行端口聚合内增加网口，一次最少增加1个。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010326" : {
					"cause" : "当前服务器不存在此系统平面。",
					"desc" : "当前服务器不存在此系统平面。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010327" : {
					"cause" : "存储链路不能设置网关IP地址。",
					"desc" : "存储链路不能设置网关IP地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010328" : {
					"cause" : "系统平面名称重复。",
					"desc" : "系统平面名称重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010329" : {
					"cause" : "该任务类型不支持取消。",
					"desc" : "该任务类型不支持取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010330" : {
					"cause" : "任务已执行完毕，不支持取消。",
					"desc" : "任务已执行完毕，不支持取消。",
					"solution" : "请确认任务状态。"
				},
				"0005010331" : {
					"cause" : "数据查询失败，请稍后重试。",
					"desc" : "数据查询失败，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010332" : {
					"cause" : "VRM挂载磁盘失败。",
					"desc" : "VRM挂载磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010333" : {
					"cause" : "系统中对该对象的操作冲突。",
					"desc" : "系统中对该对象的操作冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010334" : {
					"cause" : "虚拟机已停止。",
					"desc" : "虚拟机已停止。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010335" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010336" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010337" : {
					"cause" : "服务器无法连接远程设备。",
					"desc" : "服务器无法连接远程设备。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010338" : {
					"cause" : "服务器无法访问远程文件。",
					"desc" : "服务器无法访问远程文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010339" : {
					"cause" : "服务器无法访问远程文件。",
					"desc" : "服务器无法访问远程文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010340" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "系统资源不足，请稍后重试。"
				},
				"0005010341" : {
					"cause" : "VRM无法连接该服务器。",
					"desc" : "VRM无法连接该服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010342" : {
					"cause" : "虚拟机网卡名称不能重复。",
					"desc" : "虚拟机网卡名称不能重复。",
					"solution" : "请重新输入不同的网卡名称。"
				},
				"0005010343" : {
					"cause" : "此虚拟机/模板正在克隆，不能删除或启动。",
					"desc" : "此虚拟机/模板正在克隆，不能删除或启动。",
					"solution" : "请稍后重试。"
				},
				"0005010344" : {
					"cause" : "克隆时，存在磁盘因源数据存储和目标数据存储存储类型不同无法克隆。",
					"desc" : "克隆时，存在磁盘因源数据存储和目标数据存储存储类型不同无法克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010345" : {
					"cause" : "克隆时，存在磁盘拷贝操作找不到合适的计算节点无法克隆。",
					"desc" : "克隆时，存在磁盘拷贝操作找不到合适的计算节点无法克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010346" : {
					"cause" : "存储类型为SAN或LOCAL，不允许做链接克隆。",
					"desc" : "存储类型为SAN或LOCAL，不允许做链接克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010347" : {
					"cause" : "停止虚拟机不允许做带内存快照。",
					"desc" : "停止虚拟机不允许做带内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010348" : {
					"cause" : "虚拟机的Tools没有运行。",
					"desc" : "虚拟机的Tools没有运行。",
					"solution" : "请先安装并启动Tools后再重试。"
				},
				"0005010349" : {
					"cause" : "输入参数错误。",
					"desc" : "输入参数错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010350" : {
					"cause" : "无法修复该虚拟机。",
					"desc" : "无法修复该虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010351" : {
					"cause" : "虚拟机模板不存在。",
					"desc" : "虚拟机模板不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010352" : {
					"cause" : "迁移失败，虚拟机正在创建快照或者恢复快照。",
					"desc" : "迁移失败，虚拟机正在创建快照或者恢复快照。",
					"solution" : "请稍后重试。"
				},
				"0005010353" : {
					"cause" : "主机未进入维护模式，不能迁空。",
					"desc" : "主机未进入维护模式，不能迁空。",
					"solution" : "请先进入维护模式再迁空。"
				},
				"0005010354" : {
					"cause" : "主机故障，不能迁空。",
					"desc" : "主机故障，不能迁空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010355" : {
					"cause" : "CPU资源不足，请检查CPU核数、预留、上限",
					"desc" : "CPU资源不足，请检查CPU核数、预留、上限",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010356" : {
					"cause" : "内存资源不足，请检查内存大小、预留、上限。",
					"desc" : "内存资源不足，请检查内存大小、预留、上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010357" : {
					"cause" : "超过可用主机的网卡上限。",
					"desc" : "超过可用主机的网卡上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010358" : {
					"cause" : "供选择的主机均异常。",
					"desc" : "供选择的主机均异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010359" : {
					"cause" : "供选择的主机均处于维护模式。",
					"desc" : "供选择的主机均处于维护模式。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010360" : {
					"cause" : "供选择的主机均不可用。",
					"desc" : "供选择的主机均不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010361" : {
					"cause" : "无供选择的主机。",
					"desc" : "无供选择的主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010362" : {
					"cause" : "主机繁忙，稍后重试。",
					"desc" : "主机繁忙，稍后重试。",
					"solution" : "主机繁忙，稍后重试。"
				},
				"0005010363" : {
					"cause" : "给虚拟机分配ip只能有一块网卡带有网关。",
					"desc" : "给虚拟机分配ip只能有一块网卡带有网关。",
					"solution" : "请更换无默认网关配置的端口组。"
				},
				"0005010364" : {
					"cause" : "主机不属于集群。",
					"desc" : "主机不属于集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010365" : {
					"cause" : "虚拟机不允许此操作。",
					"desc" : "虚拟机不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010366" : {
					"cause" : "虚拟机正在克隆，不能操作磁盘。",
					"desc" : "虚拟机正在克隆，不能操作磁盘。",
					"solution" : "请稍后重试。"
				},
				"0005010367" : {
					"cause" : "虚拟机存储形态不统一。",
					"desc" : "虚拟机存储形态不统一。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010368" : {
					"cause" : "虚拟机所属的数据存储不支持创建快照。",
					"desc" : "虚拟机所属的数据存储不支持创建快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010369" : {
					"cause" : "此USB控制器类型目前版本不支持。",
					"desc" : "此USB控制器类型目前版本不支持。",
					"solution" : "请重新选择合适的控制器类型。"
				},
				"0005010370" : {
					"cause" : "虚拟机已添加该类型的控制器。",
					"desc" : "虚拟机已添加该类型的控制器。",
					"solution" : "请重新选择合适的控制器类型。"
				},
				"0005010371" : {
					"cause" : "虚拟机未添加该类型的控制器。",
					"desc" : "虚拟机未添加该类型的控制器。",
					"solution" : "请重新选择合适的控制器类型。"
				},
				"0005010372" : {
					"cause" : "USB控制器下存在USB设备。",
					"desc" : "USB控制器下存在USB设备。",
					"solution" : "请先移除该类型控制器对应的USB设备，再进行删除。"
				},
				"0005010373" : {
					"cause" : "USB设备已被分配。",
					"desc" : "USB设备已被分配。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"0005010374" : {
					"cause" : "虚拟机和USB设备在不同主机。",
					"desc" : "虚拟机和USB设备在不同主机。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"0005010375" : {
					"cause" : "USB设备在不同的主机上。",
					"desc" : "USB设备在不同的主机上。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"0005010376" : {
					"cause" : "USB设备未被分配。",
					"desc" : "USB设备未被分配。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"0005010377" : {
					"cause" : "挂载USB设备的虚拟机不能迁移。",
					"desc" : "挂载USB设备的虚拟机不能迁移。",
					"solution" : "请先进行卸载USB设备再进行虚拟机迁移。"
				},
				"0005010378" : {
					"cause" : "虚拟机上没有该类型的控制器。",
					"desc" : "虚拟机上没有该类型的控制器。",
					"solution" : "请先添加该类型的控制器。"
				},
				"0005010379" : {
					"cause" : "虚拟机已达USB设备数量上限。",
					"desc" : "虚拟机已达USB设备数量上限。",
					"solution" : "请删除未使用的USB设备。"
				},
				"0005010380" : {
					"cause" : "虚拟机和USB设备在不同主机。",
					"desc" : "虚拟机和USB设备在不同主机。",
					"solution" : "请重新选择合适的USB设备。"
				},
				"0005010381" : {
					"cause" : "USB设备所在的主机不可用。",
					"desc" : "USB设备所在的主机不可用。",
					"solution" : "请选择可用的USB设备主机。"
				},
				"0005010382" : {
					"cause" : "绑定USB设备的虚拟机不能创建内存快照。",
					"desc" : "绑定USB设备的虚拟机不能创建内存快照。",
					"solution" : "绑定USB设备的虚拟机不能创建内存快照。"
				},
				"0005010383" : {
					"cause" : "绑定USB设备的虚拟机不能备份内存。",
					"desc" : "绑定USB设备的虚拟机不能备份内存。",
					"solution" : "绑定USB设备的虚拟机不能备份内存。"
				},
				"0005010384" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010385" : {
					"cause" : "主机返回失败。",
					"desc" : "主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010386" : {
					"cause" : "修改成功，重启后生效。",
					"desc" : "修改成功，重启后生效。",
					"solution" : "请重启虚拟机。"
				},
				"0005010387" : {
					"cause" : "密码非法。",
					"desc" : "密码非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010388" : {
					"cause" : "工作组信息非法。",
					"desc" : "工作组信息非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010389" : {
					"cause" : "工作组和域不能同时配置。",
					"desc" : "工作组和域不能同时配置。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010390" : {
					"cause" : "域名或域的计算机名非法。",
					"desc" : "域名或域的计算机名非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010391" : {
					"cause" : "网卡名字非法。",
					"desc" : "网卡名字非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010392" : {
					"cause" : "网卡序号非法。",
					"desc" : "网卡序号非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010393" : {
					"cause" : "网关信息非法。",
					"desc" : "网关信息非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010394" : {
					"cause" : "DNS信息错误。",
					"desc" : "DNS信息错误。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010395" : {
					"cause" : "自定义网卡数目与虚拟机网卡数目不一致。",
					"desc" : "自定义网卡数目与虚拟机网卡数目不一致。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010396" : {
					"cause" : "自定义操作系统类型与虚拟机不一致。",
					"desc" : "自定义操作系统类型与虚拟机不一致。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010397" : {
					"cause" : "挂载光驱的协议不合法。",
					"desc" : "挂载光驱的协议不合法。",
					"solution" : "请使用合法的协议进行挂载。"
				},
				"0005010398" : {
					"cause" : "虚拟机系统繁忙，请稍后重试。",
					"desc" : "虚拟机系统繁忙，请稍后重试。",
					"solution" : "请稍后重试。"
				},
				"0005010399" : {
					"cause" : "VMware内部错误，查询任务失败原因失败。",
					"desc" : "VMware内部错误，查询任务失败原因失败。",
					"solution" : "请登录vSphere，确认相关虚拟机是否休眠成功。"
				},
				"0005010400" : {
					"cause" : "不支持多VRM级联",
					"desc" : "不支持多VRM级联",
					"solution" : "请联系系统管理员。"
				},
				"0005010401" : {
					"cause" : "用户鉴权失败",
					"desc" : "用户鉴权失败",
					"solution" : "请联系系统管理员。"
				},
				"0005010402" : {
					"cause" : "待操作的集群对象不存在",
					"desc" : "待操作的集群对象不存在",
					"solution" : "请联系系统管理员。"
				},
				"0005010403" : {
					"cause" : "主机关联的存储集群不允许下电该主机。",
					"desc" : "主机关联的存储集群不允许下电该主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010404" : {
					"cause" : "主机关联的存储集群不允许重启该主机。",
					"desc" : "主机关联的存储集群不允许重启该主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010405" : {
					"cause" : "FusionManager未接入该服务器。",
					"desc" : "FusionManager未接入该服务器。",
					"solution" : "请在FusionManager中接入该服务器并重试。"
				},
				"0005010406" : {
					"cause" : "任务在此阶段不允许取消。",
					"desc" : "任务在此阶段不允许取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010407" : {
					"cause" : "任务已经被取消，不能再次执行此操作。",
					"desc" : "任务已经被取消，不能再次执行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010408" : {
					"cause" : "任务取消失败。",
					"desc" : "任务取消失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010409" : {
					"cause" : "用户取消任务。",
					"desc" : "用户取消任务。",
					"solution" : "请确认后再进行操作"
				},
				"0005010410" : {
					"cause" : "虚拟机不受快照影响磁盘当前设置与快照点磁盘设置冲突。",
					"desc" : "虚拟机不受快照影响磁盘当前设置与快照点磁盘设置冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010411" : {
					"cause" : "集群发现失败，没有发现可用的数据中心。",
					"desc" : "集群发现失败，没有发现可用的数据中心。",
					"solution" : "请检查虚拟化环境用户的会话或待发现集群是否在数据中心下。"
				},
				"0005010412" : {
					"cause" : "共享磁盘绑定的虚拟机达到上限。",
					"desc" : "共享磁盘绑定的虚拟机达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010413" : {
					"cause" : "无法修复该虚拟机。",
					"desc" : "无法修复该虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010414" : {
					"cause" : "当前虚拟机位置无法满足恢复快照后启动虚拟机条件，请将虚拟机迁移至满足条件的主机。",
					"desc" : "当前虚拟机位置无法满足恢复快照后启动虚拟机条件，请将虚拟机迁移至满足条件的主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010415" : {
					"cause" : "主机当前状态不支持此操作，请稍后重试。",
					"desc" : "主机当前状态不支持此操作，请稍后重试。",
					"solution" : "请检查后重试。"
				},
				"0005010416" : {
					"cause" : "主机上有存储相关任务，不允许此操作。",
					"desc" : "主机上有存储相关任务，不允许此操作。",
					"solution" : "请检查后重试。"
				},
				"0005010417" : {
					"cause" : "该虚拟机已挂载光驱或者Tools，不允许迁移。",
					"desc" : "该虚拟机已挂载光驱或者Tools，不允许迁移。",
					"solution" : "请卸载光驱后重试。"
				},
				"0005010418" : {
					"cause" : "主机暂未准备就绪，请稍后重试。",
					"desc" : "主机暂未准备就绪，请稍后重试。",
					"solution" : "请检查后重试。"
				},
				"0005010419" : {
					"cause" : "虚拟机状态异常导致创建一致性快照失败。",
					"desc" : "虚拟机状态异常导致创建一致性快照失败。",
					"solution" : "请检查虚拟机状态。"
				},
				"0005010420" : {
					"cause" : "目标数据存储不支持非持久化磁盘或者带快照的磁盘。",
					"desc" : "目标数据存储不支持非持久化磁盘或者带快照的磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010421" : {
					"cause" : "小于4G的磁盘不允许扩容。",
					"desc" : "小于4G的磁盘不允许扩容。",
					"solution" : "请联系系统管理员。"
				},
				"0005010422" : {
					"cause" : "共享磁盘不支持修改磁盘IO属性。",
					"desc" : "共享磁盘不支持修改磁盘IO属性。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010423" : {
					"cause" : "当前磁盘状态不允许修改磁盘IO属性。",
					"desc" : "当前磁盘状态不允许修改磁盘IO属性。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010424" : {
					"cause" : "当前磁盘正在修改IO属性，当前状态不支持修改磁盘IO属性。",
					"desc" : "当前磁盘正在修改IO属性，当前状态不支持修改磁盘IO属性。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010425" : {
					"cause" : "修改磁盘IO属性失败。",
					"desc" : "修改磁盘IO属性失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010426" : {
					"cause" : "内存交换磁盘不允许设置IO上限。",
					"desc" : "内存交换磁盘不允许设置IO上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010427" : {
					"cause" : "主机中挂载光驱的虚拟机个数达到上限",
					"desc" : "主机中挂载光驱的虚拟机个数达到上限",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010428" : {
					"cause" : "快照存在差分磁盘，不允许删除，请删除该快照快速部署的虚拟机后重试。",
					"desc" : "快照存在差分磁盘，不允许删除，请删除该快照快速部署的虚拟机后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010429" : {
					"cause" : "对象虚拟机为快速复制的虚拟机，不允许进行此操作。",
					"desc" : "对象虚拟机为快速复制的虚拟机，不允许进行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010430" : {
					"cause" : "磁盘格式化失败。",
					"desc" : "磁盘格式化失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010431" : {
					"cause" : "小于4G的磁盘不允许扩容。",
					"desc" : "小于4G的磁盘不允许扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010432" : {
					"cause" : "裸设备映射数据存储上只能创建裸设备映射磁盘，此磁盘类型是共享，配置模式是普通，不受快照影响，持久，拥有全部数据存储空间。",
					"desc" : "裸设备映射数据存储上只能创建裸设备映射磁盘，此磁盘类型是共享，配置模式是普通，不受快照影响，持久，拥有全部数据存储空间。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010433" : {
					"cause" : "集群下存在启动中、迁移中等暂态的虚拟机，不能修改集群非统一内存访问开关。",
					"desc" : "集群下存在启动中、迁移中等暂态的虚拟机，不能修改集群非统一内存访问开关。",
					"solution" : "请稍后重试。"
				},
				"0005010434" : {
					"cause" : "该磁盘不能绑定该虚拟机，请将虚拟机加入组织后再试。",
					"desc" : "该磁盘不能绑定该虚拟机，请将虚拟机加入组织后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010435" : {
					"cause" : "主机上设置卷的IO份额失败。",
					"desc" : "主机上设置卷的IO份额失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010436" : {
					"cause" : "该卷未绑定给虚拟机，不能设置IO份额。",
					"desc" : "该卷未绑定给虚拟机，不能设置IO份额。",
					"solution" : "请先绑定虚拟机再重试。"
				},
				"0005010437" : {
					"cause" : "挂起虚拟机，主机返回失败。",
					"desc" : "挂起虚拟机，主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010438" : {
					"cause" : "CPU或内存热插拔操作完成后虚拟机未重启。",
					"desc" : "CPU或内存热插拔操作完成后虚拟机未重启。",
					"solution" : "CPU或内存热插拔操作完成，请在重启虚拟机之后创建快照。"
				},
				"0005010439" : {
					"cause" : "存在快照的虚拟机不能离线克隆为其他虚拟机。",
					"desc" : "存在快照的虚拟机不能离线克隆为其他虚拟机。",
					"solution" : "删除该虚拟机快照或者选择不存在快照的虚拟机进行克隆。"
				},
				"0005010440" : {
					"cause" : "级联域中最多连接16个VRM。",
					"desc" : "级联域中最多连接16个VRM。",
					"solution" : "级联域中最多连接16个VRM。"
				},
				"0005010441" : {
					"cause" : "URL长度超过限制。",
					"desc" : "URL长度超过限制。",
					"solution" : "URL长度超过限制，请输入正确URL。"
				},
				"0005010442" : {
					"cause" : "存在链接克隆虚拟机的模板不能转为虚拟机。",
					"desc" : "存在链接克隆虚拟机的模板不能转为虚拟机。",
					"solution" : "请选择其他虚拟机模板进行操作。"
				},
				"0005010443" : {
					"cause" : "虚拟机的当前状态不容许解绑定显卡。",
					"desc" : "虚拟机的当前状态不容许解绑定显卡。",
					"solution" : "当前虚拟机状态不允许解绑定显卡，请稍后重试。"
				},
				"0005010444" : {
					"cause" : "内存磁盘不允许迁移。",
					"desc" : "内存磁盘不允许迁移。",
					"solution" : "请选择可以迁移的磁盘迁移。"
				},
				"0005010445" : {
					"cause" : "与另一VRM通信异常。",
					"desc" : "与另一VRM通信异常。",
					"solution" : "请联系系统管理员。"
				},
				"0005010446" : {
					"cause" : "虚拟机有共享磁盘，迁移失败。",
					"desc" : "虚拟机有共享磁盘，迁移失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010447" : {
					"cause" : "链接克隆虚拟机不支持修复。",
					"desc" : "链接克隆虚拟机不支持修复。",
					"solution" : "请检查后重试。"
				},
				"0005010448" : {
					"cause" : "操作无法完成，主机被某些对象（如虚拟机）使用。",
					"desc" : "操作无法完成，主机被某些对象（如虚拟机）使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010449" : {
					"cause" : "地址前缀不在0～32之间。",
					"desc" : "地址前缀不在0～32之间。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010450" : {
					"cause" : "对象不存在。",
					"desc" : "对象不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010451" : {
					"cause" : "参数不合法。",
					"desc" : "参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010452" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010453" : {
					"cause" : "对象已存在。",
					"desc" : "对象已存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010454" : {
					"cause" : "对象已关联。",
					"desc" : "对象已关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010455" : {
					"cause" : "对象已去关联。",
					"desc" : "对象已去关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010456" : {
					"cause" : "端口绑定策略已经使用。",
					"desc" : "端口绑定策略已经使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010457" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010458" : {
					"cause" : "业务端口没有连接到交换机端口。",
					"desc" : "业务端口没有连接到交换机端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010459" : {
					"cause" : "获取业务端口号失败。",
					"desc" : "获取业务端口号失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010460" : {
					"cause" : "获取交换机端口号失败。",
					"desc" : "获取交换机端口号失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010461" : {
					"cause" : "为子网配置的子网在使用中。",
					"desc" : "为子网配置的子网在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010462" : {
					"cause" : "汇聚交换机不存在。",
					"desc" : "汇聚交换机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010463" : {
					"cause" : "对象正在创建，修改或者删除中，操作失败。",
					"desc" : "对象正在创建，修改或者删除中，操作失败。",
					"solution" : "请稍后再试。"
				},
				"0005010464" : {
					"cause" : "设备已上电或设备无法正常连接。",
					"desc" : "设备已上电或设备无法正常连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010465" : {
					"cause" : "设备已下电或设备无法正常连接。",
					"desc" : "设备已下电或设备无法正常连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010466" : {
					"cause" : "设备已下电或设备无法正常连接。",
					"desc" : "设备已下电或设备无法正常连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010467" : {
					"cause" : "存在LUN，无法删除。",
					"desc" : "存在LUN，无法删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010468" : {
					"cause" : "下一跳地址错误。",
					"desc" : "下一跳地址错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010469" : {
					"cause" : "端口不为上行端口。",
					"desc" : "端口不为上行端口。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010470" : {
					"cause" : "端口存在配置。",
					"desc" : "端口存在配置。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010471" : {
					"cause" : "服务器配置策略已经使用。",
					"desc" : "服务器配置策略已经使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010472" : {
					"cause" : "已配置了路由业务。",
					"desc" : "已配置了路由业务。",
					"solution" : "请删除路由业务。"
				},
				"0005010473" : {
					"cause" : "协议不合法。",
					"desc" : "协议不合法。",
					"solution" : "请联系系统管理员。"
				},
				"0005010474" : {
					"cause" : "端口范围不合法。",
					"desc" : "端口范围不合法。",
					"solution" : "请联系系统管理员。"
				},
				"0005010475" : {
					"cause" : "ACL规则的优先级已经存在。",
					"desc" : "ACL规则的优先级已经存在。",
					"solution" : "请联系系统管理员。"
				},
				"0005010476" : {
					"cause" : "设备不存在",
					"desc" : "设备不存在",
					"solution" : "请刷新设备列表"
				},
				"0005010477" : {
					"cause" : "密码不满足口令要求、密码为空或者长度不满足要求。",
					"desc" : "密码不满足口令要求、密码为空或者长度不满足要求。",
					"solution" : "请查看用户资料的口令要求部分。"
				},
				"0005010478" : {
					"cause" : "没有可用的资源。",
					"desc" : "没有可用的资源。",
					"solution" : "请联系系统管理员。"
				},
				"0005010479" : {
					"cause" : "资源参数非法。",
					"desc" : "资源参数非法。",
					"solution" : "请修改资源配置文件。"
				},
				"0005010480" : {
					"cause" : "没有可用的service set。",
					"desc" : "没有可用的service set。",
					"solution" : "请联系系统管理员。"
				},
				"0005010481" : {
					"cause" : "设备不可达。",
					"desc" : "设备不可达。",
					"solution" : "请检查设备的网络。"
				},
				"0005010482" : {
					"cause" : "手工配置不完整。",
					"desc" : "手工配置不完整。",
					"solution" : "请查看设备的配置信息。"
				},
				"0005010483" : {
					"cause" : "将IP，用户名和密码等信息保存到UHM失败。",
					"desc" : "将IP，用户名和密码等信息保存到UHM失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010484" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "请重新命名。"
				},
				"0005010485" : {
					"cause" : "文件操作异常。",
					"desc" : "文件操作异常。",
					"solution" : "请重新命名。"
				},
				"0005010486" : {
					"cause" : "数据存储操作无效。",
					"desc" : "数据存储操作无效。",
					"solution" : "请重新命名。"
				},
				"0005010487" : {
					"cause" : "当前状态不允许此操作。",
					"desc" : "当前状态不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010488" : {
					"cause" : "名称不合法。",
					"desc" : "名称不合法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010489" : {
					"cause" : "系统正在执行涉及该对象的另一操作。",
					"desc" : "系统正在执行涉及该对象的另一操作。",
					"solution" : "请稍后重试。"
				},
				"0005010490" : {
					"cause" : "升级中不能执行该操作。",
					"desc" : "升级中不能执行该操作。",
					"solution" : "请稍后重试。"
				},
				"0005010491" : {
					"cause" : "通讯异常，无法连接。",
					"desc" : "通讯异常，无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010492" : {
					"cause" : "用户名或密码错误，登录失败。",
					"desc" : "用户名或密码错误，登录失败。",
					"solution" : "请到系统配置当中填写正确的用户和密码。"
				},
				"0005010493" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010494" : {
					"cause" : "FusionStorage存储已经达到最大数目。",
					"desc" : "FusionStorage存储已经达到最大数目。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010495" : {
					"cause" : "原始密码输入错误3次。",
					"desc" : "原始密码输入错误3次。",
					"solution" : "请等待5分钟后操作。"
				},
				"0005010496" : {
					"cause" : "用户不存在。",
					"desc" : "用户不存在。",
					"solution" : "请使用存在的用户操作。"
				},
				"0005010497" : {
					"cause" : "本端修改uhm用户密码失败。",
					"desc" : "本端修改uhm用户密码失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010498" : {
					"cause" : "进程重启失败。",
					"desc" : "进程重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010499" : {
					"cause" : "FusionStorage正在与FusionManager通讯。",
					"desc" : "FusionStorage正在与FusionManager通讯。",
					"solution" : "请在集群操作完成后重试。"
				},
				"0005010500" : {
					"cause" : "可能缺少Vmware SDK工具包。",
					"desc" : "可能缺少Vmware SDK工具包。",
					"solution" : "请确保安装Vmware SDK工具包再重试。如果确定已经安装Vmware SDK工具包，请联系技术支持工程师。"
				},
				"0005010501" : {
					"cause" : "任务取消失败。",
					"desc" : "任务取消失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010502" : {
					"cause" : "任务状态已变化。",
					"desc" : "任务状态已变化。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010503" : {
					"cause" : "任务不存在。",
					"desc" : "任务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010504" : {
					"cause" : "任务类型不支持取消。",
					"desc" : "任务类型不支持取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011001" : {
					"cause" : "批量操作虚拟机数大于100。",
					"desc" : "批量操作虚拟机数大于100。",
					"solution" : "请减少一次操作的虚拟机数，不能超过100。"
				},
				"0005011002" : {
					"cause" : "该虚拟机对应的虚拟机模板不存在，不支持该操作。",
					"desc" : "该虚拟机对应的虚拟机模板不存在，不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011003" : {
					"cause" : "待修复虚拟机磁盘已经达到上限，不能修复。",
					"desc" : "待修复虚拟机磁盘已经达到上限，不能修复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011004" : {
					"cause" : "待修复虚拟机正在修复中。",
					"desc" : "待修复虚拟机正在修复中。",
					"solution" : "请稍候再试。"
				},
				"0005011005" : {
					"cause" : "批量迁移虚拟机数大于8。",
					"desc" : "批量迁移虚拟机数大于8。",
					"solution" : "请减少一次迁移的虚拟机数，不能超过8。"
				},
				"0005011006" : {
					"cause" : "选择进行回收的磁盘数量超过40。",
					"desc" : "选择进行回收的磁盘数量超过40。",
					"solution" : "请选择不超过40个磁盘进行回收。"
				},
				"0005011007" : {
					"cause" : "虚拟机添加磁盘失败。",
					"desc" : "虚拟机添加磁盘失败。",
					"solution" : "请稍后重试。"
				},
				"0005011008" : {
					"cause" : "虚拟机删除磁盘失败。",
					"desc" : "虚拟机删除磁盘失败。",
					"solution" : "请稍后重试。"
				},
				"0005011009" : {
					"cause" : "虚拟机添加磁盘失败，回滚删除磁盘失败。",
					"desc" : "虚拟机添加磁盘失败，回滚删除磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011010" : {
					"cause" : "虚拟机删除磁盘失败，回滚添加磁盘失败。",
					"desc" : "虚拟机删除磁盘失败，回滚添加磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011011" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011012" : {
					"cause" : "虚拟机状态冲突，只有运行中或已停止状态才能修复。",
					"desc" : "虚拟机状态冲突，只有运行中或已停止状态才能修复。",
					"solution" : "请确认虚拟机状态后再试。"
				},
				"0005011013" : {
					"cause" : "当前用户不属于任何域。",
					"desc" : "当前用户不属于任何域。",
					"solution" : "请增加用户的管理域后重试。"
				},
				"0005011014" : {
					"cause" : "任务执行失败。",
					"desc" : "任务执行失败。",
					"solution" : "请登录Vcenter查看任务详情。"
				},
				"0005011015" : {
					"cause" : "迁移操作异常。",
					"desc" : "迁移操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011016" : {
					"cause" : "此虚拟机在任务中心有尚未结束的任务。",
					"desc" : "此虚拟机在任务中心有尚未结束的任务。",
					"solution" : "请稍后重试。"
				},
				"0005011017" : {
					"cause" : "网卡不存在。",
					"desc" : "网卡不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011018" : {
					"cause" : "虚拟化环境处理错误。",
					"desc" : "虚拟化环境处理错误。",
					"solution" : "虚拟化环境处理错误，请稍后重试。"
				},
				"0005011019" : {
					"cause" : "快照正在使用中，不允许此操作。",
					"desc" : "快照正在使用中，不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011020" : {
					"cause" : "虚拟机状态冲突，无法支持此操作。",
					"desc" : "虚拟机状态冲突，无法支持此操作。",
					"solution" : "请在虚拟机状态允许情况下进行操作。"
				},
				"0005011021" : {
					"cause" : "虚拟机无法支持该操作，当前状态下CPU核数只能修改成当前核数的两倍。",
					"desc" : "虚拟机无法支持该操作，当前状态下CPU核数只能修改成当前核数的两倍。",
					"solution" : "请在虚拟机状态允许情况下进行操作。"
				},
				"0005011022" : {
					"cause" : "数据存储的状态不支持该操作或者没有与集群所有主机绑定。",
					"desc" : "数据存储的状态不支持该操作或者没有与集群所有主机绑定。",
					"solution" : "确保数据存储的状态正常并与所有集群绑定。"
				},
				"0005011023" : {
					"cause" : "MAC地址没有配置，也不在MAC地址段中。请在资源>虚拟化>虚拟化环境页面配置MAC地址。",
					"desc" : "MAC地址没有配置，也不在MAC地址段中。请在资源>虚拟化>虚拟化环境页面配置MAC地址。",
					"solution" : "请输入已配置的MAC地址或者选中MAC地址段中的MAC地址。"
				},
				"0005011024" : {
					"cause" : "Mac地址已经存在。",
					"desc" : "Mac地址已经存在。",
					"solution" : "请选择未被配置的MAC地址。"
				},
				"0005011025" : {
					"cause" : "可用CPU资源不足，无法执行该操作。",
					"desc" : "可用CPU资源不足，无法执行该操作。",
					"solution" : "请检查资源是否足够。"
				},
				"0005011026" : {
					"cause" : "可用内存资源不足。",
					"desc" : "可用内存资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011027" : {
					"cause" : "可用存储资源不足，无法执行该操作。",
					"desc" : "可用存储资源不足，无法执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011028" : {
					"cause" : "组织VDC下的CPU资源不足。",
					"desc" : "组织VDC下的CPU资源不足。",
					"solution" : "请检查资源是否充足。"
				},
				"0005011029" : {
					"cause" : "组织VDC下的内存资源不足。",
					"desc" : "组织VDC下的内存资源不足。",
					"solution" : "请检查资源是否充足。"
				},
				"0005011030" : {
					"cause" : "组织VDC下的存储资源不足。",
					"desc" : "组织VDC下的存储资源不足。",
					"solution" : "请检查资源是否充足。"
				},
				"0005011031" : {
					"cause" : "指定的虚拟机模板或者指定的虚拟机逻辑模板对应的虚拟机模板无效。",
					"desc" : "指定的虚拟机模板或者指定的虚拟机逻辑模板对应的虚拟机模板无效。",
					"solution" : "请检查虚拟机模板或者虚拟机逻辑模板对应的虚拟机模板是否可用。"
				},
				"0005011032" : {
					"cause" : "非虚拟机模板不能配置。",
					"desc" : "非虚拟机模板不能配置。",
					"solution" : "请选择虚拟机模板。"
				},
				"0005011033" : {
					"cause" : "主机状态异常。",
					"desc" : "主机状态异常。",
					"solution" : "请检查主机状态是否正常。"
				},
				"0005011034" : {
					"cause" : "配置iCache时，主机空闲物理内存不足。",
					"desc" : "配置iCache时，主机空闲物理内存不足。",
					"solution" : "请稍后重试。"
				},
				"0005011035" : {
					"cause" : "配置iCache时，扩内存超时。",
					"desc" : "配置iCache时，扩内存超时。",
					"solution" : "请稍后重试。"
				},
				"0005011036" : {
					"cause" : "清iCache配置时，减内存超时失败。",
					"desc" : "清iCache配置时，减内存超时失败。",
					"solution" : "请稍后重试。"
				},
				"0005011037" : {
					"cause" : "释放内存量过大。",
					"desc" : "释放内存量过大。",
					"solution" : "请稍后重试。"
				},
				"0005011038" : {
					"cause" : "配置iCache时，底层处理异常。",
					"desc" : "配置iCache时，底层处理异常。",
					"solution" : "请稍后重试。"
				},
				"0005011039" : {
					"cause" : "配置了iCache的模板，不允许删除。",
					"desc" : "配置了iCache的模板，不允许删除。",
					"solution" : "无。"
				},
				"0005011040" : {
					"cause" : "模板的系统盘为非持久化盘，不容许配置iCache。",
					"desc" : "模板的系统盘为非持久化盘，不容许配置iCache。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"0005011041" : {
					"cause" : "模板存没有系统盘，不容许配置iCache。",
					"desc" : "模板存没有系统盘，不容许配置iCache。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"0005011042" : {
					"cause" : "配置iCache的模板不容许转为虚拟机。",
					"desc" : "配置iCache的模板不容许转为虚拟机。",
					"solution" : "请选择没有配置iCache的虚拟机。"
				},
				"0005011043" : {
					"cause" : "模板存在链接克隆虚拟机，删除iCache配置失败。",
					"desc" : "模板存在链接克隆虚拟机，删除iCache配置失败。",
					"solution" : "请选择没有配置iCache的虚拟机。"
				},
				"0005011044" : {
					"cause" : "配置iCache的模板个数超出最大限制。",
					"desc" : "配置iCache的模板个数超出最大限制。",
					"solution" : "无。"
				},
				"0005011045" : {
					"cause" : "虚拟机不支持链接克隆。",
					"desc" : "虚拟机不支持链接克隆。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"0005011046" : {
					"cause" : "该虚拟机存储类型不支持配置iCache。",
					"desc" : "该虚拟机存储类型不支持配置iCache。",
					"solution" : "请选择支持链接克隆的虚拟机。"
				},
				"0005011047" : {
					"cause" : "虚拟机下没有可用的光驱。",
					"desc" : "虚拟机下没有可用的光驱。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011048" : {
					"cause" : "模板虚拟机不支持此操作。",
					"desc" : "模板虚拟机不支持此操作。",
					"solution" : "请选择其他虚拟机进行操作。"
				},
				"0005011049" : {
					"cause" : "虚拟机不存在该网卡，无法进行此操作。",
					"desc" : "虚拟机不存在该网卡，无法进行此操作。",
					"solution" : "请选择合适的网卡进行操作。"
				},
				"0005011050" : {
					"cause" : "资源组所选虚拟机中有虚拟机已经不存在。",
					"desc" : "资源组所选虚拟机中有虚拟机已经不存在。",
					"solution" : "请刷新界面后选择存在的虚拟机。"
				},
				"0005011051" : {
					"cause" : "资源组所选主机中有主机已经不存在。",
					"desc" : "资源组所选主机中有主机已经不存在。",
					"solution" : "请刷新界面后选择存在的主机。"
				},
				"0005011052" : {
					"cause" : "虚拟机磁盘任务正在进行中，无法进行此操作。",
					"desc" : "虚拟机磁盘任务正在进行中，无法进行此操作。",
					"solution" : "请稍后重试。"
				},
				"0005011053" : {
					"cause" : "系统磁盘不允许在线删除。",
					"desc" : "系统磁盘不允许在线删除。",
					"solution" : "请关闭虚拟机后再进行删除操作。"
				},
				"0005011054" : {
					"cause" : "虚拟机不支持非停止状态进行删除操作。",
					"desc" : "虚拟机不支持非停止状态进行删除操作。",
					"solution" : "请关闭虚拟机后再进行删除操作。"
				},
				"0005011055" : {
					"cause" : "预留值比限制值[{0}]大，设置失败。",
					"desc" : "预留值比限制值[{0}]大，设置失败。",
					"solution" : "请选择合适的预留值进行设置。"
				},
				"0005011056" : {
					"cause" : "每个物理CPU的容量都不足。",
					"desc" : "每个物理CPU的容量都不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011057" : {
					"cause" : "SMI-S服务异常，请登录SAN设备进行排查。",
					"desc" : "SMI-S服务异常，请登录SAN设备进行排查。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011058" : {
					"cause" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"desc" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"solution" : "请选择有效磁盘进行资源回收操作。"
				},
				"0005011059" : {
					"cause" : "重新创建内存交换磁盘失败。",
					"desc" : "重新创建内存交换磁盘失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005011060" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011061" : {
					"cause" : "删除快照失败。",
					"desc" : "删除快照失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011062" : {
					"cause" : "主机CPU资源不满足条件。",
					"desc" : "主机CPU资源不满足条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011063" : {
					"cause" : "修改的CPU核数超过虚拟机操作系统支持的上限{0}。",
					"desc" : "修改的CPU核数超过虚拟机操作系统支持的上限{0}。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011064" : {
					"cause" : "扩容的大小超过数据存储支持的最大值。",
					"desc" : "扩容的大小超过数据存储支持的最大值。",
					"solution" : "请确认数据存储支持的最大值。"
				},
				"0005011065" : {
					"cause" : "虚拟机配置了独立磁盘，无法创建内存快照。",
					"desc" : "虚拟机配置了独立磁盘，无法创建内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011066" : {
					"cause" : "虚拟机有设备不满足迁移条件。例如：虚拟机有非持久化磁盘。",
					"desc" : "虚拟机有设备不满足迁移条件。例如：虚拟机有非持久化磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011067" : {
					"cause" : "虚拟机有快照，不支持修改磁盘属性。",
					"desc" : "虚拟机有快照，不支持修改磁盘属性。",
					"solution" : "请先删除该虚拟机的快照（如果允许），再执行此操作。"
				},
				"0005011068" : {
					"cause" : "当前存储类型只支持创建精简磁盘。",
					"desc" : "当前存储类型只支持创建精简磁盘。",
					"solution" : "请选择精简磁盘进行创建。"
				},
				"0005011069" : {
					"cause" : "可读写的存储空间不足。",
					"desc" : "可读写的存储空间不足。",
					"solution" : "请选择合适的存储容量。"
				},
				"0005011070" : {
					"cause" : "该磁盘不支持空间回收，如果磁盘存在快照，请删除快照完成后重新进行空间回收操作；如果磁盘是非精简类型、共享类型、非虚拟化类型或者链接克隆系统磁盘，则无法支持空间回收。",
					"desc" : "该磁盘不支持空间回收，如果磁盘存在快照，请删除快照完成后重新进行空间回收操作；如果磁盘是非精简类型、共享类型、非虚拟化类型或者链接克隆系统磁盘，则无法支持空间回收。",
					"solution" : "请选择有效磁盘进行资源回收操作。"
				},
				"0005011071" : {
					"cause" : "只有休眠或者关闭的虚拟机才支持磁盘资源回收。",
					"desc" : "只有休眠或者关闭的虚拟机才支持磁盘资源回收。",
					"solution" : "请选择休眠或者关闭的虚拟机。"
				},
				"0005011072" : {
					"cause" : "磁盘资源回收失败。",
					"desc" : "磁盘资源回收失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011073" : {
					"cause" : "内存交换磁盘不允许资源回收。",
					"desc" : "内存交换磁盘不允许资源回收。",
					"solution" : "请选择其他磁盘进行资源回收操作。"
				},
				"0005011074" : {
					"cause" : "模板虚拟机不支持磁盘资源回收。",
					"desc" : "模板虚拟机不支持磁盘资源回收。",
					"solution" : "请选择普通虚拟机进行磁盘资源回收。"
				},
				"0005011075" : {
					"cause" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"desc" : "磁盘需要是在Windows下格式化的NTFS分区才能回收。",
					"solution" : "请选择有效磁盘进行资源回收操作。"
				},
				"0005011076" : {
					"cause" : "虚拟机的状态自上次执行快照操作以来未发生变化。",
					"desc" : "虚拟机的状态自上次执行快照操作以来未发生变化。",
					"solution" : "请等待虚拟机状态发生改变后重试。"
				},
				"0005011077" : {
					"cause" : "源或目标主机上的vMotion接口未配置（或者配置错误）。",
					"desc" : "源或目标主机上的vMotion接口未配置（或者配置错误）。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011078" : {
					"cause" : "在主机的当前连接状况下不允许执行该操作。",
					"desc" : "在主机的当前连接状况下不允许执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011079" : {
					"cause" : "虚拟机操作超时。",
					"desc" : "虚拟机操作超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011080" : {
					"cause" : "虚拟机删除失败：网卡绑定了弹性IP或设置了NAPT.",
					"desc" : "虚拟机删除失败：网卡绑定了弹性IP或设置了NAPT.",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011081" : {
					"cause" : "虚拟机快照数量达到上限，不允许在线克隆虚拟机。",
					"desc" : "虚拟机快照数量达到上限，不允许在线克隆虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011082" : {
					"cause" : "虚拟机存在独立磁盘，不允许进行该操作。",
					"desc" : "虚拟机存在独立磁盘，不允许进行该操作。",
					"solution" : "请先删除独立磁盘，再重试。"
				},
				"0005011083" : {
					"cause" : "虚拟机存在非虚拟化类型磁盘，不允许进行该操作。",
					"desc" : "虚拟机存在非虚拟化类型磁盘，不允许进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011084" : {
					"cause" : "该网卡已存在",
					"desc" : "该网卡已存在",
					"solution" : "请刷新页面并重新添加网卡。"
				},
				"0005011085" : {
					"cause" : "主机不兼容该操作系统。",
					"desc" : "主机不兼容该操作系统。",
					"solution" : "请选择其它操作系统。"
				},
				"0005011086" : {
					"cause" : "虚拟机处于集群资源组管理中的虚拟机组中。",
					"desc" : "虚拟机处于集群资源组管理中的虚拟机组中。",
					"solution" : "请先从虚拟机组中移除虚拟机然后重新操作。"
				},
				"0005011087" : {
					"cause" : "没有主机兼容此虚拟机。",
					"desc" : "没有主机兼容此虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011088" : {
					"cause" : "挂载光驱时填写的参数有误。",
					"desc" : "挂载光驱时填写的参数有误。",
					"solution" : "请联系系统管理员。"
				},
				"0005011089" : {
					"cause" : "该虚拟机已锁定DVD驱动托盘，因此DVD无法弹出。",
					"desc" : "该虚拟机已锁定DVD驱动托盘，因此DVD无法弹出。",
					"solution" : "请重启虚拟机。"
				},
				"0005011090" : {
					"cause" : "驱动为空，操作无法进行。",
					"desc" : "驱动为空，操作无法进行。",
					"solution" : "请确认驱动是否为空。"
				},
				"0005011091" : {
					"cause" : "文件路径错误或安装文件不存在。",
					"desc" : "文件路径错误或安装文件不存在。",
					"solution" : "请检查路径是否正确或路径下是否存在该安装文件。"
				},
				"0005011092" : {
					"cause" : "虚拟机绑定HBA卡失败。",
					"desc" : "虚拟机绑定HBA卡失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005011093" : {
					"cause" : "虚拟机解绑定HBA卡失败。",
					"desc" : "虚拟机解绑定HBA卡失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005011094" : {
					"cause" : "此HBA卡已绑定到其它虚拟机上。",
					"desc" : "此HBA卡已绑定到其它虚拟机上。",
					"solution" : "请选择其它HBA卡。"
				},
				"0005011095" : {
					"cause" : "虚拟机已绑定有HBA卡。",
					"desc" : "虚拟机已绑定有HBA卡。",
					"solution" : "请首先解绑定此HBA卡。"
				},
				"0005011096" : {
					"cause" : "虚拟机没有绑定HBA卡。",
					"desc" : "虚拟机没有绑定HBA卡。",
					"solution" : "虚拟机没有绑定HBA卡，因此无法执行解绑定操作。"
				},
				"0005011097" : {
					"cause" : "虚拟机没有内存交换磁盘，无法停止虚拟机。",
					"desc" : "虚拟机没有内存交换磁盘，无法停止虚拟机。",
					"solution" : "请开启虚拟机内存交换磁盘开关"
				},
				"0005011098" : {
					"cause" : "虚拟机已经被纳入FusionManager。",
					"desc" : "虚拟机已经被纳入FusionManager。",
					"solution" : "请选择未被纳入FusionManager的虚拟机。"
				},
				"0005011099" : {
					"cause" : "不支持纳管应用实例的虚拟机。",
					"desc" : "不支持纳管应用实例的虚拟机。",
					"solution" : "请选择不属于应用实例的虚拟机。"
				},
				"0005011100" : {
					"cause" : "指定的数据存储中存在源虚拟机不可访问的数据存储。",
					"desc" : "指定的数据存储中存在源虚拟机不可访问的数据存储。",
					"solution" : "请选择其它存储。"
				},
				"0005011101" : {
					"cause" : "无法访问虚拟机配置文件。",
					"desc" : "无法访问虚拟机配置文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011102" : {
					"cause" : "该任务已经取消或者完成。",
					"desc" : "该任务已经取消或者完成。",
					"solution" : "请刷新页面。"
				},
				"0005011103" : {
					"cause" : "Vmware远程调用异常。",
					"desc" : "Vmware远程调用异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011104" : {
					"cause" : "Vmware运行时异常。",
					"desc" : "Vmware运行时异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011105" : {
					"cause" : "该任务无法取消。",
					"desc" : "该任务无法取消。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011106" : {
					"cause" : "可能由迁移过程中虚拟机状态发生变化导致。",
					"desc" : "可能由迁移过程中虚拟机状态发生变化导致。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011107" : {
					"cause" : "主机恢复挂起的虚拟机失败。",
					"desc" : "主机恢复挂起的虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011108" : {
					"cause" : "虚拟机当前状态不允许此操作，请关闭虚拟机后重试。",
					"desc" : "虚拟机当前状态不允许此操作，请关闭虚拟机后重试。",
					"solution" : "请关闭虚拟机后重试。"
				},
				"0005011109" : {
					"cause" : "配置iCache操作部分失败。",
					"desc" : "配置iCache操作部分失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011110" : {
					"cause" : "当前存储类型不支持配置iCache。",
					"desc" : "当前存储类型不支持配置iCache。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011111" : {
					"cause" : "操作iCache失败。",
					"desc" : "操作iCache失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011112" : {
					"cause" : "集群下不存在支持创建延迟置零磁盘的存储。",
					"desc" : "集群下不存在支持创建延迟置零磁盘的存储。",
					"solution" : "请选择其他类型。"
				},
				"0005011113" : {
					"cause" : "虚拟机正在创建中，不支持该操作。",
					"desc" : "虚拟机正在创建中，不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011114" : {
					"cause" : "自定义规格不存在，请重新输入。",
					"desc" : "自定义规格不存在，请重新输入。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011115" : {
					"cause" : "导入或导出模板时，主机上报失败。",
					"desc" : "导入或导出模板时，主机上报失败。",
					"solution" : "请检查主机是否正常。"
				},
				"0005011116" : {
					"cause" : "主机无法连接共享目录。",
					"desc" : "主机无法连接共享目录。",
					"solution" : "请检查共享目录权限。"
				},
				"0005011117" : {
					"cause" : "解析XML文件失败。",
					"desc" : "解析XML文件失败。",
					"solution" : "请检查XML文件格式是否合法。"
				},
				"0005011118" : {
					"cause" : "镜像与XML文件不匹配，请检查镜像文件。",
					"desc" : "镜像与XML文件不匹配，请检查镜像文件。",
					"solution" : "请检查镜像文件。"
				},
				"0005011119" : {
					"cause" : "“磁盘大小”参数不合法，请重新输入。",
					"desc" : "“磁盘大小”参数不合法，请重新输入。",
					"solution" : "请重新输入。"
				},
				"0005011120" : {
					"cause" : "补丁操作时查询卷失败。",
					"desc" : "补丁操作时查询卷失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011121" : {
					"cause" : "虚拟机系统卷不存在。",
					"desc" : "虚拟机系统卷不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011122" : {
					"cause" : "虚拟机系统卷不支持补丁操作。",
					"desc" : "虚拟机系统卷不支持补丁操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011123" : {
					"cause" : "虚拟机补丁安装失败。",
					"desc" : "虚拟机补丁安装失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011124" : {
					"cause" : "虚拟机操作系统类型不支持此操作。",
					"desc" : "虚拟机操作系统类型不支持此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011125" : {
					"cause" : "磁盘的大小超过数据存储支持的最大值。",
					"desc" : "磁盘的大小超过数据存储支持的最大值。",
					"solution" : "请确认数据存储支持的最大值。"
				},
				"0005011126" : {
					"cause" : "虚拟机用户取消休眠。",
					"desc" : "虚拟机用户取消休眠。",
					"solution" : "请确认。"
				},
				"0005011127" : {
					"cause" : "共享磁盘必须是不受快照影响磁盘。",
					"desc" : "共享磁盘必须是不受快照影响磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011128" : {
					"cause" : "虚拟机的网卡不存在或不可用。",
					"desc" : "虚拟机的网卡不存在或不可用。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011129" : {
					"cause" : "指定的虚拟机当前未运行在指定主机上。",
					"desc" : "指定的虚拟机当前未运行在指定主机上。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011130" : {
					"cause" : "指定虚拟机被xHA保护，该操作无法进行。",
					"desc" : "指定虚拟机被xHA保护，该操作无法进行。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011131" : {
					"cause" : "无其他可用主机以存放虚拟机。",
					"desc" : "无其他可用主机以存放虚拟机。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011132" : {
					"cause" : "找不到可用的启动盘。",
					"desc" : "找不到可用的启动盘。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011133" : {
					"cause" : "磁盘正在创建中，不允许该操作。",
					"desc" : "磁盘正在创建中，不允许该操作。",
					"solution" : "请稍后重试。"
				},
				"0005011134" : {
					"cause" : "无法找到包含内核的分区。",
					"desc" : "无法找到包含内核的分区。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011135" : {
					"cause" : "您尝试在一台主机上运行一台虚拟机，该主机没有获得该虚拟机需要的存储的访问权限。",
					"desc" : "您尝试在一台主机上运行一台虚拟机，该主机没有获得该虚拟机需要的存储的访问权限。",
					"solution" : "请联系系统管理员或查看帮助手册%u300"
				},
				"0005011136" : {
					"cause" : "快照删除失败。",
					"desc" : "快照删除失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011137" : {
					"cause" : "创建虚拟机失败，当前虚拟化环境不支持静态IP注入的网络。",
					"desc" : "创建虚拟机失败，当前虚拟化环境不支持静态IP注入的网络。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011138" : {
					"cause" : "系统拷贝磁盘失败，请重试。",
					"desc" : "系统拷贝磁盘失败，请重试。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011139" : {
					"cause" : "虚拟机没有内存交换磁盘，内存预留必须和内存大小相等。",
					"desc" : "虚拟机没有内存交换磁盘，内存预留必须和内存大小相等。",
					"solution" : "请开户内存交换磁盘或者检查内存预留值与内存大小是否一致。"
				},
				"0005011140" : {
					"cause" : "系统创建存储设备失败。",
					"desc" : "系统创建存储设备失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011141" : {
					"cause" : "系统删除存储设备失败。",
					"desc" : "系统删除存储设备失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011142" : {
					"cause" : "系统发生未知错误。",
					"desc" : "系统发生未知错误。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011143" : {
					"cause" : "修改XML文件名失败。",
					"desc" : "修改XML文件名失败。",
					"solution" : "请检查共享目录的操作权限。"
				},
				"0005011144" : {
					"cause" : "系统创建导出目录失败。",
					"desc" : "系统创建导出目录失败。",
					"solution" : "请检查共享目录的操作权限。"
				},
				"0005011145" : {
					"cause" : "主机执行命令失败。",
					"desc" : "主机执行命令失败。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005011146" : {
					"cause" : "不允许绑定维护模式的主机。",
					"desc" : "不允许绑定维护模式的主机。",
					"solution" : "请联系系统管理员或者查看帮助文档。"
				},
				"0005011147" : {
					"cause" : "由于关机过程中虚拟机重启或内部异常，关机失败，请登录虚拟机查看系统日志。",
					"desc" : "由于关机过程中虚拟机重启或内部异常，关机失败，请登录虚拟机查看系统日志。",
					"solution" : "请登录虚拟机查看系统日志。"
				},
				"0005011148" : {
					"cause" : "系统内部错误。",
					"desc" : "系统内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011149" : {
					"cause" : "注册修复虚拟机任务失败。",
					"desc" : "注册修复虚拟机任务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011150" : {
					"cause" : "停止虚拟机失败。",
					"desc" : "停止虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011151" : {
					"cause" : "用虚拟机模板克隆新的虚拟机失败。",
					"desc" : "用虚拟机模板克隆新的虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011152" : {
					"cause" : "卸载旧虚拟机的磁盘失败。",
					"desc" : "卸载旧虚拟机的磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011153" : {
					"cause" : "卸载新虚拟机的磁盘失败。",
					"desc" : "卸载新虚拟机的磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011154" : {
					"cause" : "将新虚拟机磁盘挂载到旧虚拟机上失败。",
					"desc" : "将新虚拟机磁盘挂载到旧虚拟机上失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011155" : {
					"cause" : "将修复好的虚拟机的磁盘挂载到故障虚拟机上失败。",
					"desc" : "将修复好的虚拟机的磁盘挂载到故障虚拟机上失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011156" : {
					"cause" : "启动虚拟机失败。",
					"desc" : "启动虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011157" : {
					"cause" : "删除新虚拟机失败。",
					"desc" : "删除新虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011158" : {
					"cause" : "虚拟机正在执行其它任务，无法执行此操作，请稍后重试。",
					"desc" : "虚拟机正在执行其它任务，无法执行此操作，请稍后重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011159" : {
					"cause" : "磁盘所在的存储剩余容量不足。",
					"desc" : "磁盘所在的存储剩余容量不足。",
					"solution" : "请对磁盘所在存储扩容。"
				},
				"0005011160" : {
					"cause" : "只支持将磁盘容量调大。",
					"desc" : "只支持将磁盘容量调大。",
					"solution" : "请输入比当前磁盘容量大的数值。"
				},
				"0005011161" : {
					"cause" : "集群下不存在支持创建精简配置磁盘的存储。",
					"desc" : "集群下不存在支持创建精简配置磁盘的存储。",
					"solution" : "请重新选择合适的集群进行操作。"
				},
				"0005011162" : {
					"cause" : "目的主机故障。",
					"desc" : "目的主机故障。",
					"solution" : "请检查目的主机状态是否正常。"
				},
				"0005011163" : {
					"cause" : "无法访问虚拟机文件。",
					"desc" : "无法访问虚拟机文件。",
					"solution" : "请检查虚拟机文件是否存在。"
				},
				"0005011164" : {
					"cause" : "目标存储空间不足。",
					"desc" : "目标存储空间不足。",
					"solution" : "请检查目标存储的空间是否足够。"
				},
				"0005011165" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请检查参数。"
				},
				"0005011166" : {
					"cause" : "目标存储不支持迁移。",
					"desc" : "目标存储不支持迁移。",
					"solution" : "请检查目标数据存储是否支持迁移。"
				},
				"0005011167" : {
					"cause" : "无法访问目标数据存储。",
					"desc" : "无法访问目标数据存储。",
					"solution" : "请检查目标存储的状态是否正常。"
				},
				"0005011168" : {
					"cause" : "模板虚拟机不支持迁移。",
					"desc" : "模板虚拟机不支持迁移。",
					"solution" : "请确认虚拟机是否为模板虚拟机。"
				},
				"0005011169" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011170" : {
					"cause" : "迁移超时。",
					"desc" : "迁移超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011171" : {
					"cause" : "配置错误。",
					"desc" : "配置错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011172" : {
					"cause" : "当前虚拟机正在执行冷迁移，无法执行该操作。",
					"desc" : "当前虚拟机正在执行冷迁移，无法执行该操作。",
					"solution" : "请确认虚拟机状态是否正常。"
				},
				"0005011173" : {
					"cause" : "注册卷失败。",
					"desc" : "注册卷失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011174" : {
					"cause" : "虚拟机状态不正确。",
					"desc" : "虚拟机状态不正确。",
					"solution" : "请确认虚拟机状态。"
				},
				"0005011175" : {
					"cause" : "虚拟机时钟模式不合法。",
					"desc" : "虚拟机时钟模式不合法。",
					"solution" : "请选择合适的虚拟机时钟模式。"
				},
				"0005011176" : {
					"cause" : "虚拟机操作系统不支持打开CPU热插开关。",
					"desc" : "虚拟机操作系统不支持打开CPU热插开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011177" : {
					"cause" : "虚拟机不支持启用CPU热插拔。",
					"desc" : "虚拟机不支持启用CPU热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011178" : {
					"cause" : "CPU热插拔开关非法。",
					"desc" : "CPU热插拔开关非法。",
					"solution" : "请选择合适的CPU热插拔开关。"
				},
				"0005011179" : {
					"cause" : "虚拟机操作系统不支持打开内存热插开关。",
					"desc" : "虚拟机操作系统不支持打开内存热插开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011180" : {
					"cause" : "内存热插拔开关非法。",
					"desc" : "内存热插拔开关非法。",
					"solution" : "请选择合适的内存热插拔开关。"
				},
				"0005011181" : {
					"cause" : "主机返回失败。",
					"desc" : "主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011182" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011183" : {
					"cause" : "发送消息到主机失败。",
					"desc" : "发送消息到主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011184" : {
					"cause" : "主机返回失败。",
					"desc" : "主机返回失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011185" : {
					"cause" : "在线修改CPU成功，修改内存重启生效。",
					"desc" : "在线修改CPU成功，修改内存重启生效。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011186" : {
					"cause" : "在线修改CPU重启生效，修改内存成功。",
					"desc" : "在线修改CPU重启生效，修改内存成功。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011187" : {
					"cause" : "存在不受快照影响磁盘的虚拟机不能做内存快照。",
					"desc" : "存在不受快照影响磁盘的虚拟机不能做内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011188" : {
					"cause" : "磁盘不存在或不属于虚拟机。",
					"desc" : "磁盘不存在或不属于虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011189" : {
					"cause" : "虚拟机必须为关机或开机。",
					"desc" : "虚拟机必须为关机或开机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011190" : {
					"cause" : "运行态且有快照的虚拟机不能迁移磁盘。",
					"desc" : "运行态且有快照的虚拟机不能迁移磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011191" : {
					"cause" : "虚拟机存在共享磁盘，不能进行该操作。",
					"desc" : "虚拟机存在共享磁盘，不能进行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011192" : {
					"cause" : "虚拟机是链接克隆虚拟机，不允许该操作。",
					"desc" : "虚拟机是链接克隆虚拟机，不允许该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011193" : {
					"cause" : "准备磁盘失败。",
					"desc" : "准备磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011194" : {
					"cause" : "计算节点准备迁移失败。",
					"desc" : "计算节点准备迁移失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011195" : {
					"cause" : "VMWARE不支持此操作。",
					"desc" : "VMWARE不支持此操作。",
					"solution" : "请在FusionCompute下执行。"
				},
				"0005011196" : {
					"cause" : "主机与数据存储未关联。",
					"desc" : "主机与数据存储未关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011197" : {
					"cause" : "无法访问虚拟机磁盘。",
					"desc" : "无法访问虚拟机磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011198" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请刷新后重试。"
				},
				"0005011199" : {
					"cause" : "文件模式虚拟机不支持整机迁移。",
					"desc" : "文件模式虚拟机不支持整机迁移。",
					"solution" : "请选择非文件模式的虚拟机迁移。"
				},
				"0005011200" : {
					"cause" : "虚拟机磁盘存在多种不同的存储类型，不允许创建快照。",
					"desc" : "虚拟机磁盘存在多种不同的存储类型，不允许创建快照。",
					"solution" : "请查看帮助手册。"
				},
				"0005011201" : {
					"cause" : "虚拟机配置错误。",
					"desc" : "虚拟机配置错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011202" : {
					"cause" : "不支持该操作。",
					"desc" : "不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011203" : {
					"cause" : "虚拟机不支持CPU热插拔。",
					"desc" : "虚拟机不支持CPU热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011204" : {
					"cause" : "虚拟机状态冲突，不允许此操作。",
					"desc" : "虚拟机状态冲突，不允许此操作。",
					"solution" : "请刷新虚拟机的状态。"
				},
				"0005011205" : {
					"cause" : "该虚拟机不支持内存热插拔。",
					"desc" : "该虚拟机不支持内存热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011206" : {
					"cause" : "虚拟设备的数量超过最大值。",
					"desc" : "虚拟设备的数量超过最大值。",
					"solution" : "请联系系统管理员。"
				},
				"0005011207" : {
					"cause" : "主机故障不允许操作。",
					"desc" : "主机故障不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011208" : {
					"cause" : "VMWare产品没有足够的licenses。",
					"desc" : "VMWare产品没有足够的licenses。",
					"solution" : "请联系技术支持工程师，购买VMWare产品的licenses，并注册，方可使用。"
				},
				"0005011209" : {
					"cause" : "VMware Tools响应异常",
					"desc" : "VMware Tools响应异常",
					"solution" : "请联系系统管理员"
				},
				"0005011210" : {
					"cause" : "创建虚拟机时自定义配置虚拟机失败。",
					"desc" : "创建虚拟机时自定义配置虚拟机失败。",
					"solution" : "请检查虚拟机模板的配置是否正确。"
				},
				"0005011211" : {
					"cause" : "资源不足，无法满足配置的HA故障切换级别。",
					"desc" : "资源不足，无法满足配置的HA故障切换级别。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"0005011212" : {
					"cause" : "主机的CPU资源不足，无法满足预留。",
					"desc" : "主机的CPU资源不足，无法满足预留。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"0005011213" : {
					"cause" : "主机的内存资源不足，无法满足预留。",
					"desc" : "主机的内存资源不足，无法满足预留。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"0005011214" : {
					"cause" : "磁盘没有挂在在虚拟机上，不能进行扩容操作。",
					"desc" : "磁盘没有挂在在虚拟机上，不能进行扩容操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011215" : {
					"cause" : "请求中的虚拟机id错误。",
					"desc" : "请求中的虚拟机id错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011216" : {
					"cause" : "目标磁盘大小应大于原磁盘大小。",
					"desc" : "目标磁盘大小应大于原磁盘大小。",
					"solution" : "请修改扩容的大小。"
				},
				"0005011217" : {
					"cause" : "该磁盘存在快照或为链接克隆虚拟机的系统磁盘。",
					"desc" : "该磁盘存在快照或为链接克隆虚拟机的系统磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011218" : {
					"cause" : "系统错误。",
					"desc" : "系统错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011219" : {
					"cause" : "磁盘扩容正在进行，单个虚拟机不能同时操作多个磁盘扩容任务。",
					"desc" : "磁盘扩容正在进行，单个虚拟机不能同时操作多个磁盘扩容任务。",
					"solution" : "请稍等。"
				},
				"0005011220" : {
					"cause" : "模板虚拟机不能进行磁盘扩容。",
					"desc" : "模板虚拟机不能进行磁盘扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011221" : {
					"cause" : "目标磁盘大小应小于最大上限。",
					"desc" : "目标磁盘大小应小于最大上限。",
					"solution" : "请修改扩容的大小。"
				},
				"0005011222" : {
					"cause" : "共享磁盘不允许扩容。",
					"desc" : "共享磁盘不允许扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011223" : {
					"cause" : "当前存类型不支持创建非持久化磁盘差分磁盘.",
					"desc" : "当前存类型不支持创建非持久化磁盘差分磁盘.",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011224" : {
					"cause" : "非持久化磁盘必须是不受快照影响磁盘。",
					"desc" : "非持久化磁盘必须是不受快照影响磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011225" : {
					"cause" : "磁盘必须是普通磁盘才能设置为非持久化",
					"desc" : "磁盘必须是普通磁盘才能设置为非持久化",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011226" : {
					"cause" : "磁盘必须是虚拟化存储才能进行非持久化设置",
					"desc" : "磁盘必须是虚拟化存储才能进行非持久化设置",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011227" : {
					"cause" : "BSB无法查询到指定磁盘",
					"desc" : "BSB无法查询到指定磁盘",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011228" : {
					"cause" : "磁盘状态或绑定的虚拟机状态冲突，无法修改磁盘持久化属性",
					"desc" : "磁盘状态或绑定的虚拟机状态冲突，无法修改磁盘持久化属性",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011229" : {
					"cause" : "当前存储类型不支持创建精简磁盘。",
					"desc" : "当前存储类型不支持创建精简磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011230" : {
					"cause" : "磁盘存在快照，不允许修改不受快照影响参数。",
					"desc" : "磁盘存在快照，不允许修改不受快照影响参数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011231" : {
					"cause" : "磁盘不支持迁移",
					"desc" : "磁盘不支持迁移",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011232" : {
					"cause" : "目的数据存储不是虚拟化存储，不支持迁移。",
					"desc" : "目的数据存储不是虚拟化存储，不支持迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011233" : {
					"cause" : "扩容磁盘失败。",
					"desc" : "扩容磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011234" : {
					"cause" : "磁盘大小不是1024的倍数。",
					"desc" : "磁盘大小不是1024的倍数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011235" : {
					"cause" : "查询磁盘迁移进度超时",
					"desc" : "查询磁盘迁移进度超时",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011236" : {
					"cause" : "任务被取消",
					"desc" : "任务被取消",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011237" : {
					"cause" : "无主机可同时访问源数据存储和目的数据存储",
					"desc" : "无主机可同时访问源数据存储和目的数据存储",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011238" : {
					"cause" : "磁盘正在迁移中。",
					"desc" : "磁盘正在迁移中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011239" : {
					"cause" : "参数refreshflag无效",
					"desc" : "参数refreshflag无效",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011240" : {
					"cause" : "调用FusionStorage协议扩容磁盘失败。",
					"desc" : "调用FusionStorage协议扩容磁盘失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011241" : {
					"cause" : "非持久化磁盘不能设置为受快照影响磁盘。",
					"desc" : "非持久化磁盘不能设置为受快照影响磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011242" : {
					"cause" : "虚拟机没有磁盘，无法设置为硬盘启动。",
					"desc" : "虚拟机没有磁盘，无法设置为硬盘启动。",
					"solution" : "请选择合适的启动方式。"
				},
				"0005011243" : {
					"cause" : "虚拟机计算机名不满足规则：主机名长度不超过13、只包含字母、数字和中划线且不能纯数字。",
					"desc" : "虚拟机计算机名不满足规则：主机名长度不超过13、只包含字母、数字和中划线且不能纯数字。",
					"solution" : "请选择合适的计算机名。"
				},
				"0005011244" : {
					"cause" : "虚拟机模板没有安装VMware Tools，部署虚拟机自定义配置（计算机名称）失败。",
					"desc" : "虚拟机模板没有安装VMware Tools，部署虚拟机自定义配置（计算机名称）失败。",
					"solution" : "请给虚拟机模板安装最新的Vmware Tools。"
				},
				"0005011245" : {
					"cause" : "虚拟机创建或配置失败，设备清单中包含无效的值。",
					"desc" : "虚拟机创建或配置失败，设备清单中包含无效的值。",
					"solution" : "请联系系统管理员。"
				},
				"0005011246" : {
					"cause" : "当前虚拟化环境不支持该操作。",
					"desc" : "当前虚拟化环境不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011247" : {
					"cause" : "该存储类型不支持冷迁移。",
					"desc" : "该存储类型不支持冷迁移。",
					"solution" : "请保证虚拟机在运行，如果已经运行，请联系技术工程师。"
				},
				"0005011248" : {
					"cause" : "虚拟机的当前配置不支持基本块存储向虚拟化热迁移。",
					"desc" : "虚拟机的当前配置不支持基本块存储向虚拟化热迁移。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011249" : {
					"cause" : "该磁盘存在父节点，不允许此操作。",
					"desc" : "该磁盘存在父节点，不允许此操作。",
					"solution" : "null"
				},
				"0005011250" : {
					"cause" : "容灾存储组内存储资源不足，无法执行该操作。",
					"desc" : "容灾存储组内存储资源不足，无法执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011251" : {
					"cause" : "小于2043G的磁盘最大只能扩容到2043G。",
					"desc" : "小于2043G的磁盘最大只能扩容到2043G。",
					"solution" : "请重新输入磁盘大小。"
				},
				"0005011252" : {
					"cause" : "磁盘大小大于目标存储最大磁盘规格。",
					"desc" : "磁盘大小大于目标存储最大磁盘规格。",
					"solution" : "请选择其它目标存储。"
				},
				"0005011253" : {
					"cause" : "非持久化磁盘不支持在线扩容。",
					"desc" : "非持久化磁盘不支持在线扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011254" : {
					"cause" : "非虚拟化磁盘不支持在线克隆。",
					"desc" : "非虚拟化磁盘不支持在线克隆。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011255" : {
					"cause" : "模板和链接克隆虚拟机所在的数据存储必须是相同的存储类型。",
					"desc" : "模板和链接克隆虚拟机所在的数据存储必须是相同的存储类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011256" : {
					"cause" : "模板和链接克隆虚拟机不支持跨FusionStorage类型的数据存储部署。",
					"desc" : "模板和链接克隆虚拟机不支持跨FusionStorage类型的数据存储部署。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011257" : {
					"cause" : "目的主机的CPU配置与当前虚拟机的CPU配置不兼容，迁移虚拟机失败。",
					"desc" : "目的主机的CPU配置与当前虚拟机的CPU配置不兼容，迁移虚拟机失败。",
					"solution" : "请确认主机CPU配置与当前虚拟机的CPU配置兼容。"
				},
				"0005011258" : {
					"cause" : "系统正在执行其他任务，请稍后再试。",
					"desc" : "系统正在执行其他任务，请稍后再试。",
					"solution" : "请稍后再试。"
				},
				"0005011259" : {
					"cause" : "虚拟机有备份策略或备份集，不允许转为模板。",
					"desc" : "虚拟机有备份策略或备份集，不允许转为模板。",
					"solution" : "请先删除备份策略或备份集。"
				},
				"0005012001" : {
					"cause" : "未发现新的存储。",
					"desc" : "未发现新的存储。",
					"solution" : "请查看新的存储设备是否工作正常。"
				},
				"0005012002" : {
					"cause" : "该存储已被资源集群绑定，删除失败。",
					"desc" : "该存储已被资源集群绑定，删除失败。",
					"solution" : "请先删除绑定的资源集群或减容资源集群中的该存储。"
				},
				"0005012003" : {
					"cause" : "磁盘列表和磁盘数同时存在。",
					"desc" : "磁盘列表和磁盘数同时存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012004" : {
					"cause" : "tier层无有效的磁盘参数。",
					"desc" : "tier层无有效的磁盘参数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012005" : {
					"cause" : "没有有效的tier层。",
					"desc" : "没有有效的tier层。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012006" : {
					"cause" : "存储名称太长或太短。",
					"desc" : "存储名称太长或太短。",
					"solution" : "请填写合适的名称长度。"
				},
				"0005012007" : {
					"cause" : "threshold参数不在有效范围内。",
					"desc" : "threshold参数不在有效范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012008" : {
					"cause" : "迁移模式设置不在规定范围。",
					"desc" : "迁移模式设置不在规定范围。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012009" : {
					"cause" : "RAIDlv设置不在规定范围。",
					"desc" : "RAIDlv设置不在规定范围。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012010" : {
					"cause" : "磁盘类型与tier冲突。",
					"desc" : "磁盘类型与tier冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012011" : {
					"cause" : "无效的热备策略。",
					"desc" : "无效的热备策略。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012012" : {
					"cause" : "未知的磁盘类型。",
					"desc" : "未知的磁盘类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012013" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012014" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012015" : {
					"cause" : "存储名称重复。",
					"desc" : "存储名称重复。",
					"solution" : "请重新输入名称。"
				},
				"0005012016" : {
					"cause" : "选用的磁盘小于该RAID的剩余（或最小）磁盘数。",
					"desc" : "选用的磁盘小于该RAID的剩余（或最小）磁盘数。",
					"solution" : "请添加磁盘。"
				},
				"0005012017" : {
					"cause" : "选用的磁盘状态异常，需检查磁盘状态。",
					"desc" : "选用的磁盘状态异常，需检查磁盘状态。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012018" : {
					"cause" : "选用的磁盘已被占用。",
					"desc" : "选用的磁盘已被占用。",
					"solution" : "请重新选择磁盘。"
				},
				"0005012019" : {
					"cause" : "空间不足，无法创建迁移任务。",
					"desc" : "空间不足，无法创建迁移任务。",
					"solution" : "请重新迁移。"
				},
				"0005012020" : {
					"cause" : "FusionStorage存储类型不支持迁移。",
					"desc" : "FusionStorage存储类型不支持迁移。",
					"solution" : "请确认存储类型。"
				},
				"0005012021" : {
					"cause" : "空间不足，无法创建迁移任务。",
					"desc" : "空间不足，无法创建迁移任务。",
					"solution" : "请确认数据存储空间。"
				},
				"0005012022" : {
					"cause" : "数据存储不存在。",
					"desc" : "数据存储不存在。",
					"solution" : "请确认数据存储是否存在。"
				},
				"0005012023" : {
					"cause" : "内存交换磁盘不允许卸载。",
					"desc" : "内存交换磁盘不允许卸载。",
					"solution" : "请选择合适的磁盘进行卸载操作。"
				},
				"0005012024" : {
					"cause" : "共享磁盘不允许格式化。",
					"desc" : "共享磁盘不允许格式化。",
					"solution" : "请选择合适的磁盘进行操作。"
				},
				"0005012025" : {
					"cause" : "数据存储的存储类型不支持创建精简磁盘。",
					"desc" : "数据存储的存储类型不支持创建精简磁盘。",
					"solution" : "请选择合适的数据存储进行操作。"
				},
				"0005012026" : {
					"cause" : "存储池中有LUN存在，删除失败。",
					"desc" : "存储池中有LUN存在，删除失败。",
					"solution" : "请先删除存储池中的LUN。"
				},
				"0005012027" : {
					"cause" : "该虚拟机/模板存在未完成的任务，待任务完成后重试。",
					"desc" : "该虚拟机/模板存在未完成的任务，待任务完成后重试。",
					"solution" : "待任务完成后重试。"
				},
				"0005012028" : {
					"cause" : "存储池剩余容量不足。",
					"desc" : "存储池剩余容量不足。",
					"solution" : "请确认存储池剩余容量。"
				},
				"0005012029" : {
					"cause" : "指定的存储池不存在。",
					"desc" : "指定的存储池不存在。",
					"solution" : "请确认存储池是否存在。"
				},
				"0005012030" : {
					"cause" : "创建LUN超时。",
					"desc" : "创建LUN超时。",
					"solution" : "请重新创建"
				},
				"0005012031" : {
					"cause" : "与SAN设备通信失败。",
					"desc" : "与SAN设备通信失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012032" : {
					"cause" : "数据存储正在删除或创建，不允许更新。",
					"desc" : "数据存储正在删除或创建，不允许更新。",
					"solution" : "请稍后重试。"
				},
				"0005012033" : {
					"cause" : "存储中有IO存在。",
					"desc" : "存储中有IO存在。",
					"solution" : "请稍后重试。"
				},
				"0005012034" : {
					"cause" : "数据存储不可访问。",
					"desc" : "数据存储不可访问。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012035" : {
					"cause" : "存储资源不支持该操作。",
					"desc" : "存储资源不支持该操作。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005012036" : {
					"cause" : "资源分区不存在。",
					"desc" : "资源分区不存在。",
					"solution" : "请确认资源分区是否存在。"
				},
				"0005012037" : {
					"cause" : "容灾存储组名称重复。",
					"desc" : "容灾存储组名称重复。",
					"solution" : "请更改容灾存储组名后再进行操作。"
				},
				"0005012038" : {
					"cause" : "选择的存储无法添加到当前容灾存储组。",
					"desc" : "选择的存储无法添加到当前容灾存储组。",
					"solution" : "请确认所选存储列表中不存在任何已添加到其他容灾存储组的存储。"
				},
				"0005012039" : {
					"cause" : "容灾存储组中存在存储，不允许删除。",
					"desc" : "容灾存储组中存在存储，不允许删除。",
					"solution" : "请先删除容灾存储组中的存储。"
				},
				"0005012040" : {
					"cause" : "容灾存储组不存在。",
					"desc" : "容灾存储组不存在。",
					"solution" : "请确认容灾存储组是否存在。"
				},
				"0005012041" : {
					"cause" : "数据存储未在FusionManager中记录，请更新虚拟化环境再试。",
					"desc" : "数据存储未在FusionManager中记录，请更新虚拟化环境再试。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005012042" : {
					"cause" : "数据存储不存在，请刷新页面再试。",
					"desc" : "数据存储不存在，请刷新页面再试。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005012043" : {
					"cause" : "指定的存储不存在。",
					"desc" : "指定的存储不存在。",
					"solution" : "指定的存储不存在。"
				},
				"0005012044" : {
					"cause" : "绑定数据存储失败。",
					"desc" : "绑定数据存储失败。",
					"solution" : "请减容数据存储后再操作。"
				},
				"0005012045" : {
					"cause" : "当前虚拟机没有绑定磁盘。",
					"desc" : "当前虚拟机没有绑定磁盘。",
					"solution" : "请确认该虚拟机是否存在磁盘。"
				},
				"0005012046" : {
					"cause" : "存储处于维护模式，不允许该操作。",
					"desc" : "存储处于维护模式，不允许该操作。",
					"solution" : "请将存储退出维护模式。"
				},
				"0005012047" : {
					"cause" : "存储类型为FusionStorage的磁盘最大容量是16383G。",
					"desc" : "存储类型为FusionStorage的磁盘最大容量是16383G。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012048" : {
					"cause" : "存储类型不是ipsan或dsware。",
					"desc" : "存储类型不是ipsan或dsware。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012049" : {
					"cause" : "选择的磁盘中，存在不允许存储迁移的磁盘。",
					"desc" : "选择的磁盘中，存在不允许存储迁移的磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012050" : {
					"cause" : "当前存储类型不支持创建普通延迟置零磁盘。",
					"desc" : "当前存储类型不支持创建普通延迟置零磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012051" : {
					"cause" : "数据存储正在添加中。",
					"desc" : "数据存储正在添加中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012052" : {
					"cause" : "数据存储正在删除中。",
					"desc" : "数据存储正在删除中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012053" : {
					"cause" : "系统可能出现异常，请排查。",
					"desc" : "系统可能出现异常，请排查。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012054" : {
					"cause" : "系统可能出现异常，请排查。",
					"desc" : "系统可能出现异常，请排查。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012055" : {
					"cause" : "磁盘ID为空。",
					"desc" : "磁盘ID为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012056" : {
					"cause" : "磁盘正在创建备份或者恢复，不能再进行创建备份或者恢复。",
					"desc" : "磁盘正在创建备份或者恢复，不能再进行创建备份或者恢复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012057" : {
					"cause" : "数据存储状态异常。",
					"desc" : "数据存储状态异常。",
					"solution" : "请检查数据存储状态。"
				},
				"0005012058" : {
					"cause" : "null",
					"desc" : "null",
					"solution" : "请配置CS云备份服务器。"
				},
				"0005012059" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012060" : {
					"cause" : "datastore不存在。",
					"desc" : "datastore不存在。",
					"solution" : "请联系系统管理员。"
				},
				"0005012061" : {
					"cause" : "卷被冻结。",
					"desc" : "卷被冻结。",
					"solution" : "请联系系统管理员。"
				},
				"0005012062" : {
					"cause" : "卷状态不是冻结状态。",
					"desc" : "卷状态不是冻结状态。",
					"solution" : "请联系系统管理员。"
				},
				"0005012063" : {
					"cause" : "未挂载的卷不允许卸载。",
					"desc" : "未挂载的卷不允许卸载。",
					"solution" : "请联系系统管理员。"
				},
				"0005012064" : {
					"cause" : "计量配置路径创建失败。",
					"desc" : "计量配置路径创建失败。",
					"solution" : "请联系系统管理员。"
				},
				"0005012065" : {
					"cause" : "该卷没有挂载到指定的虚拟机无法执行卸载卷操作。",
					"desc" : "该卷没有挂载到指定的虚拟机无法执行卸载卷操作。",
					"solution" : "请联系系统管理员。"
				},
				"0005012066" : {
					"cause" : "卷状态为非创建状态不能被删除。",
					"desc" : "卷状态为非创建状态不能被删除。",
					"solution" : "请联系系统管理员。"
				},
				"0005012067" : {
					"cause" : "卷所在的集群与虚拟机所在的集群不一致。",
					"desc" : "卷所在的集群与虚拟机所在的集群不一致。",
					"solution" : "请联系系统管理员。"
				},
				"0005012068" : {
					"cause" : "卷所在的虚拟化环境类型和虚拟机不一致。",
					"desc" : "卷所在的虚拟化环境类型和虚拟机不一致。",
					"solution" : "请联系系统管理员。"
				},
				"0005012069" : {
					"cause" : "集群下存储介质为“SAN-SATA”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-SATA”类型的数据存储资源不足。",
					"solution" : "请联系系统管理员。"
				},
				"0005012070" : {
					"cause" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足。",
					"solution" : "请联系系统管理员。"
				},
				"0005012071" : {
					"cause" : "集群下存储介质为“SAN-SSD”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-SSD”类型的数据存储资源不足。",
					"solution" : "请联系系统管理员。"
				},
				"0005012072" : {
					"cause" : "集群下存储介质为“SAN-SAS&FC”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-SAS&FC”类型的数据存储资源不足。",
					"solution" : "请联系系统管理员。"
				},
				"0005012073" : {
					"cause" : "可能的原因：1、集群下存储或CPU资源不足；2、集群下无满足磁盘存储条件的存储；3、创建虚拟机选择的模板虚拟机不可用。",
					"desc" : "可能的原因：1、集群下存储或CPU资源不足；2、集群下无满足磁盘存储条件的存储；3、创建虚拟机选择的模板虚拟机不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012074" : {
					"cause" : "卷正在被虚拟机使用。",
					"desc" : "卷正在被虚拟机使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012075" : {
					"cause" : "不允许对该主机执行该类操作，否则会导致与虚拟化环境断连。",
					"desc" : "不允许对该主机执行该类操作，否则会导致与虚拟化环境断连。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012076" : {
					"cause" : "指定的存储资源不足或者无法使虚拟机正常启动。",
					"desc" : "指定的存储资源不足或者无法使虚拟机正常启动。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012077" : {
					"cause" : "集群下容灾存储资源不足或者无法找到满足虚拟机能够正常启动的容灾存储。",
					"desc" : "集群下容灾存储资源不足或者无法找到满足虚拟机能够正常启动的容灾存储。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012078" : {
					"cause" : "指定主机下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"desc" : "指定主机下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012079" : {
					"cause" : "NAS存储普通磁盘不支持在线扩容。",
					"desc" : "NAS存储普通磁盘不支持在线扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012080" : {
					"cause" : "本地盘不能挂载到虚拟机。",
					"desc" : "本地盘不能挂载到虚拟机。",
					"solution" : "本地盘不能挂载到虚拟机。"
				},
				"0005012081" : {
					"cause" : "本地盘不能从虚拟机上卸载。",
					"desc" : "本地盘不能从虚拟机上卸载。",
					"solution" : "本地盘不能从虚拟机上卸载。"
				},
				"0005012082" : {
					"cause" : "该磁盘不存在或者已经被删除或者没有权限进行此操作。",
					"desc" : "该磁盘不存在或者已经被删除或者没有权限进行此操作。",
					"solution" : "该磁盘不存在或者已经被删除或者没有权限进行此操作。"
				},
				"0005013001" : {
					"cause" : "服务器已被使用，删除失败。",
					"desc" : "服务器已被使用，删除失败。",
					"solution" : "若要删除服务器，请从确保没有基础设施服务在使用该服务器。"
				},
				"0005013002" : {
					"cause" : "未发现新的服务器。",
					"desc" : "未发现新的服务器。",
					"solution" : "请查看新的服务器是否工作正常。"
				},
				"0005013003" : {
					"cause" : "服务器批量操作失败。",
					"desc" : "服务器批量操作失败。",
					"solution" : "请查看各服务器操作结果。"
				},
				"0005013004" : {
					"cause" : "管理虚拟机所在服务器不能进行上下电、重启、隔离操作。",
					"desc" : "管理虚拟机所在服务器不能进行上下电、重启、隔离操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013005" : {
					"cause" : "非虚拟化资源集群的服务器不能进行安全下电、安全重启、进入、退出维护模式操作。",
					"desc" : "非虚拟化资源集群的服务器不能进行安全下电、安全重启、进入、退出维护模式操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013006" : {
					"cause" : "该服务器不存在，上电失败。",
					"desc" : "该服务器不存在，上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013007" : {
					"cause" : "该服务器不存在，上电失败。",
					"desc" : "该服务器不存在，上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013008" : {
					"cause" : "该服务器不存在，下电失败。",
					"desc" : "该服务器不存在，下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013009" : {
					"cause" : "该服务器不存在，下电失败。",
					"desc" : "该服务器不存在，下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013010" : {
					"cause" : "该服务器不存在，重启失败。",
					"desc" : "该服务器不存在，重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013011" : {
					"cause" : "该服务器不存在，重启失败。",
					"desc" : "该服务器不存在，重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013012" : {
					"cause" : "该服务器不存在，进入维护模式失败。",
					"desc" : "该服务器不存在，进入维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013013" : {
					"cause" : "该服务器不存在，退出维护模式失败。",
					"desc" : "该服务器不存在，退出维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013014" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013015" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013016" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013017" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013018" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013019" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013020" : {
					"cause" : "系统异常，服务器进入维护模式失败。",
					"desc" : "系统异常，服务器进入维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013021" : {
					"cause" : "系统异常，服务器退出维护模式失败。",
					"desc" : "系统异常，服务器退出维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013022" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013023" : {
					"cause" : "系统异常，服务器上电失败。",
					"desc" : "系统异常，服务器上电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013024" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013025" : {
					"cause" : "系统异常，服务器下电失败。",
					"desc" : "系统异常，服务器下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013026" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013027" : {
					"cause" : "系统异常，服务器重启失败。",
					"desc" : "系统异常，服务器重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013028" : {
					"cause" : "服务器进入维护模式失败",
					"desc" : "服务器进入维护模式失败",
					"solution" : "进入维护模式前请迁移或者关闭服务器上运行的虚拟机"
				},
				"0005013029" : {
					"cause" : "系统异常，服务器退出维护模式失败。",
					"desc" : "系统异常，服务器退出维护模式失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013030" : {
					"cause" : "主机已经进入维护模式，不能重复操作。",
					"desc" : "主机已经进入维护模式，不能重复操作。",
					"solution" : "请联系系统管理员。"
				},
				"0005013031" : {
					"cause" : "服务器当前状态无法退出维护模式，请稍后再试。",
					"desc" : "服务器当前状态无法退出维护模式，请稍后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013032" : {
					"cause" : "该服务器未加入虚拟化环境，安全下电失败。",
					"desc" : "该服务器未加入虚拟化环境，安全下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013033" : {
					"cause" : "系统异常，安全下电失败。",
					"desc" : "系统异常，安全下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013034" : {
					"cause" : "系统异常，安全下电失败。",
					"desc" : "系统异常，安全下电失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013035" : {
					"cause" : "该服务器未加入虚拟化环境，安全重启失败。",
					"desc" : "该服务器未加入虚拟化环境，安全重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013036" : {
					"cause" : "系统异常，安全重启失败。",
					"desc" : "系统异常，安全重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013037" : {
					"cause" : "系统异常，安全重启失败。",
					"desc" : "系统异常，安全重启失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013038" : {
					"cause" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"desc" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"solution" : "请稍候重试。"
				},
				"0005013039" : {
					"cause" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"desc" : "系统已经存在正在运行的全部上电或全部下电任务。",
					"solution" : "请稍候重试。"
				},
				"0005013040" : {
					"cause" : "启动应用失败。",
					"desc" : "启动应用失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013041" : {
					"cause" : "停止应用失败。",
					"desc" : "停止应用失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013042" : {
					"cause" : "启动FusionStorage服务失败。",
					"desc" : "启动FusionStorage服务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013043" : {
					"cause" : "停止FusionStorage服务失败。",
					"desc" : "停止FusionStorage服务失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013044" : {
					"cause" : "上电服务器失败。",
					"desc" : "上电服务器失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013045" : {
					"cause" : "下电服务器失败。",
					"desc" : "下电服务器失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013046" : {
					"cause" : "用户名(安全名称)或密码错误。",
					"desc" : "用户名(安全名称)或密码错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013047" : {
					"cause" : "发现设备失败。",
					"desc" : "发现设备失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013048" : {
					"cause" : "输入的刀片个数多于实际个数。",
					"desc" : "输入的刀片个数多于实际个数。",
					"solution" : "请确认刀片个数是否正确。"
				},
				"0005013049" : {
					"cause" : "设备重复接入。",
					"desc" : "设备重复接入。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013050" : {
					"cause" : "批量导入文件格式错误。",
					"desc" : "批量导入文件格式错误。",
					"solution" : "请下载最新的批量接入模板。"
				},
				"0005013051" : {
					"cause" : "批量接入模板参数填写不符合规则。",
					"desc" : "批量接入模板参数填写不符合规则。",
					"solution" : "请检查填写的模板参数。"
				},
				"0005013052" : {
					"cause" : "BMC用户名密码不正确或帐号被锁定。",
					"desc" : "BMC用户名密码不正确或帐号被锁定。",
					"solution" : "请确认主机的BMC用户名和密码。"
				},
				"0005013053" : {
					"cause" : "OS用户名密码不正确或帐号被锁定。",
					"desc" : "OS用户名密码不正确或帐号被锁定。",
					"solution" : "请确认主机的OS用户名和密码。"
				},
				"0005013054" : {
					"cause" : "批量接入模板为空。",
					"desc" : "批量接入模板为空。",
					"solution" : "请检查填写的模板参数。"
				},
				"0005013055" : {
					"cause" : "批量接入模板参数填写不符合规则。",
					"desc" : "批量接入模板参数填写不符合规则。",
					"solution" : "请检查填写的模板参数。"
				},
				"0005013056" : {
					"cause" : "批量接入模板参数填写不符合规则。",
					"desc" : "批量接入模板参数填写不符合规则。",
					"solution" : "请检查填写的模板参数。"
				},
				"0005013057" : {
					"cause" : "设置主机启动选项失败，请检查所选择的主机状态是否正常。",
					"desc" : "设置主机启动选项失败，请检查所选择的主机状态是否正常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013058" : {
					"cause" : "部分刀片接入失败。",
					"desc" : "部分刀片接入失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013059" : {
					"cause" : "设备名称重复。",
					"desc" : "设备名称重复。",
					"solution" : "请检查参数。"
				},
				"0005013060" : {
					"cause" : "正在发现设备规格，请稍后重试。",
					"desc" : "正在发现设备规格，请稍后重试。",
					"solution" : "正在发现设备规格，请稍后重试。"
				},
				"0005013061" : {
					"cause" : "资源分区名称重复。",
					"desc" : "资源分区名称重复。",
					"solution" : "请检查参数。"
				},
				"0005013062" : {
					"cause" : "非就绪状态下服务器主机信息输入不完全。",
					"desc" : "非就绪状态下服务器主机信息输入不完全。",
					"solution" : "请输入完整的服务器主机信息。"
				},
				"0005013063" : {
					"cause" : "基本信息非法。",
					"desc" : "基本信息非法。",
					"solution" : "请检查填写的模板参数。"
				},
				"0005013064" : {
					"cause" : "主机未接入虚拟化环境。",
					"desc" : "主机未接入虚拟化环境。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013065" : {
					"cause" : "主机不在集群中。",
					"desc" : "主机不在集群中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013066" : {
					"cause" : "服务器类型不支持刷新规格。",
					"desc" : "服务器类型不支持刷新规格。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013067" : {
					"cause" : "OS用户名密码不正确或帐号被锁定或SSH连接超时。",
					"desc" : "OS用户名密码不正确或帐号被锁定或SSH连接超时。",
					"solution" : "请确认主机的OS用户名和密码。"
				},
				"0005013068" : {
					"cause" : "无可用主机以完成该指定操作。",
					"desc" : "无可用主机以完成该指定操作。",
					"solution" : "请联系系统管理员。"
				},
				"0005013069" : {
					"cause" : "无法执行该操作。该主机上未安装HA软件。",
					"desc" : "无法执行该操作。该主机上未安装HA软件。",
					"solution" : "请在该主机上安装HA软件。"
				},
				"0005013070" : {
					"cause" : "主机运行在紧急模式下无法进行该操作。",
					"desc" : "主机运行在紧急模式下无法进行该操作。",
					"solution" : "请联系系统管理员。"
				},
				"0005013071" : {
					"cause" : "指定主机被禁用，需重启主机后才能启用该主机。",
					"desc" : "指定主机被禁用，需重启主机后才能启用该主机。",
					"solution" : "请重启主机。"
				},
				"0005013072" : {
					"cause" : "主机可用内存不足，操作无法进行。",
					"desc" : "主机可用内存不足，操作无法进行。",
					"solution" : "请联系系统管理员或查看帮助手册。"
				},
				"0005013073" : {
					"cause" : "虚拟机所在主机需要先设置监控账户。",
					"desc" : "虚拟机所在主机需要先设置监控账户。",
					"solution" : "请设置主机监控账户。"
				},
				"0005013074" : {
					"cause" : "启动共享存储上的虚拟机失败。",
					"desc" : "启动共享存储上的虚拟机失败。",
					"solution" : "请参考子任务的处理建议。"
				},
				"0005013075" : {
					"cause" : "禁止主备倒换失败或停止CNA节点主机失败。",
					"desc" : "禁止主备倒换失败或停止CNA节点主机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013076" : {
					"cause" : "关闭共享存储上的虚拟机失败。",
					"desc" : "关闭共享存储上的虚拟机失败。",
					"solution" : "请参考子任务的处理建议。"
				},
				"0005013077" : {
					"cause" : "BMC用户名密码不正确或帐号被锁定。",
					"desc" : "BMC用户名密码不正确或帐号被锁定。",
					"solution" : "请确认主机的BMC用户名和密码。"
				},
				"0005013078" : {
					"cause" : "从Dsware主机列表中获取第三个LCNA失败。",
					"desc" : "从Dsware主机列表中获取第三个LCNA失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013079" : {
					"cause" : "将主机加入逻辑集群失败。",
					"desc" : "将主机加入逻辑集群失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013080" : {
					"cause" : "管理集群下未发现主机。",
					"desc" : "管理集群下未发现主机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005013081" : {
					"cause" : "关联host失败。",
					"desc" : "关联host失败。",
					"solution" : "请联系技术支持工程师%u300"
				},
				"0005013082" : {
					"cause" : "扩容主机未就绪。",
					"desc" : "扩容主机未就绪。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005101000" : {
					"cause" : "VPC规格不存在。",
					"desc" : "VPC规格不存在。",
					"solution" : "VPC规格不存在。"
				},
				"0005101001" : {
					"cause" : "VPC规格数量达到最大值16。",
					"desc" : "VPC规格数量达到最大值16。",
					"solution" : "VPC规格数量达到最大值16。"
				},
				"0005101002" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "名称重复。"
				},
				"0005101003" : {
					"cause" : "VSA虚拟机模板不存在。",
					"desc" : "VSA虚拟机模板不存在。",
					"solution" : "请发现VSA虚拟机模板。"
				},
				"0005101004" : {
					"cause" : "VPC内存在网络，无法删除。",
					"desc" : "VPC内存在网络，无法删除。",
					"solution" : "请先删除VPC内的网络。"
				},
				"0005101005" : {
					"cause" : "VPC内存在路由器，无法删除。",
					"desc" : "VPC内存在路由器，无法删除。",
					"solution" : "请先删除VPC内的路由器。"
				},
				"0005101006" : {
					"cause" : "VPC内存在磁盘，无法删除。",
					"desc" : "VPC内存在磁盘，无法删除。",
					"solution" : "请先删除VPC内的磁盘。"
				},
				"0005101007" : {
					"cause" : "VPC内存在虚拟机，无法删除。",
					"desc" : "VPC内存在虚拟机，无法删除。",
					"solution" : "请先删除VPC内的虚拟机。"
				},
				"0005101008" : {
					"cause" : "VPC内存在安全组，无法删除。",
					"desc" : "VPC内存在安全组，无法删除。",
					"solution" : "请先删除VPC内的安全组。"
				},
				"0005101010" : {
					"cause" : "IP带宽规格数量达到最大值128。",
					"desc" : "IP带宽规格数量达到最大值128。",
					"solution" : "IP带宽规格数量达到最大值128。"
				},
				"0005101012" : {
					"cause" : "非法的安全组规则协议。",
					"desc" : "非法的安全组规则协议。",
					"solution" : "请输入正确的安全组规则协议。"
				},
				"0005101013" : {
					"cause" : "非法的安全组规则协议端口。",
					"desc" : "非法的安全组规则协议端口。",
					"solution" : "请输入正确的安全组规则协议端口。"
				},
				"0005101014" : {
					"cause" : "VDC指定的外部网络个数超过系统规格。",
					"desc" : "VDC指定的外部网络个数超过系统规格。",
					"solution" : "请减少指定的外部网络。"
				},
				"0005102000" : {
					"cause" : "VPC内不存在路由器。",
					"desc" : "VPC内不存在路由器。",
					"solution" : "请在VPC中申请路由器。"
				},
				"0005102001" : {
					"cause" : "网络中不存在IPv4 Subnet。",
					"desc" : "网络中不存在IPv4 Subnet。",
					"solution" : "请在网络中添加IPv4 Subnet。"
				},
				"0005102002" : {
					"cause" : "非法的ipv4子网IP。",
					"desc" : "非法的ipv4子网IP。",
					"solution" : "请输入正确的ipv4子网IP。"
				},
				"0005102003" : {
					"cause" : "非法的ipv4子网掩码。",
					"desc" : "非法的ipv4子网掩码。",
					"solution" : "请输入正确的ipv4子网掩码。"
				},
				"0005102004" : {
					"cause" : "非法的ipv4网关IP。",
					"desc" : "非法的ipv4网关IP。",
					"solution" : "请输入正确的ipv4网关IP。"
				},
				"0005102005" : {
					"cause" : "非法的ipv4可用IP地址段。",
					"desc" : "非法的ipv4可用IP地址段。",
					"solution" : "请输入正确的ipv4可用IP地址段。"
				},
				"0005102006" : {
					"cause" : "网关不在ipv4子网内。",
					"desc" : "网关不在ipv4子网内。",
					"solution" : "请输入的网关在ipv4子网内。"
				},
				"0005102007" : {
					"cause" : "可用IP地址段不在ipv4子网内。",
					"desc" : "可用IP地址段不在ipv4子网内。",
					"solution" : "请输入的可用IP地址段在ipv4子网内。"
				},
				"0005102008" : {
					"cause" : "非法的网关IP，网关在ipv4可用IP地址段内。",
					"desc" : "非法的网关IP，网关在ipv4可用IP地址段内。",
					"solution" : "请输入的网关不要在ipv4可用IP地址段内。"
				},
				"0005102009" : {
					"cause" : "ipv4可用IP地址段重叠。",
					"desc" : "ipv4可用IP地址段重叠。",
					"solution" : "请输入的ipv4可用IP地址段不重叠。"
				},
				"0005102010" : {
					"cause" : "非法的ipv4 DNS IP。",
					"desc" : "非法的ipv4 DNS IP。",
					"solution" : "请输入合法的ipv4 DNS IP。"
				},
				"0005102011" : {
					"cause" : "非法的ipv6子网IP。",
					"desc" : "非法的ipv6子网IP。",
					"solution" : "请输入正确的ipv6子网IP。"
				},
				"0005102012" : {
					"cause" : "非法的ipv6子网掩码。",
					"desc" : "非法的ipv6子网掩码。",
					"solution" : "请输入正确的ipv6子网掩码。"
				},
				"0005102013" : {
					"cause" : "非法的ipv6网关IP。",
					"desc" : "非法的ipv6网关IP。",
					"solution" : "请输入正确的ipv6网关IP。"
				},
				"0005102014" : {
					"cause" : "非法的ipv6可用IP地址段。",
					"desc" : "非法的ipv6可用IP地址段。",
					"solution" : "请输入正确的ipv6可用IP地址段。"
				},
				"0005102015" : {
					"cause" : "网关不在ipv6子网内。",
					"desc" : "网关不在ipv6子网内。",
					"solution" : "请输入的网关在ipv6子网内。"
				},
				"0005102016" : {
					"cause" : "可用IP地址段不在ipv6子网内。",
					"desc" : "可用IP地址段不在ipv6子网内。",
					"solution" : "请输入的可用IP地址段在ipv6子网内。"
				},
				"0005102017" : {
					"cause" : "非法的网关IP，网关在ipv6可用IP地址段内。",
					"desc" : "非法的网关IP，网关在ipv6可用IP地址段内。",
					"solution" : "请输入的网关不要在ipv6可用IP地址段内。"
				},
				"0005102018" : {
					"cause" : "ipv6可用IP地址段重叠。",
					"desc" : "ipv6可用IP地址段重叠。",
					"solution" : "请输入的ipv6可用IP地址段不重叠。"
				},
				"0005102019" : {
					"cause" : "非法的ipv6 DNS IP。",
					"desc" : "非法的ipv6 DNS IP。",
					"solution" : "请输入合法的ipv6 DNS IP。"
				},
				"0005102020" : {
					"cause" : "非法的ipv4 子网信息。",
					"desc" : "非法的ipv4 子网信息。",
					"solution" : "请输入合法的ipv4子网信息。"
				},
				"0005102021" : {
					"cause" : "非法的ipv6 子网信息。",
					"desc" : "非法的ipv6 子网信息。",
					"solution" : "请输入合法的ipv6子网信息。"
				},
				"0005102022" : {
					"cause" : "DNS信息重复。",
					"desc" : "DNS信息重复。",
					"solution" : "请输入不重复的DNS信息。"
				},
				"0005102023" : {
					"cause" : "弹性IP不存在。",
					"desc" : "弹性IP不存在。",
					"solution" : "请申请弹性IP。"
				},
				"0005102024" : {
					"cause" : "弹性IP绑定VM。",
					"desc" : "弹性IP绑定VM。",
					"solution" : "请解绑定VM上的弹性IP。"
				},
				"0005102025" : {
					"cause" : "名称不合法。",
					"desc" : "名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005102026" : {
					"cause" : "描述不合法。",
					"desc" : "描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005102027" : {
					"cause" : "虚拟机配额不足，无法创建VPC。",
					"desc" : "虚拟机配额不足，无法创建VPC。",
					"solution" : "虚拟机配额不足，无法创建VPC。"
				},
				"0005102028" : {
					"cause" : "vCPU配额不足，无法创建VPC。",
					"desc" : "vCPU配额不足，无法创建VPC。",
					"solution" : "vCPU配额不足，无法创建VPC。"
				},
				"0005102029" : {
					"cause" : "内存配额不足，无法创建VPC。",
					"desc" : "内存配额不足，无法创建VPC。",
					"solution" : "内存配额不足，无法创建VPC。"
				},
				"0005102030" : {
					"cause" : "存储配额不足，无法创建VPC。",
					"desc" : "存储配额不足，无法创建VPC。",
					"solution" : "存储配额不足，无法创建VPC。"
				},
				"0005102031" : {
					"cause" : "弹性IP地址配额不足，无法创建VPC。",
					"desc" : "弹性IP地址配额不足，无法创建VPC。",
					"solution" : "弹性IP地址配额不足，无法创建VPC。"
				},
                "0005102032" : {
					"cause" : "可供VDC分配的 VXLAN 不足。",
					"desc" : "可供VDC分配的 VXLAN 不足。",
					"solution" : "请扩充预留的Vxlan范围。"
				},
                "0005102033" : {
					"cause" : "vpc互通所需的内部子网不足。",
					"desc" : "vpc互通所需的内部子网不足。",
					"solution" : "请联系技术支持。"
				},
                "0005102034" : {
					"cause" : "vxlanID在预留的vxlan范围内。",
					"desc" : "vxlanID在预留的vxlan范围内。",
					"solution" : "请选择合适的vxlan。"
				},
				"0005103001" : {
					"cause" : "安全组被其他安全组引用。",
					"desc" : "安全组被其他安全组引用。",
					"solution" : "请删除其他安全组的引用规则"
				},
				"0005103002" : {
					"cause" : "默认安全组不能被删除。",
					"desc" : "默认安全组不能被删除。",
					"solution" : "默认安全组不能被删除。"
				},
				"0005103003" : {
					"cause" : "防火墙下已经创建规则，不允许删除。",
					"desc" : "防火墙下已经创建规则，不允许删除。",
					"solution" : "请先删除规则后在尝试删除。"
				},
				"0005103004" : {
					"cause" : "VPC下没有防火墙不允许创建规则。",
					"desc" : "VPC下没有防火墙不允许创建规则。",
					"solution" : "请先创建防火墙后再创建规则。"
				},
				"0005103005" : {
					"cause" : "防火墙状态不允许创建规则。",
					"desc" : "防火墙不是就绪状态，不允许创建规则。",
					"solution" : "请在防火墙就绪后创建规则"
				},
				"0005103006" : {
					"cause" : "路由器下有防火墙，不允许释放。",
					"desc" : "路由器下有防火墙，不允许释放。",
					"solution" : "请先删除防火墙后在释放路由器。"
				},
                "0005103007" : {
					"cause" : "路由器下有弹性IP，不允许释放。",
					"desc" : "路由器下有弹性IP，不允许释放。",
					"solution" : "请先删除弹性IP后在释放路由器。"
				},
				"0005103023" : {
					"cause" : "网络关联VM。",
					"desc" : "网络关联VM。",
					"solution" : "请删除关联的VM网卡"
				},
				"0005103024" : {
					"cause" : "名称已存在。",
					"desc" : "名称已存在。",
					"solution" : "请重新输入名称。"
				},
				"0005200001" : {
					"cause" : "应用模板名称已存在",
					"desc" : "应用模板名称已存在",
					"solution" : "请更换应用模板名称"
				},
				"0005200002" : {
					"cause" : "应用模板数量超过上限",
					"desc" : "应用模板数量超过上限",
					"solution" : "请联系系统管理员，或查阅指导手册"
				},
				"0005200003" : {
					"cause" : "应用模板状态冲突，不支持该操作",
					"desc" : "应用模板状态冲突，不支持该操作",
					"solution" : "请联系系统管理员，或查阅指导手册"
				},
				"0005200004" : {
					"cause" : "应用模板不存在",
					"desc" : "应用模板不存在",
					"solution" : "请检查应用模板是否存在"
				},
				"0005200005" : {
					"cause" : "应用模板体为空",
					"desc" : "应用模板体为空",
					"solution" : "请确认应用模板JSON体非空"
				},
				"0005200006" : {
					"cause" : "文件不存在",
					"desc" : "文件不存在",
					"solution" : "请检查文件是否存在"
				},
				"0005200007" : {
					"cause" : "导出任务超过上限",
					"desc" : "导出任务超过上限",
					"solution" : "请联系系统管理员，或查阅指导手册"
				},
				"0005200008" : {
					"cause" : "导出任务不存在",
					"desc" : "导出任务不存在",
					"solution" : "请联系系统管理员，或查阅指导手册"
				},
				"0005200009" : {
					"cause" : "应用模板内容为空或者格式非法",
					"desc" : "应用模板内容为空或者格式非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200010" : {
					"cause" : "应用模板中资源存在相互依赖",
					"desc" : "应用模板中资源存在相互依赖",
					"solution" : "请检查应用模板内容"
				},
				"0005200011" : {
					"cause" : "应用模板格式非法",
					"desc" : "应用模板格式非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200012" : {
					"cause" : "应用模板不是JSON结构",
					"desc" : "应用模板不是JSON结构",
					"solution" : "请检查应用模板内容"
				},
				"0005200013" : {
					"cause" : "应用模板中不存在虚拟机资源",
					"desc" : "应用模板中不存在虚拟机资源",
					"solution" : "请检查应用模板内容"
				},
				"0005200014" : {
					"cause" : "应用模板中不存在任何资源",
					"desc" : "应用模板中不存在任何资源",
					"solution" : "请检查应用模板内容"
				},
				"0005200015" : {
					"cause" : "多个网卡被分配默认网关",
					"desc" : "多个网卡被分配默认网关",
					"solution" : "请检查应用模板内容"
				},
				"0005200016" : {
					"cause" : "虚拟机资源被多个伸缩组引用",
					"desc" : "虚拟机资源被多个伸缩组引用",
					"solution" : "请检查应用模板内容"
				},
				"0005200017" : {
					"cause" : "伸缩组包含多个虚拟机模板",
					"desc" : "伸缩组包含多个虚拟机模板",
					"solution" : "请检查应用模板内容"
				},
				"0005200018" : {
					"cause" : "虚拟机资源被另外一个虚拟机资源引用",
					"desc" : "虚拟机资源被另外一个虚拟机资源引用",
					"solution" : "请检查应用模板内容"
				},
				"0005200019" : {
					"cause" : "伸缩组中无虚拟机资源",
					"desc" : "伸缩组中无虚拟机资源",
					"solution" : "请检查应用模板内容"
				},
				"0005200020" : {
					"cause" : "伸缩组的最大值或最小值非法",
					"desc" : "伸缩组的最大值或最小值非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200021" : {
					"cause" : "伸缩组的期望值非法",
					"desc" : "伸缩组的期望值非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200022" : {
					"cause" : "伸缩组的冷却时间非法",
					"desc" : "伸缩组的冷却时间非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200023" : {
					"cause" : "伸缩组的组内策略非法",
					"desc" : "伸缩组的组内策略非法 ",
					"solution" : "请检查应用模板内容"
				},
				"0005200024" : {
					"cause" : "伸缩组数量超过上限",
					"desc" : "伸缩组数量超过上限",
					"solution" : "请检查伸缩组数量"
				},
				"0005200025" : {
					"cause" : "网络名称非法",
					"desc" : "网络名称非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200026" : {
					"cause" : "网络描述非法",
					"desc" : "网络描述非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200027" : {
					"cause" : "计算机名称非法",
					"desc" : "计算机名称非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200028" : {
					"cause" : "IP地址非法",
					"desc" : "IP地址非法",
					"solution" : "请检查应用模板内容"
				},
				"0005200029" : {
					"cause" : "应用实例不存在",
					"desc" : "应用实例不存在",
					"solution" : "请检查应用实例是否存在"
				},
				"0005200030" : {
					"cause" : "应用模板已被加锁",
					"desc" : "应用模板已被加锁",
					"solution" : "请先对模板解锁，再执行该操作"
				},
				"0005200031" : {
					"cause" : "虚拟机模板网卡未关联端口组",
					"desc" : "虚拟机模板网卡未关联端口组",
					"solution" : "请为虚拟机模板网卡关联端口组"
				},
				"0005200032" : {
					"cause" : "应用模板文件不存在",
					"desc" : "应用模板文件不存在",
					"solution" : "请检查模板文件是否存在"
				},
				"0005200033" : {
					"cause" : "应用模板文件大小超过最大限制",
					"desc" : "应用模板文件大小超过最大限制",
					"solution" : "请修改应用模板文件"
				},
				"0005200034" : {
					"cause" : "应用模板文件后缀名非法",
					"desc" : "应用模板文件后缀名非法",
					"solution" : "请修改应用模板文件"
				},
				"0005200035" : {
					"cause" : "应用虚拟机未绑定VLB",
					"desc" : "应用虚拟机未绑定VLB",
					"solution" : "请稍后重试"
				},
				"0005200037" : {
					"cause" : "虚拟机重复绑定VLB",
					"desc" : "虚拟机重复绑定VLB",
					"solution" : "请稍后重试."
				},
				"0005200038" : {
					"cause" : "仅一个网卡或IP绑定到一个VLB",
					"desc" : "仅一个网卡或IP绑定到一个VLB",
					"solution" : "请修改应用模板"
				},
				"0005200039" : {
					"cause" : "应用SG未绑定VLB",
					"desc" : "应用SG未绑定VLB",
					"solution" : "请稍后重试"
				},
				"0005200042" : {
					"cause" : "应用实例名称重复",
					"desc" : "应用实例名称重复",
					"solution" : "请重新指定应用名称"
				},
				"0005200043" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005200044" : {
					"cause" : "停止的应用数量已达到系统最大值。",
					"desc" : "停止的应用数量已达到系统最大值。",
					"solution" : "请稍后重试或联系管理员。"
				},
				"0005200045" : {
					"cause" : "当前应用状态不允许启动应用。",
					"desc" : "当前应用状态不允许启动应用。",
					"solution" : "请刷新后重试。"
				},
				"0005200046" : {
					"cause" : "当前应用状态不允许停止应用。",
					"desc" : "当前应用状态不允许停止应用。",
					"solution" : "请刷新后重试。"
				},
				"0005200047" : {
					"cause" : "启动的应用数量已达到系统最大值。",
					"desc" : "启动的应用数量已达到系统最大值。",
					"solution" : "请稍后重试。"
				},
				"0005200049" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "应用异常，请删除该应用。"
				},
				"0005200050" : {
					"cause" : "当前应用状态不支持修复。",
					"desc" : "当前应用状态不支持修复。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005200051" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005200052" : {
					"cause" : "应用实例数量达到系统限定最大值。",
					"desc" : "应用实例数量达到系统限定最大值。",
					"solution" : "应用实例数量达到系统限定最大值，请重试。"
				},
				"0005200053" : {
					"cause" : "应用实例数量达到组织限定最大值。",
					"desc" : "应用实例数量达到组织限定最大值。",
					"solution" : "应用实例数量达到组织限定最大值，请重试。"
				},
				"0005200054" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005200055" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005200056" : {
					"cause" : "当前应用状态不允许此操作",
					"desc" : "当前应用状态不允许此操作",
					"solution" : "操作之前请检查应用是否处于运行状态"
				},
				"0005200057" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005200058" : {
					"cause" : "虚拟机属于其他应用",
					"desc" : "虚拟机属于其他应用",
					"solution" : "请重新选择虚拟机"
				},
				"0005200059" : {
					"cause" : "虚拟机属于其他用户",
					"desc" : "虚拟机属于其他用户",
					"solution" : "请重新选择虚拟机"
				},
				"0005200060" : {
					"cause" : "一个虚拟机的多张网卡关联了VLB",
					"desc" : "一个虚拟机的多张网卡关联了VLB",
					"solution" : "一个虚拟机只能存在一张网卡关联了VLB"
				},
				"0005200061" : {
					"cause" : "虚拟机或伸缩组正在绑定或解绑VLB",
					"desc" : "虚拟机或伸缩组正在绑定或解绑VLB",
					"solution" : "请稍后重试"
				},
				"0005200062" : {
					"cause" : "应用模板中资源对象数量超过最大值",
					"desc" : "应用模板中资源对象数量超过最大值",
					"solution" : "请修改应用模板"
				},
				"0005200063" : {
					"cause" : "应用模板中的全局参数数量超过最大值",
					"desc" : "应用模板中的全局参数数量超过最大值",
					"solution" : "请修改应用模板"
				},
				"0005200064" : {
					"cause" : "应用模板中的输出参数数量超过最大值",
					"desc" : "应用模板中的输出参数数量超过最大值",
					"solution" : "请修改应用模板"
				},
				"0005200065" : {
					"cause" : "虚拟机中的软件数量超过最大值",
					"desc" : "虚拟机中的软件数量超过最大值",
					"solution" : "请修改应用模板"
				},
				"0005200066" : {
					"cause" : "应用模板中的伸缩组数量超过最大值",
					"desc" : "应用模板中的伸缩组数量超过最大值",
					"solution" : "请修改应用模板"
				},
				"0005200070" : {
					"cause" : "当前版本只支持NoEcho属性为false的应用模板",
					"desc" : "当前版本只支持NoEcho属性为false的应用模板",
					"solution" : "请重新设置应用模板中的NoEcho属性"
				},
				"0005201001" : {
					"cause" : "缺乏必选参数.",
					"desc" : "缺乏必选参数.",
					"solution" : "请输入必选参数."
				},
				"0005201002" : {
					"cause" : "内部服务错误.",
					"desc" : "内部服务错误.",
					"solution" : "请联系系统管理员."
				},
				"0005201003" : {
					"cause" : "数据库错误.",
					"desc" : "数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"0005201004" : {
					"cause" : "脚本（软件/ISO）不存在.",
					"desc" : "脚本（软件/ISO）不存在.",
					"solution" : "请联系系统管理员."
				},
				"0005201005" : {
					"cause" : "脚本（软件/ISO）文件不存在或者查询失败.",
					"desc" : "脚本（软件/ISO）文件不存在或者查询失败.",
					"solution" : "请联系系统管理员."
				},
				"0005201006" : {
					"cause" : "脚本（软件/ISO）文件路径为空.",
					"desc" : "脚本（软件/ISO）文件路径为空.",
					"solution" : "请手动输入脚本（软件/ISO）文件的路径."
				},
				"0005201007" : {
					"cause" : "脚本（软件/ISO）文件的路径非法.",
					"desc" : "脚本（软件/ISO）文件的路径非法.",
					"solution" : "请输入合法的脚本（软件/ISO）文件路径."
				},
				"0005201008" : {
					"cause" : "脚本（软件/ISO）ID重复.",
					"desc" : "脚本（软件/ISO）ID重复.",
					"solution" : "请联系系统管理员."
				},
				"0005201009" : {
					"cause" : "脚本（软件/ISO）名称在数据库中已经存在.",
					"desc" : "脚本（软件/ISO）名称在数据库中已经存在.",
					"solution" : "请输入其他脚本名称."
				},
				"0005201010" : {
					"cause" : "脚本（软件/ISO）数量超出最大数量限制.",
					"desc" : "脚本（软件/ISO）数量超出最大数量限制.",
					"solution" : "请联系系统管理员."
				},
				"0005201011" : {
					"cause" : "脚本（软件/ISO）文件不存在或者移动失败.",
					"desc" : "脚本（软件/ISO）文件不存在或者移动失败.",
					"solution" : "请联系系统管理员."
				},
				"0005201012" : {
					"cause" : "输入了非法的每页显示数.",
					"desc" : "输入了非法的每页显示数.",
					"solution" : "请输入合法的每页显示数."
				},
				"0005201013" : {
					"cause" : "输入了非法的分页起始数.",
					"desc" : "输入了非法的分页起始数.",
					"solution" : "请输入合法的分页起始数."
				},
				"0005201014" : {
					"cause" : "资源被占用.",
					"desc" : "资源被占用.",
					"solution" : "请联系系统管理员."
				},
				"0005201015" : {
					"cause" : "脚本（软件/ISO）文件不存在或者删除失败.",
					"desc" : "脚本（软件/ISO）文件不存在或者删除失败.",
					"solution" : "请联系系统管理员."
				},
				"0005201016" : {
					"cause" : "资源已经存在.",
					"desc" : "资源已经存在.",
					"solution" : "请联系系统管理员."
				},
				"0005201017" : {
					"cause" : "同步软件包/脚本失败",
					"desc" : "同步软件包/脚本失败",
					"solution" : "请联系管理员"
				},
				"0005201029" : {
					"cause" : "文件存储空间不足",
					"desc" : "文件存储空间不足",
					"solution" : "请联系管理员"
				},
				"0005202001" : {
					"cause" : "缺少必选参数.",
					"desc" : "缺少必选参数.",
					"solution" : "请输入必选参数."
				},
				"0005202002" : {
					"cause" : "输入的参数不合法.",
					"desc" : "输入的参数不合法.",
					"solution" : "请输入合法参数."
				},
				"0005202003" : {
					"cause" : "查询数据库错误.",
					"desc" : "查询数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"0005202004" : {
					"cause" : "内部服务错误.",
					"desc" : "内部服务错误.",
					"solution" : "请联系系统管理员."
				},
				"0005203001" : {
					"cause" : "输入的参数错误.",
					"desc" : "输入的参数错误.",
					"solution" : "请输入合法参数."
				},
				"0005203002" : {
					"cause" : "用户无操作权限.",
					"desc" : "用户无操作权限.",
					"solution" : "请联系系统管理员."
				},
				"0005203003" : {
					"cause" : "VM 数据库异常.",
					"desc" : "VM 数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"0005203004" : {
					"cause" : "调用IRM失败.",
					"desc" : "调用IRM失败.",
					"solution" : "请联系系统管理员."
				},
				"0005203005" : {
					"cause" : "虚拟机模板不存在.",
					"desc" : "虚拟机模板不存在.",
					"solution" : "请联系系统管理员."
				},
				"0005203006" : {
					"cause" : "注册状态不能删除.",
					"desc" : "注册状态不能删除.",
					"solution" : "请联系系统管理员."
				},
				"0005203007" : {
					"cause" : "虚拟机模板正被其他用户锁定，操作不允许.",
					"desc" : "虚拟机模板正被其他用户锁定，操作不允许.",
					"solution" : "请联系系统管理员."
				},
				"0005203008" : {
					"cause" : "用户所在域与资源所在域不匹配，操作不允许.",
					"desc" : "用户所在域与资源所在域不匹配，操作不允许.",
					"solution" : "请联系系统管理员."
				},
				"0005203009" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203011" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203012" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203013" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203014" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203015" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203017" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203019" : {
					"cause" : "虚拟机创建失败，不能制作成模板",
					"desc" : "虚拟机创建失败，不能制作成模板",
					"solution" : "请删除创建失败的虚拟机模板并重新创建"
				},
				"0005203020" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203021" : {
					"cause" : "共享文件路径不可为空",
					"desc" : "共享文件路径不可为空",
					"solution" : "请填写文件路径"
				},
				"0005203023" : {
					"cause" : "启动虚拟机失败",
					"desc" : "启动虚拟机失败",
					"solution" : "请联系技术支持工程师"
				},
				"0005203024" : {
					"cause" : "只有创建完成的虚拟机模板才可以修改",
					"desc" : "只有创建完成的虚拟机模板才可以修改",
					"solution" : "请刷新页面后重试"
				},
				"0005203025" : {
					"cause" : "把模板转换为虚拟机时出错",
					"desc" : "把模板转换为虚拟机时出错",
					"solution" : "请稍后重试或联系管理员"
				},
				"0005203026" : {
					"cause" : "虚拟机模板已经被发布",
					"desc" : "虚拟机模板已经被发布",
					"solution" : "请刷新页面后重试"
				},
				"0005203029" : {
					"cause" : "不存在可用的资源集群，无法创建虚拟机模板",
					"desc" : "不存在可用的资源集群，无法创建虚拟机模板",
					"solution" : "请联系管理员添加资源集群"
				},
				"0005203030" : {
					"cause" : "模板未制作完成或修改失败，不允许发布",
					"desc" : "模板未制作完成或修改失败，不允许发布",
					"solution" : "请完成虚拟机模板的制作或修改"
				},
				"0005203031" : {
					"cause" : "虚拟机模板已经取消发布",
					"desc" : "虚拟机模板已经取消发布",
					"solution" : "请刷新页面后重试"
				},
				"0005203032" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203033" : {
					"cause" : "虚拟机模板正在被应用模板使用，不允许取消发布",
					"desc" : "虚拟机模板正在被应用模板使用，不允许取消发布",
					"solution" : "请删除使用该虚拟机模板的应用模板后重试"
				},
				"0005203034" : {
					"cause" : "创建虚拟机模板失败，不允许挂载ISO文件",
					"desc" : "创建虚拟机模板失败，不允许挂载ISO文件",
					"solution" : "请删除该虚拟机模板重新创建"
				},
				"0005203035" : {
					"cause" : "模板制作完成时不允许挂载ISO文件",
					"desc" : "模板制作完成时不允许挂载ISO文件",
					"solution" : "请单击修改按钮进行虚拟机模板修改"
				},
				"0005203036" : {
					"cause" : "虚拟机模板已经发布时不允许挂载ISO文件",
					"desc" : "虚拟机模板已经发布时不允许挂载ISO文件",
					"solution" : "请取消发布后单击修改按钮进行虚拟机模板修改"
				},
				"0005203037" : {
					"cause" : "所选虚拟机不是由虚拟机模板创建，不能修复",
					"desc" : "所选虚拟机不是由虚拟机模板创建，不能修复",
					"solution" : "请联系技术支持工程师"
				},
				"0005203038" : {
					"cause" : "外部系统通信异常，如返回为空或字段不符等",
					"desc" : "外部系统通信异常，如返回为空或字段不符等",
					"solution" : "请联系管理员或查看帮助手册"
				},
				"0005203039" : {
					"cause" : "该虚拟机模板数据损坏或虚拟机模板不存在",
					"desc" : "该虚拟机模板数据损坏或虚拟机模板不存在",
					"solution" : "请删除此虚拟机模板"
				},
				"0005203040" : {
					"cause" : "虚拟机模板正在卸载ISO文件，不能执行挂载操作",
					"desc" : "虚拟机模板正在卸载ISO文件，不能执行挂载操作",
					"solution" : "请稍后重试"
				},
				"0005203041" : {
					"cause" : "已发布虚拟机模板个数已达到系统上限100个",
					"desc" : "已发布虚拟机模板个数已达到系统上限100个",
					"solution" : "请清理不需要且已经发布的虚拟机模板"
				},
				"0005203042" : {
					"cause" : "虚拟机模板正在用于创建虚拟机，不能进行该操作",
					"desc" : "虚拟机模板正在用于创建虚拟机，不能进行该操作",
					"solution" : "请稍后重试"
				},
				"0005203043" : {
					"cause" : "该虚拟机存在快照，无法转化为模板",
					"desc" : "该虚拟机存在快照，无法转化为模板",
					"solution" : "请删除该虚拟机的快照后重试"
				},
				"0005203044" : {
					"cause" : "虚拟机模板名称重复",
					"desc" : "虚拟机模板名称重复",
					"solution" : "请重新输入虚拟机模板名称"
				},
				"0005203045" : {
					"cause" : "只有未创建完成的虚拟机模板才能安装软件",
					"desc" : "只有未创建完成的虚拟机模板才能安装软件",
					"solution" : "请刷新后重试"
				},
				"0005203046" : {
					"cause" : "该虚拟机模板已经创建完成，不能进行该操作",
					"desc" : "该虚拟机模板已经创建完成，不能进行该操作",
					"solution" : "请联系管理员"
				},
				"0005203047" : {
					"cause" : "待修复虚拟机磁盘已经达到上限，不能修复",
					"desc" : "待修复虚拟机磁盘已经达到上限，不能修复",
					"solution" : "请联系技术支持工程师"
				},
				"0005203048" : {
					"cause" : "虚拟机状态冲突，只有运行中或已停止状态才能修复",
					"desc" : "虚拟机状态冲突，只有运行中或已停止状态才能修复",
					"solution" : "请确认虚拟机状态后再试"
				},
				"0005203049" : {
					"cause" : "系统资源不足",
					"desc" : "系统资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"0005203050" : {
					"cause" : "无法找到该虚拟机模板信息",
					"desc" : "无法找到该虚拟机模板信息",
					"solution" : "请联系技术支持工程师"
				},
				"0005203051" : {
					"cause" : "虚拟机模板正在被用于创建应用，不允许取消发布",
					"desc" : "虚拟机模板正在被用于创建应用，不允许取消发布",
					"solution" : "请稍后重试"
				},
				"0005203052" : {
					"cause" : "虚拟机已经为停止状态或休眠状态，不能执行该操作",
					"desc" : "虚拟机已经为停止状态或休眠状态，不能执行该操作",
					"solution" : "请联系技术支持工程师"
				},
				"0005203053" : {
					"cause" : "虚拟机正在执行此操作",
					"desc" : "虚拟机正在执行此操作",
					"solution" : "请联系技术支持工程师"
				},
				"0005203054" : {
					"cause" : "虚拟机正在休眠中",
					"desc" : "虚拟机正在休眠中",
					"solution" : "请联系技术支持工程师"
				},
				"0005203055" : {
					"cause" : "虚拟机为休眠状态，不能执行该操作",
					"desc" : "虚拟机为休眠状态，不能执行该操作",
					"solution" : "请启动该虚拟机后重试"
				},
				"0005203056" : {
					"cause" : "资源集群不存在",
					"desc" : "资源集群不存在",
					"solution" : "请重新选择资源集群"
				},
				"0005203057" : {
					"cause" : "没有匹配的虚拟机模板",
					"desc" : "没有匹配的虚拟机模板",
					"solution" : "请创建匹配的虚拟机模板"
				},
				"0005203058" : {
					"cause" : "桌面云模板用于创建桌面云虚拟机，不需要发布",
					"desc" : "桌面云模板用于创建桌面云虚拟机，不需要发布",
					"solution" : "请联系管理员"
				},
				"0005203059" : {
					"cause" : "虚拟机模板不是停止状态，不能发布",
					"desc" : "虚拟机模板不是停止状态，不能发布",
					"solution" : "请稍后重试或联系技术支持工程师"
				},
				"0005203060" : {
					"cause" : "虚拟机未转化为模板，不能发布",
					"desc" : "虚拟机未转化为模板，不能发布",
					"solution" : "请稍后重试或联系技术支持工程师"
				},
				"0005203061" : {
					"cause" : "虚拟机模板状态不允许修改",
					"desc" : "虚拟机模板状态不允许修改",
					"solution" : "请检查虚拟机模板状态"
				},
				"0005203062" : {
					"cause" : "策略不存在",
					"desc" : "策略不存在",
					"solution" : "请检查当前策略是否存在"
				},
				"0005203063" : {
					"cause" : "虚拟机模板正在发现中",
					"desc" : "虚拟机模板正在发现中",
					"solution" : "请联系技术支持工程师"
				},
				"0005203064" : {
					"cause" : "虚拟机模板已关联逻辑模板，不允许取消发布",
					"desc" : "虚拟机模板已关联逻辑模板，不允许取消发布",
					"solution" : "请去关联后重试"
				},
				"0005203065" : {
					"cause" : "虚拟机模板未发布，不允许关联逻辑模板",
					"desc" : "虚拟机模板未发布，不允许关联逻辑模板",
					"solution" : "请发布虚拟机模板后重试"
				},
				"0005203066" : {
					"cause" : "虚拟机模板已关联逻辑模板",
					"desc" : "虚拟机模板已关联逻辑模板",
					"solution" : "请去关联后重新关联逻辑模板"
				},
				"0005203067" : {
					"cause" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"desc" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"solution" : "请查看已关联的虚拟机模板"
				},
				"0005203068" : {
					"cause" : "虚拟机模板数量达到系统限定最大值",
					"desc" : "虚拟机模板数量达到系统限定最大值",
					"solution" : "删除不用的虚拟机模板，请慎重操作"
				},
				"0005203069" : {
					"cause" : "虚拟机模板不存在",
					"desc" : "虚拟机模板不存在",
					"solution" : "请联系技术支持工程师"
				},
				"0005203070" : {
					"cause" : "存在链接克隆虚拟机的模板不能转为虚拟机",
					"desc" : "存在链接克隆虚拟机的模板不能转为虚拟机",
					"solution" : "请选择其他虚拟机模板进行操作"
				},
				"0005203071" : {
					"cause" : "虚拟模板不存在关联关系",
					"desc" : "虚拟模板不存在关联关系",
					"solution" : "请联系管理员"
				},
				"0005203074" : {
					"cause" : "逻辑模板操作系统版本号不匹配，关联失败",
					"desc" : "逻辑模板操作系统版本号不匹配，关联失败",
					"solution" : "请联系管理员"
				},
				"0005203075" : {
					"cause" : "逻辑模板系统磁盘大小不匹配，关联失败",
					"desc" : "逻辑模板系统磁盘大小不匹配，关联失败",
					"solution" : "请联系管理员"
				},
				"0005203076" : {
					"cause" : "删除NFS模板失败",
					"desc" : "删除NFS模板失败",
					"solution" : "请联系管理员"
				},
				"0005205801" : {
					"cause" : "计划任务名称非法",
					"desc" : "计划任务名称非法",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205802" : {
					"cause" : "计划任务描述非法",
					"desc" : "计划任务描述非法",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205803" : {
					"cause" : "计划任务触发类型非法",
					"desc" : "计划任务触发类型非法",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205804" : {
					"cause" : "计划任务名称重复",
					"desc" : "计划任务名称重复",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205805" : {
					"cause" : "计划任务关联的策略不存在",
					"desc" : "计划任务关联的策略不存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205806" : {
					"cause" : "计划任务数量已达到最大值",
					"desc" : "计划任务数量已达到最大值",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205807" : {
					"cause" : "计划任务处于启动状态不能被删除",
					"desc" : "计划任务处于启动状态不能被删除",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205808" : {
					"cause" : "计划任务不存在",
					"desc" : "计划任务不存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"0005205809" : {
					"cause" : "该计划任务的状态为使能态，不能修改",
					"desc" : "该计划任务的状态为使能态，不能修改",
					"solution" : "You can change the status of the scheduleTask first."
				},
				"0005401010" : {
					"cause" : "普通用户不能查看服务模板。",
					"desc" : "普通用户不能查看服务模板。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402005" : {
					"cause" : "创建服务时，服务关联的服务目录不存在。",
					"desc" : "创建服务时，服务关联的服务目录不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402006" : {
					"cause" : "创建服务时，服务关联不是用户所在VDC下的服务目录。",
					"desc" : "创建服务时，服务关联不是用户所在VDC下的服务目录。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402007" : {
					"cause" : "只有系统管理员才能修改或者创建服务白名单。",
					"desc" : "只有系统管理员才能修改或者创建服务白名单。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402008" : {
					"cause" : "设置了白名单的开关，但是没有设置白名单的列表。",
					"desc" : "设置了白名单的开关，但是没有设置白名单的列表。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402009" : {
					"cause" : "输入的模板ID对应的服务模板不存在。",
					"desc" : "输入的模板ID对应的服务模板不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402010" : {
					"cause" : "普通用户不能操作服务。",
					"desc" : "普通用户不能操作服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402011" : {
					"cause" : "发布状态的服务不能删除。",
					"desc" : "发布状态的服务不能删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402012" : {
					"cause" : "不支持的动作类型。",
					"desc" : "不支持的动作类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402013" : {
					"cause" : "关联的目录个数超过最大8个限制。",
					"desc" : "关联的目录个数超过最大8个限制。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402014" : {
					"cause" : "上传图片大小操作20K限制。",
					"desc" : "上传图片大小操作20K限制。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402015" : {
					"cause" : "设置的VDC不存在。",
					"desc" : "设置的VDC不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402016" : {
					"cause" : "服务不存在。",
					"desc" : "服务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402017" : {
					"cause" : "用户无权查看服务详情。",
					"desc" : "用户无权查看服务详情。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402018" : {
					"cause" : "只能修改本VDC下的服务。",
					"desc" : "只能修改本VDC下的服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402019" : {
					"cause" : "只能删除本VDC下的服务。",
					"desc" : "只能删除本VDC下的服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402020" : {
					"cause" : "输入的服务目录id不存在。",
					"desc" : "输入的服务目录id不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402021" : {
					"cause" : "输入的服务id不存在。",
					"desc" : "输入的服务id不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402022" : {
					"cause" : "服务在发布状态，不允许修改",
					"desc" : "服务在发布状态，不允许修改。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402023" : {
					"cause" : "查询ICT、IT场景失败。",
					"desc" : "查询ICT、IT场景失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402024" : {
					"cause" : "用户无权限创建该服务。",
					"desc" : "用户无权限创建该服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402025" : {
					"cause" : "请确认上传的是真正的图片。",
					"desc" : "请确认上传的是真正的图片。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402026" : {
					"cause" : "只能操作本VDC的服务。",
					"desc" : "只能操作本VDC的服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402027" : {
					"cause" : "图片不存在。",
					"desc" : "图片不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402028" : {
					"cause" : "用户不能查看其他VDC下的图片。",
					"desc" : "用户不能查看其他VDC下的图片。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402029" : {
					"cause" : "用户不能删除其他VDC下的图片。",
					"desc" : "用户不能删除其他VDC下的图片。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402030" : {
					"cause" : "不能用类型不是默认图片或不是用户组织下的图片创服务。",
					"desc" : "不能用类型不是默认图片或不是用户组织下的图片创服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402031" : {
					"cause" : "系统管理员无权使用租户侧的接口。",
					"desc" : "系统管理员无权使用租户侧的接口。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402032" : {
					"cause" : "vdc上传图片已达最大个数。",
					"desc" : "vdc上传图片已达最大个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402033" : {
					"cause" : "上传图片格式不是系统支持的格式。",
					"desc" : "上传图片格式不是系统支持的格式。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402034" : {
					"cause" : "图片正在被服务使用，不能删除。",
					"desc" : "图片正在被服务使用，不能删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402035" : {
					"cause" : "服务参数与应用模板参数不一致，不能发布。请重新编辑服务后重试。",
					"desc" : "服务参数与应用模板参数不一致，不能发布。请重新编辑服务后重试。",
					"solution" : "请重新编辑服务后重试。"
				},
				"0005402036" : {
					"cause" : "vdc创的服务已经达到最大个数。",
					"desc" : "vdc创的服务已经达到最大个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402040" : {
					"cause" : "vdc服务只能是domain审批。",
					"desc" : "vdc服务只能是domain审批。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402041" : {
					"cause" : "非vdc服务只能是vdc manager审批。",
					"desc" : "非vdc服务只能是vdc manager审批。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403002" : {
					"cause" : "服务目录不存在，修改此服务目录失败。",
					"desc" : "服务目录不存在，修改此服务目录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403003" : {
					"cause" : "服务目录不存在，删除此服务目录失败。",
					"desc" : "服务目录不存在，删除此服务目录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403004" : {
					"cause" : "用户无权修改不是本VDC下的服务目录。",
					"desc" : "用户无权修改不是本VDC下的服务目录。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403005" : {
					"cause" : "VDC能查看服务目录已达系统最大个数，不允许再创建。",
					"desc" : "VDC能查看服务目录已达系统最大个数，不允许再创建。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403006" : {
					"cause" : "服务目录与当前用户不是同一VDC，不允许删除",
					"desc" : "服务目录与当前用户不是同一VDC，不允许删除",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403007" : {
					"cause" : "服务目录下有服务，不允许删除。",
					"desc" : "服务目录下有服务，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403008" : {
					"cause" : "domain 管理员只能看本VDC下的服务目录详情。",
					"desc" : "domain 管理员只能看本VDC下的服务目录详情。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403009" : {
					"cause" : "vdc管理员 不能看其他VDC下的服务目录详情。",
					"desc" : "vdc管理员 不能看其他VDC下的服务目录详情。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403010" : {
					"cause" : "查询服务目录详情,服务目录不存在。",
					"desc" : "查询服务目录详情,服务目录不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005403041" : {
					"cause" : "不能操作其他vdc下的服务目录。",
					"desc" : "不能操作其他vdc下的服务目录。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404000" : {
					"cause" : "内部错误",
					"desc" : "内部错误",
					"solution" : "重试，或者联系技术支持工程师。"
				},
				"0005404001" : {
					"cause" : "输入的时间不能小于当前时间。",
					"desc" : "输入的时间不能小于当前时间。",
					"solution" : "检查订单输入参数。"
				},
				"0005404002" : {
					"cause" : "数据库异常。",
					"desc" : "数据库异常。",
					"solution" : "检查数据库进程状态，恢复后重试。"
				},
				"0005404003" : {
					"cause" : "订单号参数输入错误。",
					"desc" : "订单号参数输入错误。",
					"solution" : "检查订单号，输入正确的订单号。"
				},
				"0005404004" : {
					"cause" : "订单状态不允许当前操作。",
					"desc" : "订单状态不允许当前操作。",
					"solution" : "检查订单状态，如审批订单后再请求。"
				},
				"0005404005" : {
					"cause" : "VDC编号输入参数错误。",
					"desc" : "VDC编号输入参数错误。",
					"solution" : "输入正确的VDC编号。"
				},
				"0005404006" : {
					"cause" : "服务实例编号输入参数错误。",
					"desc" : "服务实例编号输入参数错误。",
					"solution" : "输入正确的服务实例编号。"
				},
				"0005404007" : {
					"cause" : "服务资源编号输入参数错误。",
					"desc" : "服务资源编号输入参数错误。",
					"solution" : "输入正确的服务资源编号。"
				},
				"0005404008" : {
					"cause" : "服务实例状态不允许当前操作。",
					"desc" : "服务实例状态不允许当前操作。",
					"solution" : "等待服务实例创建完毕。"
				},
				"0005404009" : {
					"cause" : "订单状态不为initialize:待提交  ，不允许关闭。",
					"desc" : "订单状态不为initialize:待提交  ，不允许关闭。",
					"solution" : "输入正确的VDC编号。"
				},
				"0005404010" : {
					"cause" : "订单正在被操作，不允许重复操作。",
					"desc" : "订单正在被操作，不允许重复操作。",
					"solution" : "请稍候重试。"
				},
				"0005404011" : {
					"cause" : "订单已经被操作，不允许重复操作。",
					"desc" : "订单已经被操作，不允许重复操作。",
					"solution" : "请选择其他可用订单。"
				},
				"0005404012" : {
					"cause" : "服务状态未发布。",
					"desc" : "服务状态未发布。",
					"solution" : "发布服务。"
				},
				"0005404013" : {
					"cause" : "订单延期，数据库操作失败。",
					"desc" : "订单延期，数据库操作失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404014" : {
					"cause" : "输入的订单过期时间小于当前时间。",
					"desc" : "输入的订单过期时间小于当前时间。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404015" : {
					"cause" : "domain管理员不能创订单。",
					"desc" : "domain管理员不能创订单。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404016" : {
					"cause" : "VDC不在服务的白单中，不允许创订单。",
					"desc" : "VDC不在服务的白单中，不允许创订单。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404017" : {
					"cause" : "VDC不能用其他VDC下的服务创订单。",
					"desc" : "VDC不能用其他VDC下的服务创订单。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404018" : {
					"cause" : "输入的服务实例不存在。",
					"desc" : "输入的服务实例不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404019" : {
					"cause" : "用户不允许审批订单。",
					"desc" : "用户不允许审批订单。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404020" : {
					"cause" : "订单操作参数不能为空。",
					"desc" : "订单操作参数不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404021" : {
					"cause" : "修改订单参数不能为空。",
					"desc" : "修改订单参数不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404022" : {
					"cause" : "用户不允同时提交多个请求。",
					"desc" : "用户不允同时提交多个请求。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404023" : {
					"cause" : "订单ID不允许为空。",
					"desc" : "订单ID不允许为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404024" : {
					"cause" : "服务ID错误，该服务不存在。",
					"desc" : "服务ID错误，该服务不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404025" : {
					"cause" : "用户无权修改订单。",
					"desc" : "用户无权修改订单",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404026" : {
					"cause" : "用户无权限查看订单详情。",
					"desc" : "用户无权限查看订单详情。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404027" : {
					"cause" : "只允许每一次申请一个vdc服务。",
					"desc" : "只允许每一次申请一个vdc服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404028" : {
					"cause" : "用户只能关闭自己的订单。",
					"desc" : "用户只能关闭自己的订单。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404029" : {
					"cause" : "用户只能申请vdc服务。",
					"desc" : "用户只能申请vdc服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404030" : {
					"cause" : "在ict场景下，vdc管理员不能申请vdc服务。",
					"desc" : "在ict场景下，vdc管理员不能申请vdc服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404031" : {
					"cause" : "VDC已过期，不能执行此操作。",
					"desc" : "VDC已过期，不能执行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404032" : {
					"cause" : "不能修改其他vdc下的服务实例资源。",
					"desc" : "不能修改其他vdc下的服务实例资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404033" : {
					"cause" : "普通用户不能修改其他用户的服务实例资源。",
					"desc" : "普通用户不能修改其他用户的服务实例资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404034" : {
					"cause" : "不能延期其他vdc下的服务实例资源。",
					"desc" : "不能延期其他vdc下的服务实例资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404035" : {
					"cause" : "普通用户不能延期其他用户的服务实例资源。",
					"desc" : "普通用户不能延期其他用户的服务实例资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404036" : {
					"cause" : "不能释放其他用户的服务实例资源。",
					"desc" : "不能释放其他用户的服务实例资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404037" : {
					"cause" : "普通用户不能释放其他用户的服务实例资源。",
					"desc" : "普通用户不能释放其他用户的服务实例资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404038" : {
					"cause" : "创建的订单个数达到系统最大个数,不允许再创订单。",
					"desc" : "创建的订单个数达到系统最大个数,不允许再创订单。",
					"solution" : "请联系技术支持工程师。"
				},
				
				"0005404200" : {
					"cause" : "当前用户是系统管理员，不允许查看服务实例。",
					"desc" : "当前用户是系统管理员，不允许查看服务实例。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404201" : {
					"cause" : "当前用户与服务实例不是同一VDC，vdc管理员只能查看自己VDC下的服务实例。",
					"desc" : "当前用户与服务实例不是同一VDC，vdc管理员只能查看自己VDC下的服务实例。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404202" : {
					"cause" : "服务实例不存在。",
					"desc" : "服务实例不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404203" : {
					"cause" : "当前服务实例不是用户创建，普通用户只能查看自己的服务实例。",
					"desc" : "当前服务实例不是用户创建，普通用户只能查看自己的服务实例。",
					"solution" : "请联系技术支持工程师"
				},
				"0005404205" : {
					"cause" : "普通用户不能能查看其他人的服务实例。",
					"desc" : "普通用户不能能查看其他人的服务实例。",
					"solution" : "请联系技术支持工程师"
				},
				"0005404206" : {
					"cause" : "服务的模板数据异常，查询服务的url发生错误。",
					"desc" : "服务的模板数据异常，查询服务的url发生错误。",
					"solution" : "请联系技术支持工程师"
				},
				"0005404222" : {
					"cause" : "当前服务实例是过期状态，不允许修改。",
					"desc" : "当前服务实例是过期状态，不允许修改。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404223" : {
					"cause" : "更新服务实例参数输入错误。",
					"desc" : "更新服务实例参数输入错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404224" : {
					"cause" : "只能修改相同VDC下的服务实例。",
					"desc" : "只能修改相同VDC下的服务实例。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404225" : {
					"cause" : "当前服务实例数据库编号未获取。",
					"desc" : "当前服务实例数据库编号未获取。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404226" : {
					"cause" : "只能修改自己的服务实例。",
					"desc" : "只能修改自己的服务实例。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404227" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005404228" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402500":{
					"cause" : "物理机不存在。",
					"desc" : "物理机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402501":{
					"cause" : "只有系统管理员才可以修改物理机。",
					"desc" : "只有系统管理员才可以修改物理机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402502":{
					"cause" : "只能修改未分配的物理机。",
					"desc" :  "只能修改未分配的物理机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402503":{
					"cause" : "只有系统管理员才可以删除物理机。",
					"desc" :  "只有系统管理员才可以删除物理机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402504":{
					"cause" : "只能删除未分配的物理机。",
					"desc" :  "只能删除未分配的物理机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402505":{
					"cause" : "只能查看本vdc的物理机。",
					"desc" :  "只能查看本vdc的物理机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402506":{
					"cause" : "只有系统管理员才可以创建物理机。",
					"desc" :  "只有系统管理员才可以创建物理机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005402521":{
					"cause" : "已分配的物理机不能再分配。",
					"desc" :  "已分配的物理机不能再分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"0099102001" : {
					"cause" : "非法的ipv4子网IP。",
					"desc" : "非法的ipv4子网IP。",
					"solution" : "请输入正确的ipv4子网IP。"
				},
				"0099102002" : {
					"cause" : "非法的ipv4子网掩码。",
					"desc" : "非法的ipv4子网掩码。",
					"solution" : "请输入正确的ipv4子网掩码。"
				},
				"0099102003" : {
					"cause" : "非法的ipv4网关IP。",
					"desc" : "非法的ipv4网关IP。",
					"solution" : "请输入正确的ipv4网关IP。"
				},
				"0099102004" : {
					"cause" : "非法的ipv4可用IP地址段。",
					"desc" : "非法的ipv4可用IP地址段。",
					"solution" : "请输入正确的ipv4可用IP地址段。"
				},
				"0099102005" : {
					"cause" : "网关不在ipv4子网内。",
					"desc" : "网关不在ipv4子网内。",
					"solution" : "请输入的网关在ipv4子网内。"
				},
				"0099102006" : {
					"cause" : "可用IP地址段不在ipv4子网内。",
					"desc" : "可用IP地址段不在ipv4子网内。",
					"solution" : "请输入的可用IP地址段在ipv4子网内。"
				},
				"0099102007" : {
					"cause" : "非法的网关IP，网关在ipv4可用IP地址段内。",
					"desc" : "非法的网关IP，网关在ipv4可用IP地址段内。",
					"solution" : "请输入的网关不要在ipv4可用IP地址段内。"
				},
				"0099102008" : {
					"cause" : "ipv4可用IP地址段重叠。",
					"desc" : "ipv4可用IP地址段重叠。",
					"solution" : "请输入的ipv4可用IP地址段不重叠。"
				},
				"0099102009" : {
					"cause" : "非法的ipv6子网IP。",
					"desc" : "非法的ipv6子网IP。",
					"solution" : "请输入正确的ipv6子网IP。"
				},
				"0099102010" : {
					"cause" : "非法的ipv6子网掩码。",
					"desc" : "非法的ipv6子网掩码。",
					"solution" : "请输入正确的ipv6子网掩码。"
				},
				"0099102011" : {
					"cause" : "非法的ipv6网关IP。",
					"desc" : "非法的ipv6网关IP。",
					"solution" : "请输入正确的ipv6网关IP。"
				},
				"0099102012" : {
					"cause" : "非法的ipv6可用IP地址段。",
					"desc" : "非法的ipv6可用IP地址段。",
					"solution" : "请输入正确的ipv6可用IP地址段。"
				},
				"0099102013" : {
					"cause" : "网关不在ipv6子网内。",
					"desc" : "网关不在ipv6子网内。",
					"solution" : "请输入的网关在ipv6子网内。"
				},
				"0099102014" : {
					"cause" : "可用IP地址段不在ipv6子网内。",
					"desc" : "可用IP地址段不在ipv6子网内。",
					"solution" : "请输入的可用IP地址段在ipv6子网内。"
				},
				"0099102015" : {
					"cause" : "非法的网关IP，网关在ipv6可用IP地址段内。",
					"desc" : "非法的网关IP，网关在ipv6可用IP地址段内。",
					"solution" : "请输入的网关不要在ipv6可用IP地址段内。"
				},
				"0099102016" : {
					"cause" : "ipv6可用IP地址段重叠。",
					"desc" : "ipv6可用IP地址段重叠。",
					"solution" : "请输入的ipv6可用IP地址段不重叠。"
				},
				"0099102017" : {
					"cause" : "非法的ipv4 子网信息。",
					"desc" : "非法的ipv4 子网信息。",
					"solution" : "请输入合法的ipv4子网信息。"
				},
				"0099102018" : {
					"cause" : "非法的ipv4 IP地址。",
					"desc" : "非法的ipv4 IP地址。",
					"solution" : "请输入合法的ipv4 IP地址。"
				},
				"0099102019" : {
					"cause" : "非法的ipv6 子网信息。",
					"desc" : "非法的ipv6 子网信息。",
					"solution" : "请输入合法的ipv6子网信息。"
				},
				"0099102020" : {
					"cause" : "非法的ipv6 IP地址。",
					"desc" : "非法的ipv6 IP地址。",
					"solution" : "请输入合法的ipv6 IP地址。"
				},
				"1000002" : {
					"cause" : "数据库异常。",
					"desc" : "数据库异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000008" : {
					"cause" : "无权限",
					"desc" : "无权限",
					"solution" : "请联系系统管理员."
				},
				"1000010" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请输入合法参数。"
				},
				"1000022" : {
					"cause" : "连接异常，请检查IP或者端口是否正确。",
					"desc" : "连接异常，请检查IP或者端口是否正确。",
					"solution" : "请检查IP地址是否正确和桌面服务系统是否正常。"
				},
				"1000700" : {
					"cause" : "网络通信异常。",
					"desc" : "网络通信异常。",
					"solution" : "请稍候重试。"
				},
				"1002005" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请检查虚拟机是否存在再操作。"
				},
				"1002022" : {
					"cause" : "入参IP地址不合法。",
					"desc" : "入参IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002028" : {
					"cause" : "用户描述长度错误。",
					"desc" : "用户描述长度错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002054" : {
					"cause" : "域信息的IP地址不合法。",
					"desc" : "域信息的IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002062" : {
					"cause" : "角色描述非法。",
					"desc" : "角色描述非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002064" : {
					"cause" : "服务器IP地址不合法。",
					"desc" : "服务器IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002065" : {
					"cause" : "服务器IP地址已经存在。",
					"desc" : "服务器IP地址已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002066" : {
					"cause" : "BMC IP地址不合法。",
					"desc" : "BMC IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002073" : {
					"cause" : "BMC IP地址不可达。",
					"desc" : "BMC IP地址不可达。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002080" : {
					"cause" : "BMC IP地址为空。",
					"desc" : "BMC IP地址为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002132" : {
					"cause" : "快照任务正在进行中，单个虚拟机不能同时做多个快照。",
					"desc" : "快照任务正在进行中，单个虚拟机不能同时做多个快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002134" : {
					"cause" : "目标节点/资源集群不能满足虚拟机运行的网络条件。",
					"desc" : "目标节点/资源集群不能满足虚拟机运行的网络条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002147" : {
					"cause" : "指定位置下不存在网络条件满足虚拟机启动的节点。",
					"desc" : "指定位置下不存在网络条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002151" : {
					"cause" : "目的节点存储或网络不支持虚拟机运行。",
					"desc" : "目的节点存储或网络不支持虚拟机运行。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002166" : {
					"cause" : "存储IP地址正在使用中。",
					"desc" : "存储IP地址正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002177" : {
					"cause" : "VLAN ID不合法。",
					"desc" : "VLAN ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002183" : {
					"cause" : "保留IP不能包含网关。",
					"desc" : "保留IP不能包含网关。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002184" : {
					"cause" : "子网预留IP地址段有重叠。",
					"desc" : "子网预留IP地址段有重叠。",
					"solution" : "请确保子网保留IP地址段没有重叠。"
				},
				"1002185" : {
					"cause" : "预留IP地址段有重叠。",
					"desc" : "预留IP地址段有重叠。",
					"solution" : "请确保保留IP地址段没有重叠。"
				},
				"1002186" : {
					"cause" : "DHCP服务器的首选DNS服务器不合法。",
					"desc" : "DHCP服务器的首选DNS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002187" : {
					"cause" : "DHCP服务器的备用DNS服务器不合法。",
					"desc" : "DHCP服务器的备用DNS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002189" : {
					"cause" : "DHCP服务器的域名不合法。",
					"desc" : "DHCP服务器的域名不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002191" : {
					"cause" : "DHCP服务器的首选WINS服务器不合法。",
					"desc" : "DHCP服务器的首选WINS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002192" : {
					"cause" : "DHCP服务器的备用WINS服务器不合法。",
					"desc" : "DHCP服务器的备用WINS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002193" : {
					"cause" : "保留IP地址段结束地址不能小于起始地址。",
					"desc" : "保留IP地址段结束地址不能小于起始地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002194" : {
					"cause" : "保留IP必须在子网的范围内。",
					"desc" : "保留IP必须在子网的范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002196" : {
					"cause" : "修改网络中的子网时，必须保证该网络中所有虚拟机关机。",
					"desc" : "修改网络中的子网时，必须保证该网络中所有虚拟机关机。",
					"solution" : "请关闭网络中的虚拟机。"
				},
				"1002198" : {
					"cause" : "VLAN池不能为空。",
					"desc" : "VLAN池不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002200" : {
					"cause" : "VLAN ID取值范围是2～4094。",
					"desc" : "VLAN ID取值范围是2～4094。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002202" : {
					"cause" : "起始VLAN ID小于结束VLAN ID。",
					"desc" : "起始VLAN ID小于结束VLAN ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002203" : {
					"cause" : "起始VLAN ID要小于等于结束VLAN ID。",
					"desc" : "起始VLAN ID要小于等于结束VLAN ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002205" : {
					"cause" : "VLAN池之间不能重叠。",
					"desc" : "VLAN池之间不能重叠。",
					"solution" : "请确保VLAN池之间没有重叠。"
				},
				"1002215" : {
					"cause" : "VLAN池不存在。",
					"desc" : "VLAN池不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002216" : {
					"cause" : "VLAN池被使用。",
					"desc" : "VLAN池被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002222" : {
					"cause" : "子网ID和VLAN ID只能二选一。",
					"desc" : "子网ID和VLAN ID只能二选一。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002224" : {
					"cause" : "VLAN在VLAN池内不存在。",
					"desc" : "VLAN在VLAN池内不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002225" : {
					"cause" : "端口组选择的子网对应VLAN不在VLAN池内。",
					"desc" : "端口组选择的子网对应VLAN不在VLAN池内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002229" : {
					"cause" : "该网络内有虚拟机，无法删除。",
					"desc" : "该网络内有虚拟机，无法删除。",
					"solution" : "请先删除该路由网络下的虚拟机，然后再试。"
				},
				"1002243" : {
					"cause" : "上行端口聚合的描述不合法。",
					"desc" : "上行端口聚合的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002256" : {
					"cause" : "VLAN ID冲突。",
					"desc" : "VLAN ID冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002267" : {
					"cause" : "虚拟机交换机描述不合法。",
					"desc" : "虚拟机交换机描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002268" : {
					"cause" : "端口组描述不合法。",
					"desc" : "端口组描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002269" : {
					"cause" : "子网的描述不合法。",
					"desc" : "子网的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002270" : {
					"cause" : "系统平面描述不合法。",
					"desc" : "系统平面描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002271" : {
					"cause" : "上行端口的描述不合法。",
					"desc" : "上行端口的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002317" : {
					"cause" : "保留IP地址已被分配。",
					"desc" : "保留IP地址已被分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002318" : {
					"cause" : "网关IP地址已被使用。",
					"desc" : "网关IP地址已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002319" : {
					"cause" : "IP地址和掩码不匹配。",
					"desc" : "IP地址和掩码不匹配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002320" : {
					"cause" : "子网内可用IP地址不足。",
					"desc" : "子网内可用IP地址不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002322" : {
					"cause" : "VLAN池数量达到上限。",
					"desc" : "VLAN池数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002326" : {
					"cause" : "网口映射参数不合法。",
					"desc" : "网口映射参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002340" : {
					"cause" : "子网地址和网关不在同一网段。",
					"desc" : "子网地址和网关不在同一网段。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002345" : {
					"cause" : "创建磁盘失败。",
					"desc" : "创建磁盘失败。",
					"solution" : "可能由网络、SAN设备异常或数据存储剩余容量不足导致，请排查。"
				},
				"1002346" : {
					"cause" : "VRM初始化网络失败。",
					"desc" : "VRM初始化网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002359" : {
					"cause" : "虚拟机各网卡所属portgroup需要位于同一DVSwitch下。",
					"desc" : "虚拟机各网卡所属portgroup需要位于同一DVSwitch下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002408" : {
					"cause" : "ip或者掩码非法。",
					"desc" : "ip或者掩码非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002461" : {
					"cause" : "磁盘迁移失败，可能由迁移过程中虚拟机状态发生变化、主机状态变化或者网络异常导致。",
					"desc" : "磁盘迁移失败，可能由迁移过程中虚拟机状态发生变化、主机状态变化或者网络异常导致。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002503" : {
					"cause" : "内存热插立即生效的内存值必须为1024M的整数倍。",
					"desc" : "内存热插立即生效的内存值必须为1024M的整数倍。",
					"solution" : "内存热插立即生效的内存值必须为1024M的整数倍。请重新设置内存值。"
				},
				"1003000" : {
					"cause" : "VLAN ID不在1～4096之间。",
					"desc" : "VLAN ID不在1～4096之间。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003001" : {
					"cause" : "IP地址格式不合法（A.B.C.D（0～255））、结束地址小于开始地址、地址范围非法。",
					"desc" : "IP地址格式不合法（A.B.C.D（0～255））、结束地址小于开始地址、地址范围非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003003" : {
					"cause" : "由IPV4子网和IPV4前缀生成的网关不合法。",
					"desc" : "由IPV4子网和IPV4前缀生成的网关不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003004" : {
					"cause" : "IP地址与已添加的地址重叠。",
					"desc" : "IP地址与已添加的地址重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003011" : {
					"cause" : "IP地址池名词不存在。",
					"desc" : "IP地址池名词不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003012" : {
					"cause" : "IP地址池类型错误（非外部）。",
					"desc" : "IP地址池类型错误（非外部）。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003013" : {
					"cause" : "部署IP地址池失败。",
					"desc" : "部署IP地址池失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003014" : {
					"cause" : "IP地址池正在使用。",
					"desc" : "IP地址池正在使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003018" : {
					"cause" : "划分VLAN失败。",
					"desc" : "划分VLAN失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003021" : {
					"cause" : "配置SAN设备地址和网络失败。",
					"desc" : "配置SAN设备地址和网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003022" : {
					"cause" : "VLAN池参数内容VLAN区域冲突。",
					"desc" : "VLAN池参数内容VLAN区域冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003023" : {
					"cause" : "VLAN正在使用中。",
					"desc" : "VLAN正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003024" : {
					"cause" : "vlanIf冲突。",
					"desc" : "vlanIf冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003026" : {
					"cause" : "配置的子网在VLAN池中。",
					"desc" : "配置的子网在VLAN池中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003034" : {
					"cause" : "VLAN已经被使用。",
					"desc" : "VLAN已经被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003039" : {
					"cause" : "操作失败，该防火墙不存在。",
					"desc" : "操作失败，该防火墙不存在。",
					"solution" : "请刷新设备列表。"
				},
				"1003040" : {
					"cause" : "起始/终止IP地址不在可用范围之内。可用IP地址是：网段内除第一个IP地址（预留网段地址），最后一个IP 地址（预留广播地址）之外的IP地址。",
					"desc" : "起始/终止IP地址不在可用范围之内。可用IP地址是：网段内除第一个IP地址（预留网段地址），最后一个IP 地址（预留广播地址）之外的IP地址。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1003043" : {
					"cause" : "防火墙状态不允许该操作，请稍后重试。",
					"desc" : "防火墙状态不允许该操作，请稍后重试。",
					"solution" : "防火墙状态不允许该操作，请稍后重试。"
				},
				"1003044" : {
					"cause" : "路由器不存在。",
					"desc" : "路由器不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1003045" : {
					"cause" : "已配置了路由业务。",
					"desc" : "已配置了路由业务。",
					"solution" : "请删除路由业务。"
				},
				"1003048" : {
					"cause" : "指定的规则索引已存在。",
					"desc" : "指定的规则索引已存在。",
					"solution" : "请重新输入。"
				},
				"1003050" : {
					"cause" : "结束IP地址小于起始IP地址。",
					"desc" : "结束IP地址小于起始IP地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003051" : {
					"cause" : "IP地址池正在创建中，不能更新。",
					"desc" : "IP地址池正在创建中，不能更新。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003052" : {
					"cause" : "IP地址池正在删除中，不能更新。",
					"desc" : "IP地址池正在删除中，不能更新。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003053" : {
					"cause" : "修改后的IP个数小于当前的使用个数。",
					"desc" : "修改后的IP个数小于当前的使用个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003056" : {
					"cause" : "防火墙状态异常。",
					"desc" : "防火墙状态异常。",
					"solution" : "请查看防火墙连接参数。"
				},
				"1003057" : {
					"cause" : "物理防火墙上创建有虚拟防火墙，无法删除。",
					"desc" : "物理防火墙上创建有虚拟防火墙，无法删除。",
					"solution" : "请查看物理防火墙上是否有未删除的虚拟防火墙。"
				},
				"1003058" : {
					"cause" : "配置信息不存在。",
					"desc" : "配置信息不存在。",
					"solution" : "请检查防火墙的配置信息。"
				},
				"1005000" : {
					"cause" : "名称重复",
					"desc" : "名称重复",
					"solution" : "请检查名称"
				},
				"1010055" : {
					"cause" : "设备IP无法连接。",
					"desc" : "设备IP无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010058" : {
					"cause" : "设备重复接入，IP或者MAC地址已存在。",
					"desc" : "设备重复接入，IP或者MAC地址已存在。",
					"solution" : "请检查设备是否已接入。"
				},
				"1010060" : {
					"cause" : "BMC IP无法连接。",
					"desc" : "BMC IP无法连接。",
					"solution" : "请检查参数。"
				},
				"1010072" : {
					"cause" : "主机未上电、管理ip不可达、管理密码错误或管理板连接异常。",
					"desc" : "主机未上电、管理ip不可达、管理密码错误或管理板连接异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010077" : {
					"cause" : "密码错误或者设备IP不可达。",
					"desc" : "密码错误或者设备IP不可达。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010078" : {
					"cause" : "网络异常。",
					"desc" : "网络异常。",
					"solution" : "请稍候重试。"
				},
				"1010085" : {
					"cause" : "BMC IP冲突。",
					"desc" : "BMC IP冲突。",
					"solution" : "请重新输入BMC IP。"
				},
				"1010086" : {
					"cause" : "OS IP冲突。",
					"desc" : "OS IP冲突。",
					"solution" : "请重新输入OS IP。"
				},
				"1010087" : {
					"cause" : "位置信息重复(存在相同机房、机架、机框号的设备，或存在相同槽位号的交换板)。",
					"desc" : "位置信息重复(存在相同机房、机架、机框号的设备，或存在相同槽位号的交换板)。",
					"solution" : "请重新输入位置信息。"
				},
				"1010101" : {
					"cause" : "IP:{0}不在子网:{1}内。",
					"desc" : "IP:{0}不在子网:{1}内。",
					"solution" : "请重新输入IP。"
				},
				"1010102" : {
					"cause" : "IP:{0}已被主机:{1}使用。",
					"desc" : "IP:{0}已被主机:{1}使用。",
					"solution" : "请重新输入IP。"
				},
				"1010103" : {
					"cause" : "IP:{0}已被占用。",
					"desc" : "IP:{0}已被占用。",
					"solution" : "请重新输入IP。"
				},
				"1010104" : {
					"cause" : "子网[{0}]中的主机IP修改失败。",
					"desc" : "子网[{0}]中的主机IP修改失败。",
					"solution" : "请重新修改。"
				},
				"1011090" : {
					"cause" : "设置SNMP Trap失败",
					"desc" : "设置SNMP Trap失败",
					"solution" : "请联系技术支持工程师"
				},
				"1020009" : {
					"cause" : "IP地址非法。",
					"desc" : "IP地址非法。",
					"solution" : "请填写合法的IP地址。"
				},
				"1020018" : {
					"cause" : "VLAN ID与系统保留VLAN ID冲突。",
					"desc" : "VLAN ID与系统保留VLAN ID冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020026" : {
					"cause" : "配置上行端口VLAN、IP地址失败。",
					"desc" : "配置上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020027" : {
					"cause" : "删除上行端口VLAN、IP地址失败。",
					"desc" : "删除上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020028" : {
					"cause" : "修改上行端口VLAN、IP地址失败。",
					"desc" : "修改上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020029" : {
					"cause" : "查询上行端口VLAN、IP地址失败。",
					"desc" : "查询上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020030" : {
					"cause" : "网关的IP地址和指定的IP地址不在同一网段。",
					"desc" : "网关的IP地址和指定的IP地址不在同一网段。",
					"solution" : "请输入合法的网关或者IP地址。"
				},
				"1020034" : {
					"cause" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。",
					"desc" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。",
					"solution" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。"
				},
				"1020037" : {
					"cause" : "以127开头的IP地址无效，该地址保留给环回地址使用，请指定介于1和223间的其他某个有效值。",
					"desc" : "以127开头的IP地址无效，该地址保留给环回地址使用，请指定介于1和223间的其他某个有效值。",
					"solution" : "请指定开头介于1和223间的其他某个有效值。"
				},
				"1020039" : {
					"cause" : "不允许输入网络地址或广播地址。",
					"desc" : "不允许输入网络地址或广播地址。",
					"solution" : "请填写合法的IP地址。"
				},
				"1020050" : {
					"cause" : "资源分区下没有接入交换机。",
					"desc" : "资源分区下没有接入交换机。",
					"solution" : "请先接入交换机然后再试。"
				},
				"1020051" : {
					"cause" : "VLAN ID与网络资源池中的VLAN池中VLAN ID有冲突。",
					"desc" : "VLAN ID与网络资源池中的VLAN池中VLAN ID有冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020052" : {
					"cause" : "VLAN ID与网络资源池中的子网中的VLAN ID有冲突。",
					"desc" : "VLAN ID与网络资源池中的子网中的VLAN ID有冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020055" : {
					"cause" : "登陆SAN设备失败。",
					"desc" : "登陆SAN设备失败。",
					"solution" : "请检查连接参数是否正常。"
				},
				"1040004" : {
					"cause" : "网络不允许为空",
					"desc" : "网络不允许为空",
					"solution" : "请至少选择一个子网或者一个VLAN。"
				},
				"1040016" : {
					"cause" : "系统与UHM无法连接",
					"desc" : "系统与UHM无法连接",
					"solution" : "请联系系统管理员"
				},
				"1040034" : {
					"cause" : "资源集群下有关联的网络存在，删除失败。",
					"desc" : "资源集群下有关联的网络存在，删除失败。",
					"solution" : "请先删除端口组。"
				},
				"1040046" : {
					"cause" : "裸机BMC IP池不存在，无法创建裸机资源集群。",
					"desc" : "裸机BMC IP池不存在，无法创建裸机资源集群。",
					"solution" : "请先配置裸机BMC IP池，然后再进行创建裸机集群操作。"
				},
				"1040054" : {
					"cause" : "存在Vlan池已经被端口组使用，减容失败。",
					"desc" : "存在Vlan池已经被端口组使用，减容失败。",
					"solution" : "减容Vlan之前请校验是否已经被端口组使用。"
				},
				"1040068" : {
					"cause" : "子网{0}的VLAN号与子网{1}的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与子网{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040069" : {
					"cause" : "VLAN池{0}的VLAN号与子网{1}的VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与子网{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040070" : {
					"cause" : "子网{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040071" : {
					"cause" : "VLAN池{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040072" : {
					"cause" : "子网{0}的IP段与子网{1}的IP段冲突。",
					"desc" : "子网{0}的IP段与子网{1}的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040073" : {
					"cause" : "子网{0}的IP段与系统的内部子网IP段冲突。",
					"desc" : "子网{0}的IP段与系统的内部子网IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040074" : {
					"cause" : "子网{0}的IP段与系统的BMC IP池的IP段冲突。",
					"desc" : "子网{0}的IP段与系统的BMC IP池的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040075" : {
					"cause" : "子网{0}的VLAN号与系统的BMC IP池的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的BMC IP池的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040076" : {
					"cause" : "VLAN池{0}的VLAN号与系统的BMC IP池VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与系统的BMC IP池VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040077" : {
					"cause" : "子网{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040078" : {
					"cause" : "VLAN池{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040083" : {
					"cause" : "子网{0}的IP段与系统的汇聚交换机的IP段冲突。",
					"desc" : "子网{0}的IP段与系统的汇聚交换机的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040084" : {
					"cause" : "子网{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040085" : {
					"cause" : "VLAN{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"desc" : "VLAN{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040086" : {
					"cause" : "汇聚交换机的IP与系统子网IP冲突。",
					"desc" : "汇聚交换机的IP与系统子网IP冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040123" : {
					"cause" : "配置管理网络失败。",
					"desc" : "配置管理网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040124" : {
					"cause" : "分配可用的管理IP失败。",
					"desc" : "分配可用的管理IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040138" : {
					"cause" : "该资源集群下正在进行网络的创建、修改或删除，无法进行此操作。",
					"desc" : "该资源集群下正在进行网络的创建、修改或删除，无法进行此操作。",
					"solution" : "请稍后重试。"
				},
				"1040146" : {
					"cause" : "有多个主机开启了opensm。",
					"desc" : "有多个主机开启了opensm。",
					"solution" : "请选择单个主机减容。"
				},
				"1050002" : {
					"cause" : "子网ID和VLAN ID有且只能有一个有值。",
					"desc" : "子网ID和VLAN ID有且只能有一个有值。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050004" : {
					"cause" : "无效的VLAN ID。",
					"desc" : "无效的VLAN ID。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050007" : {
					"cause" : "无效的端口组描述。",
					"desc" : "无效的端口组描述。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050013" : {
					"cause" : "端口组列表中的子网或VLAN不属于同一个资源集群。",
					"desc" : "端口组列表中的子网或VLAN不属于同一个资源集群。",
					"solution" : "请选择同一个资源集群下的端口组。"
				},
				"1050016" : {
					"cause" : "VLAN类型不能修改为子网类型。",
					"desc" : "VLAN类型不能修改为子网类型。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050017" : {
					"cause" : "DVS不存在。",
					"desc" : "DVS不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050022" : {
					"cause" : "DVS没有关联VLAN Pool。",
					"desc" : "DVS没有关联VLAN Pool。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050027" : {
					"cause" : "所选DVS下VLAN ID 重复。",
					"desc" : "所选DVS下VLAN ID 重复。",
					"solution" : "请选其他VLAN ID。"
				},
				"1050028" : {
					"cause" : "VSS不存在。",
					"desc" : "VSS不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050042" : {
					"cause" : "关联dvs失败。",
					"desc" : "关联dvs失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060006" : {
					"cause" : "无效的SAN设备序列号。",
					"desc" : "无效的SAN设备序列号。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060008" : {
					"cause" : "存储描述信息太长。",
					"desc" : "存储描述信息太长。",
					"solution" : "请填写合适的描述信息长度。"
				},
				"1060139" : {
					"cause" : "存储IP不允许重复。",
					"desc" : "存储IP不允许重复。",
					"solution" : "请输入没有重复的存储IP。"
				},
				"1060140" : {
					"cause" : "存储IP或端口参数不合法。",
					"desc" : "存储IP或端口参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070025" : {
					"cause" : "虚拟机已被冻结。",
					"desc" : "虚拟机已被冻结。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070077" : {
					"cause" : "虚拟机不存在该网卡，无法进行此操作。",
					"desc" : "虚拟机不存在该网卡，无法进行此操作。",
					"solution" : "请选择合适的网卡进行操作。"
				},
				"1070080" : {
					"cause" : "快照任务正在进行中，单个虚拟机不能同时操作多个快照任务。",
					"desc" : "快照任务正在进行中，单个虚拟机不能同时操作多个快照任务。",
					"solution" : "请等进行中的快照任务完成后再开始另一个快照任务。"
				},
				"1070098" : {
					"cause" : "主机已断开连接，无法与之进行通信。",
					"desc" : "主机已断开连接，无法与之进行通信。",
					"solution" : "请检查主机状态是否正常，或联系技术支持工程师。"
				},
				"1070108" : {
					"cause" : "虚拟机的网络配置不允许执行该操作。",
					"desc" : "虚拟机的网络配置不允许执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070112" : {
					"cause" : "虚拟机和选择的网络不在相同的集群下。",
					"desc" : "虚拟机和选择的网络不在相同的集群下。",
					"solution" : "请选择其它网络重新操作。"
				},
				"1070113" : {
					"cause" : "虚拟机网卡绑定了弹性IP，不能删除和修改。",
					"desc" : "虚拟机网卡绑定了弹性IP，不能删除和修改。",
					"solution" : "请解绑定后重试。"
				},
				"1070118" : {
					"cause" : "iNIC网卡不允许在线增加。",
					"desc" : "iNIC网卡不允许在线增加。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070119" : {
					"cause" : "iNIC网卡不允许在线删除。",
					"desc" : "iNIC网卡不允许在线删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070124" : {
					"cause" : "网络ID或者VPC ID与虚拟机的网络不一致。",
					"desc" : "网络ID或者VPC ID与虚拟机的网络不一致。",
					"solution" : "确保输入的网络ID或VPC ID是有效的。"
				},
				"1070213" : {
					"cause" : "分配ip地址失败。",
					"desc" : "分配ip地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070228" : {
					"cause" : "该虚拟机上未安装VSS插件。",
					"desc" : "该虚拟机上未安装VSS插件。",
					"solution" : "请在虚拟机上安装VSS插件。"
				},
				"1070547" : {
					"cause" : "准备网络失败。",
					"desc" : "准备网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075048" : {
					"cause" : "虚拟机没有网卡，无法设置为网络启动。",
					"desc" : "虚拟机没有网卡，无法设置为网络启动。",
					"solution" : "请选择合适的启动方式。"
				},
				"1080000" : {
					"cause" : "子网信息不符合要求。",
					"desc" : "子网信息不符合要求。",
					"solution" : "请重新输入子网。"
				},
				"1080001" : {
					"cause" : "子网IP或掩码不合法。",
					"desc" : "子网IP或掩码不合法。",
					"solution" : "请重新输入子网。"
				},
				"1080002" : {
					"cause" : "保留IP地址段结束地址小于起始地址。",
					"desc" : "保留IP地址段结束地址小于起始地址。",
					"solution" : "请确保保留IP段的结束地址不小于起始地址。"
				},
				"1080003" : {
					"cause" : "保留IP段的起始IP地址或结束IP地址不在子网内。",
					"desc" : "保留IP段的起始IP地址或结束IP地址不在子网内。",
					"solution" : "请输入正确的保留IP段信息。"
				},
				"1080004" : {
					"cause" : "网关不在子网内。",
					"desc" : "网关不在子网内。",
					"solution" : "请重新输入子网。"
				},
				"1080006" : {
					"cause" : "不能指定已被使用的VLAN ID。",
					"desc" : "不能指定已被使用的VLAN ID。",
					"solution" : "请分配没有被使用的VLAN ID。"
				},
				"1080011" : {
					"cause" : "当前子网已经被外部网络或组织内部网络使用，删除失败。",
					"desc" : "当前子网已经被外部网络或组织内部网络使用，删除失败。",
					"solution" : "请查看子网是否被某个资源集群使用。"
				},
				"1080012" : {
					"cause" : "当前子网已经被网络使用，修改失败。",
					"desc" : "当前子网已经被网络使用，修改失败。",
					"solution" : "请查看子网是否被某个网络使用。"
				},
				"1080014" : {
					"cause" : "DHCP服务IP地址不合法。",
					"desc" : "DHCP服务IP地址不合法。",
					"solution" : "请输入正确的DHCP信息。"
				},
				"1080016" : {
					"cause" : "VLAN ID已经被使用。",
					"desc" : "VLAN ID已经被使用。",
					"solution" : "请输入正确的VLAN ID。"
				},
				"1080019" : {
					"cause" : "主DNS服务器IP地址不合法。",
					"desc" : "主DNS服务器IP地址不合法。",
					"solution" : "请输入正确的DNS信息。"
				},
				"1080020" : {
					"cause" : "备DNS服务器IP地址不合法。",
					"desc" : "备DNS服务器IP地址不合法。",
					"solution" : "请输入正确的DNS信息。"
				},
				"1080021" : {
					"cause" : "主WINS服务器IP地址不合法。",
					"desc" : "主WINS服务器IP地址不合法。",
					"solution" : "请输入正确的WINS信息。"
				},
				"1080022" : {
					"cause" : "备WINS服务器IP地址不合法。",
					"desc" : "备WINS服务器IP地址不合法。",
					"solution" : "请输入正确的WINS信息。"
				},
				"1080023" : {
					"cause" : "修改管理子网中，没有足够IP地址分配。",
					"desc" : "修改管理子网中，没有足够IP地址分配。",
					"solution" : "请输入更大的子网网段。"
				},
				"1080026" : {
					"cause" : "管理子网分配IP地址失败。",
					"desc" : "管理子网分配IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080029" : {
					"cause" : "修改IP地址操作的参数检查失败。",
					"desc" : "修改IP地址操作的参数检查失败。",
					"solution" : "请检查输入参数是否正确。"
				},
				"1080030" : {
					"cause" : "修改IP地址操作的IP地址参数无效。",
					"desc" : "修改IP地址操作的IP地址参数无效。",
					"solution" : "请检查输入IP参数是否有效。"
				},
				"1080031" : {
					"cause" : "修改IP地址操作的掩码参数无效，不能大于24位。",
					"desc" : "修改IP地址操作的掩码参数无效，不能大于24位。",
					"solution" : "请检查输入掩码参数是否有效或者是否大于24位。"
				},
				"1080032" : {
					"cause" : "修改IP地址操作的网关参数无效。",
					"desc" : "修改IP地址操作的网关参数无效。",
					"solution" : "请检查输入网关参数是否有效。"
				},
				"1080033" : {
					"cause" : "修改IP地址操作的VLAN参数无效。",
					"desc" : "修改IP地址操作的VLAN参数无效。",
					"solution" : "请检查输入VLAN参数是否有效。"
				},
				"1080034" : {
					"cause" : "指定的IP地址与网关IP地址冲突。",
					"desc" : "指定的IP地址与网关IP地址冲突。",
					"solution" : "请确保指定的IP地址与网关IP地址是否在同一网段。"
				},
				"1080035" : {
					"cause" : "保留IP地址操作失败。",
					"desc" : "保留IP地址操作失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080037" : {
					"cause" : "获取云管理IP失败。",
					"desc" : "获取云管理IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080038" : {
					"cause" : "更新管理IP地址记录失败。",
					"desc" : "更新管理IP地址记录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080044" : {
					"cause" : "输入的保留IP段地址范围有重叠。",
					"desc" : "输入的保留IP段地址范围有重叠。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080045" : {
					"cause" : "保留IP总个数超过128个。",
					"desc" : "保留IP总个数超过128个。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080046" : {
					"cause" : "保留IP段的起始IP地址或结束IP地址为空。",
					"desc" : "保留IP段的起始IP地址或结束IP地址为空。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080047" : {
					"cause" : "子网IP和掩码的与运算结果必须和子网IP相等。",
					"desc" : "子网IP和掩码的与运算结果必须和子网IP相等。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080048" : {
					"cause" : "该子网已经被集群使用，不允许删除。",
					"desc" : "该子网已经被集群使用，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080049" : {
					"cause" : "子网已经分配了4096个IP，超出了系统的能力。",
					"desc" : "子网已经分配了4096个IP，超出了系统的能力。",
					"solution" : "请重新选择网络。"
				},
				"1080050" : {
					"cause" : "子网中没有可用的IP。",
					"desc" : "子网中没有可用的IP。",
					"solution" : "请重新选择网络。"
				},
				"1080051" : {
					"cause" : "子网中可用IP数量不足。",
					"desc" : "子网中可用IP数量不足。",
					"solution" : "请重新选择网络。"
				},
				"1080052" : {
					"cause" : "当前网络的子网与VPC下其他网络的子网重叠。",
					"desc" : "当前网络的子网与VPC下其他网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080053" : {
					"cause" : "子网内没有可用IP，预留IP已经将子网占满。",
					"desc" : "子网内没有可用IP，预留IP已经将子网占满。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080054" : {
					"cause" : "当前网络的子网与VPN下远端用户网络的子网重叠。",
					"desc" : "当前网络的子网与VPN下远端用户网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080055" : {
					"cause" : "当前网络的子网与VSA网络的子网重叠。",
					"desc" : "当前网络的子网与VSA网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080056" : {
					"cause" : "子网所在网段已经被外部网络或者DHCP服务器使用。",
					"desc" : "子网所在网段已经被外部网络或者DHCP服务器使用。",
					"solution" : ""
				},
				"1080057" : {
					"cause" : "子网所在网段已经被物理管理网络使用。",
					"desc" : "子网所在网段已经被物理管理网络使用。",
					"solution" : ""
				},
				"1080058" : {
					"cause" : "子网所在网段已经被业务安装网络使用。",
					"desc" : "子网所在网段已经被业务安装网络使用。",
					"solution" : ""
				},
				"1080059" : {
					"cause" : "保留IP段中包含已经分配出去的IP。",
					"desc" : "保留IP段中包含已经分配出去的IP。",
					"solution" : ""
				},
				"1080061" : {
					"cause" : "私有IP已被分配。",
					"desc" : "私有IP已被分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080062" : {
					"cause" : "指定的私有IP不在子网中。",
					"desc" : "指定的私有IP不在子网中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080063" : {
					"cause" : "网络中没有需要修复的IP。",
					"desc" : "网络中没有需要修复的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080064" : {
					"cause" : "可用IP段不能包含系统自动保留的IP。",
					"desc" : "可用IP段不能包含系统自动保留的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080066" : {
					"cause" : "可用IP段未包含已分配的IP。",
					"desc" : "可用IP段未包含已分配的IP。",
					"solution" : "请重新输入子网。"
				},
				"1080067" : {
					"cause" : "只有静态注入或内部dhcp类型的子网才能指定IP。",
					"desc" : "只有静态注入或内部dhcp类型的子网才能指定IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080070" : {
					"cause" : "子网中最多只能有65536个可用IP。",
					"desc" : "子网中最多只能有65536个可用IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080101" : {
					"cause" : "可用IP段中包含了FM的浮动IP或管理IP。",
					"desc" : "可用IP段中包含了FM的浮动IP或管理IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1082000" : {
					"cause" : "可用管理IP地址段范围有重叠",
					"desc" : "可用管理IP地址段范围有重叠",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082001" : {
					"cause" : "可用管理IP地址段和网关冲突",
					"desc" : "可用管理IP地址段和网关冲突",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"10820010" : {
					"cause" : "选择的多个网络冲突。",
					"desc" : "选择的多个网络冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1082002" : {
					"cause" : "可用管理IP地址段内IP超过最大个数10000",
					"desc" : "可用管理IP地址段内IP超过最大个数10000",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082003" : {
					"cause" : "校验IP不在可用管理IP地址段内",
					"desc" : "校验IP不在可用管理IP地址段内",
					"solution" : "请确认GM IP在可用管理IP地址段内。"
				},
				"1082004" : {
					"cause" : "更新可用管理IP地址段信息异常",
					"desc" : "更新可用管理IP地址段信息异常",
					"solution" : "请联系技术支持工程师。"
				},
				"1082005" : {
					"cause" : "可用管理IP地址段内IP数量不够",
					"desc" : "可用管理IP地址段内IP数量不够",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082006" : {
					"cause" : "可用管理IP地址段不在管理子网内",
					"desc" : "可用管理IP地址段不在管理子网内",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082007" : {
					"cause" : "可用管理IP地址段与VDI预留IP冲突",
					"desc" : "可用管理IP地址段与VDI预留IP冲突",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082008" : {
					"cause" : "网关与VDI预留IP冲突",
					"desc" : "网关与VDI预留IP冲突",
					"solution" : "请确认网关不在VDI预留IP内。"
				},
				"1082009" : {
					"cause" : "掩码不在可用范围：1-28。",
					"desc" : "掩码不在可用范围：1-28。",
					"solution" : "请重新输入子网。"
				},
				"1083003" : {
					"cause" : "起始结束IP地址不在网段中。",
					"desc" : "起始结束IP地址不在网段中。",
					"solution" : "起始结束IP不在网段中。"
				},
				"1083004" : {
					"cause" : "起始IP地址大于结束IP地址。",
					"desc" : "起始IP地址大于结束IP地址。",
					"solution" : "起始IP必须小于等于结束IP。"
				},
				"1083006" : {
					"cause" : "设置GMN外部IP失败。",
					"desc" : "设置GMN外部IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1083007" : {
					"cause" : "未配置组网模式，不能修改管理子网。",
					"desc" : "未配置组网模式，不能修改管理子网。",
					"solution" : "修改管理子网前，请先配置组网模式。"
				},
				"1089998" : {
					"cause" : "当前系统存在子网或VLAN池或路由，或配置了汇聚交换机IP地址，不允许修改组网模式。",
					"desc" : "当前系统存在子网或VLAN池或路由，或配置了汇聚交换机IP地址，不允许修改组网模式。",
					"solution" : "请与系统管理员确认是否要执行该操作，如果确认要执行，请将相关子网，VLAN池，汇聚交换机IP，路由删除后，再修改组网模式。"
				},
				"1090000" : {
					"cause" : "VLAN池输入信息不符合要求。",
					"desc" : "VLAN池输入信息不符合要求。",
					"solution" : "请按照提示输入正确的VLAN池信息。"
				},
				"1090001" : {
					"cause" : "VLAN池不存在。",
					"desc" : "VLAN池不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090002" : {
					"cause" : "VLAN池的VLAN范围与存在的VLAN池有交叉或者包含。",
					"desc" : "VLAN池的VLAN范围与存在的VLAN池有交叉或者包含。",
					"solution" : "请填写正确的VLAN范围。"
				},
				"1090003" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090004" : {
					"cause" : "当前VLAN池名称已经存在。",
					"desc" : "当前VLAN池名称已经存在。",
					"solution" : "请填写唯一的VLAN池名称。"
				},
				"1090005" : {
					"cause" : "资源集群所选VLAN池中{0}已经不存在。",
					"desc" : "资源集群所选VLAN池中{0}已经不存在。",
					"solution" : "请选择存在的VLAN池。"
				},
				"1090006" : {
					"cause" : "资源集群所选VLAN池中{0}已经被其它资源集群使用。",
					"desc" : "资源集群所选VLAN池中{0}已经被其它资源集群使用。",
					"solution" : "请选择没有被资源集群使用的VLAN池。"
				},
				"1090007" : {
					"cause" : "当前VLAN池已经被外部网络或组织内部网络使用，删除失败。",
					"desc" : "当前VLAN池已经被外部网络或组织内部网络使用，删除失败。",
					"solution" : "请查看VLAN池是否被某个资源集群使用。"
				},
				"1090008" : {
					"cause" : "当前VLAN池已经被资源集群使用，修改失败。",
					"desc" : "当前VLAN池已经被资源集群使用，修改失败。",
					"solution" : "请查看VLAN池是否被某个资源集群使用。"
				},
				"1090009" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090010" : {
					"cause" : "当前VLAN池中的VLAN ID已经被使用。",
					"desc" : "当前VLAN池中的VLAN ID已经被使用。",
					"solution" : "请输入没有使用的VLAN ID。"
				},
				"1090011" : {
					"cause" : "当前VLAN池正被使用，删除失败。",
					"desc" : "当前VLAN池正被使用，删除失败。",
					"solution" : "请在VLAN池没有被使用的时候再删除。"
				},
				"1090013" : {
					"cause" : "VLAN池已经被端口组使用，修改失败。",
					"desc" : "VLAN池已经被端口组使用，修改失败。",
					"solution" : "请先删除端口组再试。"
				},
				"1090014" : {
					"cause" : "VLAN池不能关联同一集群下的多个DVS。",
					"desc" : "VLAN池不能关联同一集群下的多个DVS。",
					"solution" : "请检查参数。"
				},
				"1090015" : {
					"cause" : "基于该关联关系，已经存在网络，不允许解关联.",
					"desc" : "基于该关联关系，已经存在网络，不允许解关联.",
					"solution" : "请检查参数。"
				},
				"1090016" : {
					"cause" : "该DVS所属的资源集群已被VDC使用，无法解关联。",
					"desc" : "该DVS所属的资源集群已被VDC使用，无法解关联。",
					"solution" : "请联系系统管理员。"
				},
				"1090017" : {
					"cause" : "集群中的DVS关联的VLAN池没有包含当前VDC所使用的所有VLAN，无法扩容。",
					"desc" : "集群中的DVS关联的VLAN池没有包含当前VDC所使用的所有VLAN，无法扩容。",
					"solution" : "请联系系统管理员。"
				},
				"1090018" : {
					"cause" : "VLAN不可用。",
					"desc" : "VLAN不可用。",
					"solution" : "请联系系统管理员。"
				},
				"1090050" : {
					"cause" : "VLAN不在VLAN池内。",
					"desc" : "VLAN不在VLAN池内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090053" : {
					"cause" : "VLAN池的VLAN段包含VSA网络已经使用的VLAN ID。",
					"desc" : "VLAN池的VLAN段包含VSA网络已经使用的VLAN ID。",
					"solution" : "请重新输入VLAN段信息。"
				},
				"1090054" : {
					"cause" : "VLAN池{0}的VLAN段中包含被使用的VLAN{1}。",
					"desc" : "VLAN池{0}的VLAN段中包含被使用的VLAN{1}。",
					"solution" : "请修改VLAN段后重试。"
				},
				"1090056" : {
					"cause" : "没有可用的设备对接vlan",
					"desc" : "没有可用的设备对接vlan",
					"solution" : "请联系系统管理员"
				},
				"1090058" : {
					"cause" : "vlan不存在。",
					"desc" : "vlan不存在。",
					"solution" : "请重新选择VLAN。"
				},
				"1100009" : {
					"cause" : "FusionStorage管理IP重复。",
					"desc" : "FusionStorage管理IP重复。",
					"solution" : "请修改管理IP后重试。"
				},
				"1100011" : {
					"cause" : "FusionStorage主IP重复了",
					"desc" : "FusionStorage主IP重复了",
					"solution" : "FusionStorage主IP不能重复"
				},
				"1110007" : {
					"cause" : "组织vdc存在关联的网络资源。",
					"desc" : "组织vdc存在关联的网络资源。",
					"solution" : "如需删除该组织VDC，请保证不存在资源与其关联。"
				},
				"1110021" : {
					"cause" : "组织VDC下存在VPC。",
					"desc" : "组织VDC下存在VPC。",
					"solution" : "如需删除该VDC，请保证VDC不存在VPC与其关联。"
				},
				"1110026" : {
					"cause" : "组织VDC修改的公网IP上限少于已用容量。",
					"desc" : "组织VDC修改的公网IP上限少于已用容量。",
					"solution" : "组织VDC修改的公网IP上限必须大于已用容量。"
				},
				"1110027" : {
					"cause" : "组织VDC修改的硬件虚拟防火墙上限少于已用容量。",
					"desc" : "组织VDC修改的硬件虚拟防火墙上限少于已用容量。",
					"solution" : "组织VDC修改的硬件虚拟防火墙上限必须大于已用容量。"
				},
				"1110028" : {
					"cause" : "组织VDC修改的软件虚拟防火墙上限少于已用容量。",
					"desc" : "组织VDC修改的软件虚拟防火墙上限少于已用容量。",
					"solution" : "组织VDC修改的软件虚拟防火墙上限必须大于已用容量。"
				},
				"1120003" : {
					"cause" : "BMC IP地址池更新失败。",
					"desc" : "BMC IP地址池更新失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120004" : {
					"cause" : "BMC IP地址池查询失败。",
					"desc" : "BMC IP地址池查询失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120005" : {
					"cause" : "BMC IP地址池的VLAN号和已有的子网VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和已有的子网VLAN号冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120006" : {
					"cause" : "BMC IP地址池的VLAN号和已有的VLAN池VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和已有的VLAN池VLAN号冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120007" : {
					"cause" : "没有配置组网模式，无法创建BMC IP地址池。",
					"desc" : "没有配置组网模式，无法创建BMC IP地址池。",
					"solution" : "请配置组网模式。"
				},
				"1120008" : {
					"cause" : "没有配置组网模式，无法修改BMC IP地址池。",
					"desc" : "没有配置组网模式，无法修改BMC IP地址池。",
					"solution" : "请配置组网模式。"
				},
				"1120009" : {
					"cause" : "BMC IP地址池的VLAN号和汇聚交换机上行端口的VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和汇聚交换机上行端口的VLAN号冲突。",
					"solution" : "请选择正确的VLAN号。"
				},
				"1120010" : {
					"cause" : "BMC IP地址池的IP和汇聚交换机上行端口的IP冲突。",
					"desc" : "BMC IP地址池的IP和汇聚交换机上行端口的IP冲突。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1120011" : {
					"cause" : "BMC IP地址池的IP和系统子网的IP冲突。",
					"desc" : "BMC IP地址池的IP和系统子网的IP冲突。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1120012" : {
					"cause" : "BMC IP地址池操作异常。",
					"desc" : "BMC IP地址池操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120013" : {
					"cause" : "BMC IP地址池创建失败。",
					"desc" : "BMC IP地址池创建失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1130000" : {
					"cause" : "没有可以分配的VLAN。",
					"desc" : "没有可以分配的VLAN。",
					"solution" : "请联系技术支持工程师。"
				},
				"1130010" : {
					"cause" : "增加的vlan中存在被其他vdc使用的vlan。",
					"desc" : "增加的vlan中存在被其他vdc使用的vlan。",
					"solution" : "请修改增加的vlan后重试。"
				},
				"1130011" : {
					"cause" : "增加的vlan中存在被外部网络使用的vlan。",
					"desc" : "增加的vlan中存在被外部网络使用的vlan。",
					"solution" : "请修改增加的vlan后重试。"
				},
				"1130012" : {
					"cause" : "减少的vlan中存在被使用的vlan。",
					"desc" : "减少的vlan中存在被使用的vlan。",
					"solution" : "请修改减少的vlan后重试。"
				},
				"1140018" : {
					"cause" : "虚拟化环境端口和IP重复。",
					"desc" : "虚拟化环境端口和IP重复。",
					"solution" : "请重新输入。"
				},
				"1140019" : {
					"cause" : "DVS和VLAN池关联。",
					"desc" : "DVS和VLAN池关联。",
					"solution" : "请解关联DVS与VLAN池。"
				},
				"1140020" : {
					"cause" : "DVS和VSA网络关联。",
					"desc" : "DVS和VSA网络关联。",
					"solution" : "请解关联DVS与VSA网络。"
				},
				"1140040" : {
					"cause" : "同一个DVS的集群必须在一个资源分区内。",
					"desc" : "同一个DVS的集群必须在一个资源分区内。",
					"solution" : "请在正确的资源分区下操作，或选择正确的集群。"
				},
				"1140044" : {
					"cause" : "存在与该集群相关的外部网络或组织网络，不允许解除关联。",
					"desc" : "存在与该集群相关的外部网络或组织网络，不允许解除关联。",
					"solution" : "请先删除与该集群相关的外部网络和组织网络。"
				},
				"1140046" : {
					"cause" : "集群不存在关联",
					"desc" : "集群不存在关联",
					"solution" : "请检查该集群的关联关系"
				},
				"1140047" : {
					"cause" : "当前DVS下不包含任何VSS。",
					"desc" : "当前DVS下不包含任何VSS。",
					"solution" : "请重新添加VSS。"
				},
				"1140067" : {
					"cause" : "集群下DVS已关联Vlan池，不允许解除关联。",
					"desc" : "集群下DVS已关联Vlan池，不允许解除关联。",
					"solution" : "请先删除集群下DVS与Vlan池的关联关系。"
				},
				"1140068" : {
					"cause" : "集群已关联VSA网络或VTEP网络，不允许解除关联。",
					"desc" : "集群已关联VSA网络或VTEP网络，不允许解除关联。",
					"solution" : "请先删除集群下的VSA网络或VTEP网络。"
				},
				"1140069" : {
					"cause" : "资源分区下存在路由器，不允许修改物理组网模式。",
					"desc" : "资源分区下存在路由器，不允许修改物理组网模式。",
					"solution" : "请先从资源分区下删除路由器。"
				},
				"1150008" : {
					"cause" : "IP重复。",
					"desc" : "IP重复。",
					"solution" : "请检查IP是否重复。"
				},
				"1150009" : {
					"cause" : "IP格式非法。",
					"desc" : "IP格式非法。",
					"solution" : "请检查IP格式是否正确。"
				},
				"1150022" : {
					"cause" : "存储中不存在指定的管理IP。",
					"desc" : "存储中不存在指定的管理IP。",
					"solution" : "请填写正确的管理IP。"
				},
				"1150036" : {
					"cause" : "请求超时。",
					"desc" : "请求超时。",
					"solution" : "请先检查网络是否连通。"
				},
				"1150038" : {
					"cause" : "添加失败，请检查IP、端口、用户名和密码是否正确，网络是否连通。",
					"desc" : "添加失败，请检查IP、端口、用户名和密码是否正确，网络是否连通。",
					"solution" : "请检查Ip、用户名和密码是否正确，网络是否连通。"
				},
				"1150040" : {
					"cause" : "获得结点的存储IP失败。",
					"desc" : "获得结点的存储IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150051" : {
					"cause" : "存在正在减容的服务器。",
					"desc" : "存在正在减容的服务器。",
					"solution" : "请等待减容完成后再操作。"
				},
				"1150054" : {
					"cause" : "该网络设备已经不存在。",
					"desc" : "该网络设备已经不存在。",
					"solution" : "请刷新页面查看网络设备列表。"
				},
				"1150059" : {
					"cause" : "没有可用的FusionStorage 逻辑设备，不能修改管理IP。",
					"desc" : "没有可用的FusionStorage 逻辑设备，不能修改管理IP。",
					"solution" : "请检查FusionStorage逻辑设备是否可用。"
				},
				"1162003" : {
					"cause" : "系统没有可分配资源。",
					"desc" : "系统没有可分配资源。",
					"solution" : "请联系系统管理员。"
				},
				"1162004" : {
					"cause" : "网络不存在。",
					"desc" : "网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162005" : {
					"cause" : "该网络已被虚拟机使用。",
					"desc" : "该网络已被虚拟机使用。",
					"solution" : "请删除使用该网络的资源后重试。"
				},
				"1162011" : {
					"cause" : "当前网络已被ACL使用。",
					"desc" : "当前网络已被ACL使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162012" : {
					"cause" : "当前网络已开启SNAT。",
					"desc" : "当前网络已开启SNAT。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162013" : {
					"cause" : "当前网络已被VPN连接使用。",
					"desc" : "当前网络已被VPN连接使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162014" : {
					"cause" : "当前网络已被直连网络使用。",
					"desc" : "当前网络已被直连网络使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162015" : {
					"cause" : "外部网络已经被软件防火墙使用，无法删除。",
					"desc" : "外部网络已经被软件防火墙使用，无法删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162016" : {
					"cause" : "当前网络有手动申请IP，不能修改或删除。",
					"desc" : "当前网络有手动申请IP，不能修改或删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162017" : {
					"cause" : "当前网络已被VLB使用。",
					"desc" : "当前网络已被VLB使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162117" : {
					"cause" : "网络当前状态不支持该操作，请稍后重试。",
					"desc" : "网络当前状态不支持该操作，请稍后重试。",
					"solution" : "请稍候重试。"
				},
				"1162118" : {
					"cause" : "可用IP数量不足，无法重新分配IP。",
					"desc" : "可用IP数量不足，无法重新分配IP。",
					"solution" : "请重新输入子网。"
				},
				"1162200" : {
					"cause" : "VPC规格个数超过系统最大值。",
					"desc" : "VPC规格个数超过系统最大值。",
					"solution" : ""
				},
				"1162201" : {
					"cause" : "VPC规格名称重复。",
					"desc" : "VPC规格名称重复。",
					"solution" : ""
				},
				"1162202" : {
					"cause" : "VPC规格不存在。",
					"desc" : "VPC规格不存在。",
					"solution" : ""
				},
				"1162203" : {
					"cause" : "VPC规格已被使用。",
					"desc" : "VPC规格已被使用。",
					"solution" : ""
				},
				"1162500" : {
					"cause" : "外部网络不存在。",
					"desc" : "外部网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162501" : {
					"cause" : "网络超出规格。",
					"desc" : "网络超出规格。",
					"solution" : "请联系系统管理员。"
				},
				"1162503" : {
					"cause" : "VLAN已被使用或VLAN对应的VLAN池不可用。",
					"desc" : "VLAN已被使用或VLAN对应的VLAN池不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162505" : {
					"cause" : "VLAN已被使用或VLAN所在的VLAN池被删除。",
					"desc" : "VLAN已被使用或VLAN所在的VLAN池被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162506" : {
					"cause" : "DVS上创建了外部网络或者组织网络。",
					"desc" : "DVS上创建了外部网络或者组织网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162507" : {
					"cause" : "VSS所在的DVS创建了外部网络或组织网络。",
					"desc" : "VSS所在的DVS创建了外部网络或组织网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162508" : {
					"cause" : "VPC不存在。",
					"desc" : "VPC不存在。",
					"solution" : ""
				},
				"1162510" : {
					"cause" : "创建组织网络失败。",
					"desc" : "创建组织网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162511" : {
					"cause" : "创建DHCP子网失败。",
					"desc" : "创建DHCP子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162512" : {
					"cause" : "没有可用的外部网络。",
					"desc" : "没有可用的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162514" : {
					"cause" : "网络不存在。",
					"desc" : "网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162515" : {
					"cause" : "该外部网络已经被当前VPC使用。",
					"desc" : "该外部网络已经被当前VPC使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162516" : {
					"cause" : "该网络不属于当前VPC。",
					"desc" : "该网络不属于当前VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162517" : {
					"cause" : "网络数量已经到达VPC的最大规格。",
					"desc" : "网络数量已经到达VPC的最大规格。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162519" : {
					"cause" : "该网络不是完成状态，无法使用。",
					"desc" : "该网络不是完成状态，无法使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162520" : {
					"cause" : "该VLAN已被VLAN类型的网络使用，无法用于创建子网类型的网络。",
					"desc" : "该VLAN已被VLAN类型的网络使用，无法用于创建子网类型的网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162521" : {
					"cause" : "该vlan已被其他网络的子网使用。",
					"desc" : "该vlan已被其他网络的子网使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162522" : {
					"cause" : "该网络不是直连网络。",
					"desc" : "该网络不是直连网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162523" : {
					"cause" : "没有可用的VSA管理网络。",
					"desc" : "没有可用的VSA管理网络。",
					"solution" : "请联系系统管理员。"
				},
				"1162524" : {
					"cause" : "一个VPC下最多能创建200个DHCP的网络。",
					"desc" : "一个VPC下最多能创建200个DHCP的网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162525" : {
					"cause" : "没有可用的VTEP网络。",
					"desc" : "没有可用的VTEP网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162526" : {
					"cause" : "删除dhcpsubnet失败",
					"desc" : "删除dhcpsubnet失败",
					"solution" : "请联系技术支持工程师。"
				},
				"1162527" : {
					"cause" : "子网和公网IP池中的IP段冲突。",
					"desc" : "子网和公网IP池中的IP段冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162528" : {
					"cause" : "该手动分配IP不存在。",
					"desc" : "该手动分配IP不存在。",
					"solution" : "请刷新列表后重试。"
				},
				"1162529" : {
					"cause" : "外部网络的DHCP服务器不存在。",
					"desc" : "外部网络的DHCP服务器不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1162530" : {
					"cause" : "DHCP服务器的状态不允许操作。",
					"desc" : "DHCP服务器的状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1162531" : {
					"cause" : "一个申请了软件防火墙的VPC最多可创建200个路由网络。",
					"desc" : "一个申请了软件防火墙的VPC最多可创建200个路由网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162532" : {
					"cause" : "一个ZONE下最多创建199个内部DHCP的外部网络。",
					"desc" : "一个ZONE下最多创建199个内部DHCP的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162537" : {
					"cause" : "只有子网类型的内部网络，并且IP分配方式为静态注入或内部DHCP，才能关联路由器。",
					"desc" : "只有子网类型的内部网络，并且IP分配方式为静态注入或内部DHCP，才能关联路由器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162538" : {
					"cause" : "只有路由网络可以解关联路由器。",
					"desc" : "只有路由网络可以解关联路由器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162539" : {
					"cause" : "路由网路只支持静态注入和内部DHCP的IP分配方式。",
					"desc" : "路由网路只支持静态注入和内部DHCP的IP分配方式。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162546" : {
					"cause" : "资源分区下没有连接Internet的静态注入的IPv4的外部网络，该网络不能包含IPv6子网",
					"desc" : "资源分区下没有连接Internet的静态注入的IPv4的外部网络，该网络不能包含IPv6子网",
					"solution" : "请联系系统管理员。"
				},
				"1163003" : {
					"cause" : "路由器状态不正常，不允许操作。",
					"desc" : "路由器状态不正常，不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163006" : {
					"cause" : "当前虚拟防火墙已与VPC关联。",
					"desc" : "当前虚拟防火墙已与VPC关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163007" : {
					"cause" : "VPC已经关联了虚拟防火墙。",
					"desc" : "VPC已经关联了虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163008" : {
					"cause" : "VPC下存在网络，不能释放虚拟防火墙。",
					"desc" : "VPC下存在网络，不能释放虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163009" : {
					"cause" : "虚拟防火墙未关联VPC，不需要释放。",
					"desc" : "虚拟防火墙未关联VPC，不需要释放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163010" : {
					"cause" : "防火墙资源ID不存在。",
					"desc" : "防火墙资源ID不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163012" : {
					"cause" : "预留的防火墙已经被使用，请修配置文件。",
					"desc" : "预留的防火墙已经被使用，请修配置文件。",
					"solution" : "请修改配置文件。"
				},
				"1163013" : {
					"cause" : "VPC下存在弹性IP，无法释放虚拟防火墙。",
					"desc" : "VPC下存在弹性IP，无法释放虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163014" : {
					"cause" : "该VPC已经创建了授权，不能再次授权。",
					"desc" : "该VPC已经创建了授权，不能再次授权。",
					"solution" : "请联系技术支持工程师。"
				},
				"1164200" : {
					"cause" : "资源分区没有可用的公网IP。",
					"desc" : "资源分区没有可用的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1166003" : {
					"cause" : "防火墙已冻结，不能创建ACL。",
					"desc" : "防火墙已冻结，不能创建ACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166006" : {
					"cause" : "虚拟防火墙已冻结，不能创建ACL规则。",
					"desc" : "虚拟防火墙已冻结，不能创建ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166007" : {
					"cause" : "ACL已经存在。",
					"desc" : "ACL已经存在。",
					"solution" : "请联系系统管理员。"
				},
				"1166016" : {
					"cause" : "当前VPC状态不能创建FWACL。",
					"desc" : "当前VPC状态不能创建FWACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166017" : {
					"cause" : "当前网络不是路由网络，不能用来创建防火墙规则。",
					"desc" : "当前网络不是路由网络，不能用来创建防火墙规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166018" : {
					"cause" : "VPC没有申请路由器。",
					"desc" : "VPC没有申请路由器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162550": {
					"cause":"当前路由器不支持创建VXLAN的网络。",
					"desc":"当前路由器不支持创建VXLAN的网络。",
					"solution":"请联系技术支持工程师。"
				},
				"1166019" : {
					"cause" : "弹性IP不在指定的VPC下。",
					"desc" : "弹性IP不在指定的VPC下。",
					"solution" : "请联系系统管理员。"
				},
				"1166020" : {
					"cause" : "当前ACL不是FWACL，不能创建FWACL规则。",
					"desc" : "当前ACL不是FWACL，不能创建FWACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166022" : {
					"cause" : "防火墙规则不存在。",
					"desc" : "防火墙规则不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1166023" : {
					"cause" : "网络不是完成状态，不能创建NetACL规则。",
					"desc" : "网络不是完成状态，不能创建NetACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166025" : {
					"cause" : "防火墙规则非稳态，不允许删除。",
					"desc" : "防火墙规则非稳态，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1166026" : {
					"cause" : "VPC中不存在可用的路由器",
					"desc" : "VPC中不存在可用的路由器",
					"solution" : "请检查路由器是否创建成功"
				},
				"1166027" : {
					"cause" : "防火墙规则不属于指定VPC。",
					"desc" : "防火墙规则不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1166028" : {
					"cause" : "当前组网方式不支持域内ACL。",
					"desc" : "当前组网方式不支持域内ACL。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167002" : {
					"cause" : "SNAT不存在。",
					"desc" : "SNAT不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167011" : {
					"cause" : "DNAT不存在。",
					"desc" : "DNAT不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167012" : {
					"cause" : "底层设备配置SNAT失败。",
					"desc" : "底层设备配置SNAT失败。",
					"solution" : "请联系系统管理员。"
				},
				"1167019" : {
					"cause" : "正在开启SNAT。",
					"desc" : "正在开启SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167021" : {
					"cause" : "该公网IP池没有可用IP。",
					"desc" : "该公网IP池没有可用IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167029" : {
					"cause" : "正在关闭SNAT。",
					"desc" : "正在关闭SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167030" : {
					"cause" : "DNAT不是处于成功状态。",
					"desc" : "DNAT不是处于成功状态。",
					"solution" : "请联系系统管理员。"
				},
				"1167033" : {
					"cause" : "该虚拟机没有可以设置DNAT的网卡。",
					"desc" : "该虚拟机没有可以设置DNAT的网卡。",
					"solution" : "请联系系统管理员。"
				},
				"1167034" : {
					"cause" : "该zone没有配置公网访问虚拟机的参数。",
					"desc" : "该zone没有配置公网访问虚拟机的参数。",
					"solution" : "请联系系统管理员。"
				},
				"1167035" : {
					"cause" : "只有路由网络才能开启SNAT。",
					"desc" : "只有路由网络才能开启SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167036" : {
					"cause" : "该网络已经开启了SNAT。",
					"desc" : "该网络已经开启了SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167038" : {
					"cause" : "网络不在指定的VPC中。",
					"desc" : "网络不在指定的VPC中。",
					"solution" : "请联系系统管理员。"
				},
				"1167039" : {
					"cause" : "网络没有创建成功。",
					"desc" : "网络没有创建成功。",
					"solution" : "请联系系统管理员。"
				},
				"1167040" : {
					"cause" : "SNAT不属于指定VPC。",
					"desc" : "SNAT不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167041" : {
					"cause" : "该虚拟机已经设置了DNAT。",
					"desc" : "该虚拟机已经设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167045" : {
					"cause" : "该网卡和私有端口已经配置了DNAT。",
					"desc" : "该网卡和私有端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167047" : {
					"cause" : "该私有IP和私有端口已经配置了DNAT。",
					"desc" : "该私有IP和私有端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167048" : {
					"cause" : "该公网IP和公网端口已经配置了DNAT。",
					"desc" : "该公网IP和公网端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167049" : {
					"cause" : "VPC下无可用的公网IP。",
					"desc" : "VPC下无可用的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167050" : {
					"cause" : "VPC下的公网IP地址已被使用。",
					"desc" : "VPC下的公网IP地址已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1167051" : {
					"cause" : "已超过VDC下的公网IP上限。",
					"desc" : "已超过VDC下的公网IP上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167052" : {
					"cause" : "已超过VDC下的硬件虚拟防火墙上限。",
					"desc" : "已超过VDC下的硬件虚拟防火墙上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167053" : {
					"cause" : "已超过VDC下的软件虚拟防火墙上限。",
					"desc" : "已超过VDC下的软件虚拟防火墙上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167054" : {
					"cause" : "指定的公网IP非VPC下的公网IP。",
					"desc" : "指定的公网IP非VPC下的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167055" : {
					"cause" : "指定的公网IP不存在。",
					"desc" : "指定的公网IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167056" : {
					"cause" : "指定的公网IP与VPC下已开启SNAT的公网IP不一致。",
					"desc" : "指定的公网IP与VPC下已开启SNAT的公网IP不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1167057" : {
					"cause" : "VPC下存在公网IP，不允许释放虚拟防火墙。",
					"desc" : "VPC下存在公网IP，不允许释放虚拟防火墙。",
					"solution" : "请联系系统管理员。"
				},
				"1167058" : {
					"cause" : "公网IP池中不存在要申请的IP。",
					"desc" : "公网IP池中不存在要申请的IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167059" : {
					"cause" : "所在资源分区下可用的公网IP不足。",
					"desc" : "所在资源分区下可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167060" : {
					"cause" : "指定公网IP池内可用的公网IP不足。",
					"desc" : "指定公网IP池内可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167061" : {
					"cause" : "虚拟防火墙所在外部网络可用的公网IP不足。",
					"desc" : "虚拟防火墙所在外部网络可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167063" : {
					"cause" : "虚拟机或网络不属于指定VPC。",
					"desc" : "虚拟机或网络不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167064" : {
					"cause" : "DNAT不属于指定VPC。",
					"desc" : "DNAT不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167200" : {
					"cause" : "该弹性IP不存在。",
					"desc" : "该弹性IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167202" : {
					"cause" : "弹性IP和虚拟机已绑定。",
					"desc" : "弹性IP和虚拟机已绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167204" : {
					"cause" : "指定网卡无法设置弹性IP。",
					"desc" : "指定网卡无法设置弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167205" : {
					"cause" : "该弹性IP未被绑定。",
					"desc" : "该弹性IP未被绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167208" : {
					"cause" : "该弹性IP已经冻结。",
					"desc" : "该弹性IP已经冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1167209" : {
					"cause" : "该弹性IP已经恢复。",
					"desc" : "该弹性IP已经恢复。",
					"solution" : "请联系系统管理员。"
				},
				"1167210" : {
					"cause" : "该弹性IP正在绑定。",
					"desc" : "该弹性IP正在绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167211" : {
					"cause" : "该弹性IP正在解绑。",
					"desc" : "该弹性IP正在解绑。",
					"solution" : "请联系系统管理员。"
				},
				"1167212" : {
					"cause" : "该弹性IP正在冻结。",
					"desc" : "该弹性IP正在冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1167213" : {
					"cause" : "该弹性IP正在恢复。",
					"desc" : "该弹性IP正在恢复。",
					"solution" : "请联系系统管理员。"
				},
				"1167214" : {
					"cause" : "申请的弹性IP地址超过上限。",
					"desc" : "申请的弹性IP地址超过上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167215" : {
					"cause" : "没有可以绑定弹性IP的网卡。",
					"desc" : "没有可以绑定弹性IP的网卡。",
					"solution" : "请联系系统管理员。"
				},
				"1167216" : {
					"cause" : "弹性IP所在的VPC与网卡所在的VPC不一致。",
					"desc" : "弹性IP所在的VPC与网卡所在的VPC不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1167217" : {
					"cause" : "该弹性IP有ACL规则。",
					"desc" : "该弹性IP有ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1167218" : {
					"cause" : "该私有IP不存在。",
					"desc" : "该私有IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167219" : {
					"cause" : "VPN使用了该弹性IP",
					"desc" : "VPN使用了该弹性IP",
					"solution" : "请联系系统管理员。"
				},
				"1167220" : {
					"cause" : "不允许使用静态注入网络配置类型。",
					"desc" : "不允许使用静态注入网络配置类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167222" : {
					"cause" : "绑定的弹性IP已达到最大值。",
					"desc" : "绑定的弹性IP已达到最大值。",
					"solution" : "请联系系统管理员。"
				},
				"1167223" : {
					"cause" : "弹性IP和F5中的VLB进行了绑定",
					"desc" : "弹性IP和F5中的VLB进行了绑定",
					"solution" : "请联系系统管理员。"
				},
				"1167224" : {
					"cause" : "私有IP绑定了弹性IP。",
					"desc" : "私有IP绑定了弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167226" : {
					"cause" : "弹性IP和私有IP进行了绑定",
					"desc" : "弹性IP和私有IP进行了绑定",
					"solution" : "请联系系统管理员。"
				},
				"1167228" : {
					"cause" : "网卡设置了DNAT。",
					"desc" : "网卡设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167229" : {
					"cause" : "私有IP设置了DNAT。",
					"desc" : "私有IP设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167230" : {
					"cause" : "弹性IP和软件负载均衡器进行了绑定。",
					"desc" : "弹性IP和软件负载均衡器进行了绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167231" : {
					"cause" : "正在修改IP带宽。",
					"desc" : "正在修改IP带宽。",
					"solution" : "请联系系统管理员。"
				},
				"1167300" : {
					"cause" : "IP池中有名称冲突。",
					"desc" : "IP池中有名称冲突。",
					"solution" : "请重新输入名称。"
				},
				"1167301" : {
					"cause" : "有公网IP地址已经被其他公网IP池使用。",
					"desc" : "有公网IP地址已经被其他公网IP池使用。",
					"solution" : "请修改公网IP段。"
				},
				"1167302" : {
					"cause" : "公网IP池不存在。",
					"desc" : "公网IP池不存在。",
					"solution" : "请重新刷新公网IP池列表。"
				},
				"1167303" : {
					"cause" : "IP池中有IP地址已被分配或正在使用，不允许删除。",
					"desc" : "IP池中有IP地址已被分配或正在使用，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167304" : {
					"cause" : "IP池中有IP地址不在。",
					"desc" : "IP池中有IP地址不在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167305" : {
					"cause" : "IP池中有IP地址已作他用。",
					"desc" : "IP池中有IP地址已作他用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167306" : {
					"cause" : "一个公网IP池中最多能添加32个IP地址段。",
					"desc" : "一个公网IP池中最多能添加32个IP地址段。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167307" : {
					"cause" : "一个资源分区最多能添加8个IP池。",
					"desc" : "一个资源分区最多能添加8个IP池。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167308" : {
					"cause" : "该IP和zone不匹配。",
					"desc" : "该IP和zone不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1167309" : {
					"cause" : "公网IP段和外部网络的子网冲突。",
					"desc" : "公网IP段和外部网络的子网冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167310" : {
					"cause" : "IP地址已被释放。",
					"desc" : "IP地址已被释放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1169002" : {
					"cause" : "该IP未被设置在虚拟防火墙上。",
					"desc" : "该IP未被设置在虚拟防火墙上。",
					"solution" : "请联系系统管理员。"
				},
				"1169101" : {
					"cause" : "该IP带宽规格不存在。",
					"desc" : "该IP带宽规格不存在。",
					"solution" : "请刷新列表后重试。"
				},
				"1169103" : {
					"cause" : "IP带宽规格个数超过系统最大值。",
					"desc" : "IP带宽规格个数超过系统最大值。",
					"solution" : ""
				},
				"1169105" : {
					"cause" : "底层设备配置IP带宽失败。",
					"desc" : "底层设备配置IP带宽失败。",
					"solution" : "请联系系统管理员。"
				},
				"1170015" : {
					"cause" : "网络已经被使用。",
					"desc" : "网络已经被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1170019" : {
					"cause" : "可用IP的起始值或结束值为空。",
					"desc" : "可用IP的起始值或结束值为空。",
					"solution" : "请重新输入子网。"
				},
				"1170020" : {
					"cause" : "可用IP地址段结束地址小于起始地址。",
					"desc" : "可用IP地址段结束地址小于起始地址。",
					"solution" : "请重新输入子网。"
				},
				"1170021" : {
					"cause" : "可用IP不合法。",
					"desc" : "可用IP不合法。",
					"solution" : "请重新输入子网。"
				},
				"1170022" : {
					"cause" : "可用IP地址段之间有重叠。",
					"desc" : "可用IP地址段之间有重叠。",
					"solution" : "请重新输入子网。"
				},
				"1170023" : {
					"cause" : "起始IP地址地址或结束IP地址不在子网内。",
					"desc" : "起始IP地址地址或结束IP地址不在子网内。",
					"solution" : "请重新输入子网。"
				},
				"1170027" : {
					"cause" : "VSA管理网络和VPC下的网络有重叠。",
					"desc" : "VSA管理网络和VPC下的网络有重叠。",
					"solution" : "请重新输入。"
				},
				"1180000" : {
					"cause" : "VPC下的DHCP VSA不存在。",
					"desc" : "VPC下的DHCP VSA不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1180100" : {
					"cause" : "DHCP服务器不存在。",
					"desc" : "DHCP服务器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180101" : {
					"cause" : "创建VSA虚拟机失败。",
					"desc" : "创建VSA虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180102" : {
					"cause" : "添加VSA外部接口失败。",
					"desc" : "添加VSA外部接口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180103" : {
					"cause" : "添加VSA失败。",
					"desc" : "添加VSA失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180104" : {
					"cause" : "vsa虚拟机模板不存在。",
					"desc" : "vsa虚拟机模板不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1180105" : {
					"cause" : "VPC已经申请了虚拟防火墙。",
					"desc" : "VPC已经申请了虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180107" : {
					"cause" : "外部网络不是普通子网类型，无法用于创建软件防火墙。",
					"desc" : "外部网络不是普通子网类型，无法用于创建软件防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180108" : {
					"cause" : "外部网络中没有可用的IP。",
					"desc" : "外部网络中没有可用的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180109" : {
					"cause" : "外部网络和VPC不属于同一个资源分区。",
					"desc" : "外部网络和VPC不属于同一个资源分区。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180110" : {
					"cause" : "外部网络ip分配方式不为静态注入，无法用于创建软件防火墙。",
					"desc" : "外部网络ip分配方式不为静态注入，无法用于创建软件防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180111" : {
					"cause" : "软件防火墙状态不允许操作。",
					"desc" : "软件防火墙状态不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180112" : {
					"cause" : "无法获取到软件防火墙VSA虚拟机网卡ip。",
					"desc" : "无法获取到软件防火墙VSA虚拟机网卡ip。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180114" : {
					"cause" : "没有可用的vsa管理网络。",
					"desc" : "没有可用的vsa管理网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180115" : {
					"cause" : "没有可用的vtep网络。",
					"desc" : "没有可用的vtep网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180116" : {
					"cause" : "vsa不在当前vpc下。",
					"desc" : "vsa不在当前vpc下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180117" : {
					"cause" : "没有firewall vsa存在。",
					"desc" : "没有firewall vsa存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180118" : {
					"cause" : "外部网络无效。",
					"desc" : "外部网络无效。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180119" : {
					"cause" : "该zone下已经存在外部网络的DHCP服务器。",
					"desc" : "该zone下已经存在外部网络的DHCP服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180121" : {
					"cause" : "创建VSA虚拟机失败。",
					"desc" : "创建VSA虚拟机失败。",
					"solution" : "请联系系统管理员。"
				},
				"1180122" : {
					"cause" : "zone下有内部DHCP类型的外部网络，不允许删除DHCP服务器。",
					"desc" : "zone下有内部DHCP类型的外部网络，不允许删除DHCP服务器。",
					"solution" : "请联系系统管理员。"
				},
				"1180126" : {
					"cause" : "DHCP服务器状态不允许此操作。",
					"desc" : "DHCP服务器状态不允许此操作。",
					"solution" : "请刷新后重新尝试。"
				},
				"1180128" : {
					"cause" : "删除DHCP Subnet失败。",
					"desc" : "删除DHCP Subnet失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180129" : {
					"cause" : "虚拟化环境没有接入VSAM。",
					"desc" : "虚拟化环境没有接入VSAM。",
					"solution" : "请先接入VSAM，然后重试"
				},
				"1181000" : {
					"cause" : "VPC名称已存在。",
					"desc" : "VPC名称已存在。",
					"solution" : ""
				},
				"1181001" : {
					"cause" : "所选VDC下没有资源或者该VDC下没有可用的网络。",
					"desc" : "所选VDC下没有资源或者该VDC下没有可用的网络。",
					"solution" : ""
				},
				"1181002" : {
					"cause" : "VPC不存在。",
					"desc" : "VPC不存在。",
					"solution" : ""
				},
				"1181003" : {
					"cause" : "最大内部网络个数小于当前VPC下内部网络的个数。",
					"desc" : "最大内部网络个数小于当前VPC下内部网络的个数。",
					"solution" : ""
				},
				"1181004" : {
					"cause" : "最大直连网络个数小于当前VPC下直连网络的个数。",
					"desc" : "最大直连网络个数小于当前VPC下直连网络的个数。",
					"solution" : ""
				},
				"1181005" : {
					"cause" : "最大路由网络个数小于当前VPC下路由网络的个数。",
					"desc" : "最大路由网络个数小于当前VPC下路由网络的个数。",
					"solution" : ""
				},
				"1181006" : {
					"cause" : "最大弹性IP个数小于当前VPC下弹性IP的个数。",
					"desc" : "最大弹性IP个数小于当前VPC下弹性IP的个数。",
					"solution" : ""
				},
				"1181007" : {
					"cause" : "VPC下已有网络，不允许删除。",
					"desc" : "VPC下已有网络，不允许删除。",
					"solution" : ""
				},
				"1181008" : {
					"cause" : "VPC已关联了虚拟防火墙，不允许删除。",
					"desc" : "VPC已关联了虚拟防火墙，不允许删除。",
					"solution" : ""
				},
				"1181010" : {
					"cause" : "vlan不在指定的vpc下。",
					"desc" : "vlan不在指定的vpc下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181011" : {
					"cause" : "网关与子网内系统保留的IP重复。子网内第二个、第三个和第四个IP为系统保留IP，不能作为网关使用。",
					"desc" : "网关与子网内系统保留的IP重复。子网内第二个、第三个和第四个IP为系统保留IP，不能作为网关使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181012" : {
					"cause" : "VPC下已有弹性IP，不允许删除。",
					"desc" : "VPC下已有弹性IP，不允许删除。",
					"solution" : ""
				},
				"1181013" : {
					"cause" : "VPC下有安全组，不允许删除。",
					"desc" : "VPC下有安全组，不允许删除。",
					"solution" : ""
				},
				"1181014" : {
					"cause" : "zone下的VPC数量达到上限。",
					"desc" : "zone下的VPC数量达到上限。",
					"solution" : ""
				},
				"1181015" : {
					"cause" : "VPC当前状态不允许操作。",
					"desc" : "VPC当前状态不允许操作。",
					"solution" : ""
				},
				"1181016" : {
					"cause" : "VPC下已经部署了服务，不允许删除。",
					"desc" : "VPC下已经部署了服务，不允许删除。",
					"solution" : "请先删除服务，在尝试删除。"
				},
				"1181017" : {
					"cause" : "vpc下存在路由器，不能删除。",
					"desc" : "vpc下存在路由器，不能删除。",
					"solution" : "请先删除路由器，再尝试删除"
				},
				"1182000" : {
					"cause" : "每个VPC下仅能创建一个VPN网关，不允许创建多个VPN网关。",
					"desc" : "每个VPC下仅能创建一个VPN网关，不允许创建多个VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1182001" : {
					"cause" : "VPC未申请硬件类型的VFW，不允许创建VPN网关。",
					"desc" : "VPC未申请硬件类型的VFW，不允许创建VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1182002" : {
					"cause" : "VPN网关不存在。",
					"desc" : "VPN网关不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1182003" : {
					"cause" : "VPN网关已被使用。",
					"desc" : "VPN网关已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1182004" : {
					"cause" : "VPN网关名称重复。",
					"desc" : "VPN网关名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1182005" : {
					"cause" : "VPN网关与VPC不匹配。",
					"desc" : "VPN网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1182006" : {
					"cause" : "VPC下没有可用的弹性IP，无法创建VPN网关。",
					"desc" : "VPC下没有可用的弹性IP，无法创建VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1183000" : {
					"cause" : "远端网关地址与VPC下的远端网关地址冲突。",
					"desc" : "远端网关地址与VPC下的远端网关地址冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1183001" : {
					"cause" : "远端网关地址与VPN网关IP地址冲突。",
					"desc" : "远端网关地址与VPN网关IP地址冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1183006" : {
					"cause" : "远端网关与VPC不匹配。",
					"desc" : "远端网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1183007" : {
					"cause" : "网络个数超过远端网关的限额。",
					"desc" : "网络个数超过远端网关的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1183008" : {
					"cause" : "远端网关个数达到VPC下的限额。",
					"desc" : "远端网关个数达到VPC下的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1184001" : {
					"cause" : "用户网关与VPC下的其他用户网关冲突。",
					"desc" : "用户网关与VPC下的其他用户网关冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184002" : {
					"cause" : "本端网关与VPC下的本端网关不同。",
					"desc" : "本端网关与VPC下的本端网关不同。",
					"solution" : "请联系系统管理员。"
				},
				"1184004" : {
					"cause" : "远端用户子网与VPC下的远端用户子网冲突。",
					"desc" : "远端用户子网与VPC下的远端用户子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184005" : {
					"cause" : "远端用户子网与VPC下的子网冲突。",
					"desc" : "远端用户子网与VPC下的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184006" : {
					"cause" : "VPN连接名称重复。",
					"desc" : "VPN连接名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1184007" : {
					"cause" : "VPN连接已存在。",
					"desc" : "VPN连接已存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184008" : {
					"cause" : "VPN连接不存在。",
					"desc" : "VPN连接不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184009" : {
					"cause" : "VPN连接与VPC不匹配。",
					"desc" : "VPN连接与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184010" : {
					"cause" : "VPN连接状态不允许操作。",
					"desc" : "VPN连接状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1184011" : {
					"cause" : "VPN连接本端子网不存在。",
					"desc" : "VPN连接本端子网不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184021" : {
					"cause" : "本端网关不是弹性IP。",
					"desc" : "本端网关不是弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1184022" : {
					"cause" : "本端网络与VPC不匹配。",
					"desc" : "本端网络与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184023" : {
					"cause" : "VPN个数达到VPC下的限额。",
					"desc" : "VPN个数达到VPC下的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1184024" : {
					"cause" : "远端子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"desc" : "远端子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"solution" : "请联系系统管理员。"
				},
				"1184025" : {
					"cause" : "底层创建VPN连接失败。",
					"desc" : "底层创建VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184026" : {
					"cause" : "底层修改VPN连接失败。",
					"desc" : "底层修改VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184027" : {
					"cause" : "底层删除VPN连接失败。",
					"desc" : "底层删除VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184028" : {
					"cause" : "本端网关与VPC不匹配。",
					"desc" : "本端网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184029" : {
					"cause" : "L2tp client可以使用的子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"desc" : "L2tp client可以使用的子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"solution" : "请联系系统管理员。"
				},
				"1184030" : {
					"cause" : "一个VPC只能创建一个类型为L2TP的VPN连接，该VPC下L2TP的VPN连接已存在，不允许创建多个L2TP类型的VPN连接。",
					"desc" : "一个VPC只能创建一个类型为L2TP的VPN连接，该VPC下L2TP的VPN连接已存在，不允许创建多个L2TP类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184031" : {
					"cause" : "该网络与VPC下的远端网络冲突。",
					"desc" : "该网络与VPC下的远端网络冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184032" : {
					"cause" : "该网络与L2TP类型VPN的子网冲突。",
					"desc" : "该网络与L2TP类型VPN的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184033" : {
					"cause" : "L2TP类型的VPN子网信息与其他L2TP类型的VPN子网冲突。",
					"desc" : "L2TP类型的VPN子网信息与其他L2TP类型的VPN子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184034" : {
					"cause" : "远端用户子网与L2TP类型VPN的子网冲突。",
					"desc" : "远端用户子网与L2TP类型VPN的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184035" : {
					"cause" : "L2TP类型的VPN子网与远端用户子网冲突。",
					"desc" : "L2TP类型的VPN子网与远端用户子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184036" : {
					"cause" : "L2TP类型的VPN用户名称重复。",
					"desc" : "L2TP类型的VPN用户名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1184039" : {
					"cause" : "VPC未申请硬件类型的VFW。",
					"desc" : "VPC未申请硬件类型的VFW。",
					"solution" : "请联系系统管理员。"
				},
				"1184040" : {
					"cause" : "当前VPC没有创建VPN网关，请先创建。",
					"desc" : "当前VPC没有创建VPN网关，请先创建。",
					"solution" : "请联系系统管理员。"
				},
				"1184041" : {
					"cause" : "当前VPC已存在IPSec类型的VPN连接，不允许创建其他类型的VPN连接。",
					"desc" : "当前VPC已存在IPSec类型的VPN连接，不允许创建其他类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184042" : {
					"cause" : "当前VPC已存在L2TP类型的VPN连接，不允许创建其他类型的VPN连接。",
					"desc" : "当前VPC已存在L2TP类型的VPN连接，不允许创建其他类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184043" : {
					"cause" : "软件防火墙只支持Ipsec类型的VPN连接，不支持其他类型。",
					"desc" : "软件防火墙只支持Ipsec类型的VPN连接，不支持其他类型。",
					"solution" : "请联系系统管理员。"
				},
				"1184044" : {
					"cause" : "L2TP类型的VPN连接允许接入的用户个数超过系统限制。",
					"desc" : "L2TP类型的VPN连接允许接入的用户个数超过系统限制。",
					"solution" : "请联系系统管理员。"
				},
				"1184045" : {
					"cause" : "底层创建VPN用户失败。",
					"desc" : "底层创建VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184046" : {
					"cause" : "底层修改VPN用户失败。",
					"desc" : "底层修改VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184047" : {
					"cause" : "底层删除VPN用户失败。",
					"desc" : "底层删除VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184048" : {
					"cause" : "底层创建VPN失败。",
					"desc" : "底层创建VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184049" : {
					"cause" : "底层修改VPN失败。",
					"desc" : "底层修改VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184050" : {
					"cause" : "底层删除VPN失败。",
					"desc" : "底层删除VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184051" : {
					"cause" : "L2TP类型的VPN连接用户名与防火墙SSH用户重名。",
					"desc" : "L2TP类型的VPN连接用户名与防火墙SSH用户重名。",
					"solution" : "请联系系统管理员。"
				},
				"1184052" : {
					"cause" : "L2TP VPN连接名称是l2tp(不区分大小写)，名称非法。",
					"desc" : "L2TP VPN连接名称是l2tp(不区分大小写)，名称非法。",
					"solution" : "请联系系统管理员。"
				},
				"1184055" : {
					"cause" : "L2TP VPN用户原密码不正确。",
					"desc" : "L2TP VPN用户原密码不正确。",
					"solution" : "请联系系统管理员。"
				},
				"1190001" : {
					"cause" : "负载均衡创建失败",
					"desc" : "负载均衡创建失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190002" : {
					"cause" : "监视器设置失败",
					"desc" : "监视器设置失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190003" : {
					"cause" : "会话保持设置失败",
					"desc" : "会话保持设置失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190004" : {
					"cause" : "健康检查设置失败",
					"desc" : "健康检查设置失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190005" : {
					"cause" : "负载均衡虚拟机创建失败",
					"desc" : "负载均衡虚拟机创建失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190006" : {
					"cause" : "负载均衡虚拟机获取IP超时",
					"desc" : "负载均衡虚拟机获取IP超时",
					"solution" : "请联系技术支持工程师"
				},
				"1190007" : {
					"cause" : "负载均衡虚拟机创建失败",
					"desc" : "负载均衡虚拟机创建失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190008" : {
					"cause" : "关联VSA网络失败",
					"desc" : "关联VSA网络失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190009" : {
					"cause" : "创建内部网络失败",
					"desc" : "创建内部网络失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190010" : {
					"cause" : "创建外部网络失败",
					"desc" : "创建外部网络失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190011" : {
					"cause" : "创建路由网络失败",
					"desc" : "创建路由网络失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190012" : {
					"cause" : "绑定虚拟机失败",
					"desc" : "绑定虚拟机失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190013" : {
					"cause" : "监视器状态不支持绑定虚拟机",
					"desc" : "监视器状态不支持绑定虚拟机",
					"solution" : "请联系技术支持工程师"
				},
				"1190014" : {
					"cause" : "创建负载均衡虚拟机获取IP失败",
					"desc" : "创建负载均衡虚拟机获取IP失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190015" : {
					"cause" : "监视器关联的VM已经达到最大值",
					"desc" : "监视器关联的VM已经达到最大值",
					"solution" : "请联系技术支持工程师"
				},
				"1190016" : {
					"cause" : "监视器不存在",
					"desc" : "监视器不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190017" : {
					"cause" : "监视器和负载均衡不匹配",
					"desc" : "监视器和负载均衡不匹配",
					"solution" : "请联系技术支持工程师"
				},
				"1190018" : {
					"cause" : "监视器状态为处理中，不能删除",
					"desc" : "监视器状态为处理中，不能删除",
					"solution" : "请联系技术支持工程师"
				},
				"1190019" : {
					"cause" : "负载均衡当前状态不适合此操作",
					"desc" : "负载均衡当前状态不适合此操作",
					"solution" : "请联系技术支持工程师"
				},
				"1190020" : {
					"cause" : "所创建的监视器超过最大值：每个负载均衡下最多创建10个监视器",
					"desc" : "所创建的监视器超过最大值：每个负载均衡下最多创建10个监视器",
					"solution" : "请联系技术支持工程师"
				},
				"1190021" : {
					"cause" : "负载均衡不存在",
					"desc" : "负载均衡不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190022" : {
					"cause" : "负载均衡状态冲突",
					"desc" : "负载均衡状态冲突",
					"solution" : "请联系技术支持工程师"
				},
				"1190023" : {
					"cause" : "监视器状态冲突",
					"desc" : "监视器状态冲突",
					"solution" : "请联系技术支持工程师"
				},
				"1190024" : {
					"cause" : "负载均衡删除失败",
					"desc" : "负载均衡删除失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190025" : {
					"cause" : "负载均衡服务删除失败",
					"desc" : "负载均衡服务删除失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190026" : {
					"cause" : "VSA删除失败",
					"desc" : "VSA删除失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190027" : {
					"cause" : "监视器状态冲突，不允许设置证书",
					"desc" : "监视器状态冲突，不允许设置证书",
					"solution" : "请联系技术支持工程师"
				},
				"1190028" : {
					"cause" : "证书不存在",
					"desc" : "证书不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190029" : {
					"cause" : "设置证书失败",
					"desc" : "设置证书失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190030" : {
					"cause" : "非HTTPS协议的监视器不允许设置证书",
					"desc" : "非HTTPS协议的监视器不允许设置证书",
					"solution" : "请联系技术支持工程师"
				},
				"1190031" : {
					"cause" : "负载均衡虚拟机删除失败",
					"desc" : "负载均衡虚拟机删除失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190032" : {
					"cause" : "监视器状态不支持查询操作",
					"desc" : "监视器状态不支持查询操作",
					"solution" : "请联系技术支持工程师"
				},
				"1190033" : {
					"cause" : "会话保持策略不存在",
					"desc" : "会话保持策略不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190034" : {
					"cause" : "监视器状态不支持绑定虚拟机",
					"desc" : "监视器状态不支持绑定虚拟机",
					"solution" : "请联系技术支持工程师"
				},
				"1190035" : {
					"cause" : "监视器状态不支持修改虚拟机权重",
					"desc" : "监视器状态不支持修改虚拟机权重",
					"solution" : "请联系技术支持工程师"
				},
				"1190036" : {
					"cause" : "监视器状态不支持去关联虚拟机",
					"desc" : "监视器状态不支持去关联虚拟机",
					"solution" : "请联系技术支持工程师"
				},
				"1190037" : {
					"cause" : "算法不支持",
					"desc" : "算法不支持",
					"solution" : "请联系技术支持工程师"
				},
				"1190038" : {
					"cause" : "监视器没有关联虚拟机",
					"desc" : "监视器没有关联虚拟机",
					"solution" : "请联系技术支持工程师"
				},
				"1190039" : {
					"cause" : "负载均衡已绑定弹性IP，不支持删除",
					"desc" : "负载均衡已绑定弹性IP，不支持删除",
					"solution" : "请联系技术支持工程师"
				},
				"1190040" : {
					"cause" : "负载均衡下绑定虚拟机不能超过20个",
					"desc" : "负载均衡下绑定虚拟机不能超过20个",
					"solution" : "请联系技术支持工程师"
				},
				"1190041" : {
					"cause" : "所创建的监视器与待创建监视器的并发连接数权重超过负载均衡最大值",
					"desc" : "所创建的监视器与待创建监视器的并发连接数权重超过负载均衡最大值",
					"solution" : "请联系技术支持工程师"
				},
				"1190042" : {
					"cause" : "待创建监视器的前端端口，后端端口已经存在",
					"desc" : "待创建监视器的前端端口，后端端口已经存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190043" : {
					"cause" : "同时支持关联虚拟机的监视器个数不能超过5个",
					"desc" : "同时支持关联虚拟机的监视器个数不能超过5个",
					"solution" : "请联系技术支持工程师"
				},
				"1190044" : {
					"cause" : "不存在可以创建硬件负载均衡的设备",
					"desc" : "不存在可以创建硬件负载均衡的设备",
					"solution" : "请联系技术支持工程师"
				},
				"1190045" : {
					"cause" : "负载均衡创建失败",
					"desc" : "负载均衡创建失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190047" : {
					"cause" : "F5设备不存在",
					"desc" : "F5设备不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190048" : {
					"cause" : "创建vlan失败",
					"desc" : "创建vlan失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190049" : {
					"cause" : "删除vlan失败",
					"desc" : "删除vlan失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190050" : {
					"cause" : "创建子网失败",
					"desc" : "创建子网失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190051" : {
					"cause" : "删除子网失败",
					"desc" : "删除子网失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190060" : {
					"cause" : "负载均衡与监视器不匹配",
					"desc" : "负载均衡与监视器不匹配",
					"solution" : "请联系技术支持工程师"
				},
				"1190061" : {
					"cause" : "硬件负载均衡下绑定虚拟机ip不允许超过100个",
					"desc" : "硬件负载均衡下绑定虚拟机ip不允许超过100个",
					"solution" : "请联系技术支持工程师"
				},
				"1190062" : {
					"cause" : "已创建的监视器与待创建的监视器的并发吞吐量权重超过负载均衡最大值",
					"desc" : "已创建的监视器与待创建的监视器的并发吞吐量权重超过负载均衡最大值",
					"solution" : "请联系技术支持工程师"
				},
				"1190063" : {
					"cause" : "负载均衡已绑定弹性ip",
					"desc" : "负载均衡已绑定弹性ip",
					"solution" : "请联系技术支持工程师"
				},
				"1190064" : {
					"cause" : "LB上未绑定该弹性ip",
					"desc" : "LB上未绑定该弹性ip",
					"solution" : "请联系技术支持工程师"
				},
				"1190065" : {
					"cause" : "HLB修改失败",
					"desc" : "HLB修改失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190066" : {
					"cause" : "LB上监视器个数不能小于1",
					"desc" : "LB上监视器个数不能小于1",
					"solution" : "请联系技术支持工程师"
				},
				"1190067" : {
					"cause" : "HLB冻结解冻失败",
					"desc" : "HLB冻结解冻失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190068" : {
					"cause" : "外部网络不是路由网络，LB不支持绑定弹性IP",
					"desc" : "外部网络不是路由网络，LB不支持绑定弹性IP",
					"solution" : "请联系技术支持工程师"
				},
				"1190069" : {
					"cause" : "SLB不支持修复。",
					"desc" : "SLB不支持修复。",
					"solution" : "请联系技术支持工程师"
				},
				"1190070" : {
					"cause" : "SLB绑定弹性IP,不支持修复。",
					"desc" : "SLB绑定弹性IP,不支持修复。",
					"solution" : "请联系技术支持工程师"
				},
				"1190071" : {
					"cause" : "网络类型为vlan，不能创建LB。",
					"desc" : "网络类型为vlan，不能创建LB。",
					"solution" : "请联系技术支持工程师"
				},
				"1190073" : {
					"cause" : "LB所在网络为内部网络，与弹性IP所在网络不可达，无法绑定弹性IP。",
					"desc" : "LB所在网络为内部网络，与弹性IP所在网络不可达，无法绑定弹性IP。",
					"solution" : "请联系技术支持工程师"
				},
				"1190101" : {
					"cause" : "最大连接数无效",
					"desc" : "最大连接数无效",
					"solution" : "请联系技术支持工程师"
				},
				"1190102" : {
					"cause" : "最大吞吐量无效",
					"desc" : "最大吞吐量无效",
					"solution" : "请联系技术支持工程师"
				},
				"1190103" : {
					"cause" : "负载均衡名称无效",
					"desc" : "负载均衡名称无效",
					"solution" : "请联系技术支持工程师"
				},
				"1190104" : {
					"cause" : "适配器类型无效",
					"desc" : "适配器类型无效",
					"solution" : "请联系技术支持工程师"
				},
				"1190105" : {
					"cause" : "监视器端口被占用",
					"desc" : "监视器端口被占用",
					"solution" : "请联系技术支持工程师"
				},
				"1190106" : {
					"cause" : "负载均衡名称已被占用",
					"desc" : "负载均衡名称已被占用",
					"solution" : "请联系技术支持工程师"
				},
				"1190107" : {
					"cause" : "数据库操作失败",
					"desc" : "数据库操作失败",
					"solution" : "请联系技术支持工程师"
				},
				"1190108" : {
					"cause" : "负载均衡ID非法",
					"desc" : "负载均衡ID非法",
					"solution" : "请联系技术支持工程师"
				},
				"1190109" : {
					"cause" : "监视器为空",
					"desc" : "监视器为空",
					"solution" : "请联系技术支持工程师"
				},
				"1190110" : {
					"cause" : "负载均衡不存在",
					"desc" : "负载均衡不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190111" : {
					"cause" : "负载均衡状态不正确",
					"desc" : "负载均衡状态不正确",
					"solution" : "请联系技术支持工程师"
				},
				"1190112" : {
					"cause" : "虚拟机为空",
					"desc" : "虚拟机为空",
					"solution" : "请联系技术支持工程师"
				},
				"1190113" : {
					"cause" : "监视器不存在",
					"desc" : "监视器不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190114" : {
					"cause" : "监视器和负载均衡不匹配",
					"desc" : "监视器和负载均衡不匹配",
					"solution" : "请联系技术支持工程师"
				},
				"1190115" : {
					"cause" : "持久化类型与监视器协议不匹配",
					"desc" : "持久化类型与监视器协议不匹配",
					"solution" : "请联系技术支持工程师"
				},
				"1190116" : {
					"cause" : "证书为空",
					"desc" : "证书为空",
					"solution" : "请联系技术支持工程师"
				},
				"1190117" : {
					"cause" : "证书不存在",
					"desc" : "证书不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190118" : {
					"cause" : "VSA不存在",
					"desc" : "VSA不存在",
					"solution" : "请联系技术支持工程师"
				},
				"1190502" : {
					"cause" : "设备不可达，icmp无法ping通设备",
					"desc" : "设备不可达，icmp无法ping通设备",
					"solution" : "请确认网络状况是否异常"
				},
				"1190503" : {
					"cause" : "IP地址重复",
					"desc" : "IP地址重复",
					"solution" : "请确认是否为重复接入"
				},
				"1200001" : {
					"cause" : "VPC下不存在部署服务",
					"desc" : "VPC下不存在部署服务",
					"solution" : "请确认VPC下是否存在部署服务"
				},
				"1200008" : {
					"cause" : "修改路由失败",
					"desc" : "修改路由失败",
					"solution" : "请联系技术支持工程师"
				},
				"1200013" : {
					"cause" : "部署服务已存在",
					"desc" : "部署服务已存在",
					"solution" : "请确认VPC下部署服务是否已存在"
				},
				"1200014" : {
					"cause" : "状态冲突，当前操作不允许",
					"desc" : "状态冲突，当前操作不允许",
					"solution" : "请联系技术支持工程师"
				},
				"1200015" : {
					"cause" : "PVM模板不存在",
					"desc" : "PVM模板不存在",
					"solution" : "请联系系统管理员，确认PVM模板是否存在"
				},
				"1200016" : {
					"cause" : "部署服务虚拟机获取ip失败。",
					"desc" : "部署服务虚拟机获取ip失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200017" : {
					"cause" : "部署服务非运行态",
					"desc" : "部署服务非运行态",
					"solution" : "请检查部署服务的状态"
				},
				"1200023" : {
					"cause" : "部署服务的网络超过上限",
					"desc" : "部署服务的网络超过上限",
					"solution" : "请联系系统管理员"
				},
				"1200024" : {
					"cause" : "部署服务的路由网络超过上限",
					"desc" : "部署服务的路由网络超过上限",
					"solution" : "请联系系统管理员"
				},
				"1200025" : {
					"cause" : "部署服务网络重复",
					"desc" : "部署服务网络重复",
					"solution" : "请移除重复的网络"
				},
				"1211001" : {
					"cause" : "组播IP池不存在。",
					"desc" : "组播IP池不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"1211002" : {
					"cause" : "组播IP池已被分配。",
					"desc" : "组播IP池已被分配。",
					"solution" : "请刷新页面后重试。"
				},
				"1211003" : {
					"cause" : "没有可用的组播IP池。",
					"desc" : "没有可用的组播IP池。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211004" : {
					"cause" : "组播IP已回收。",
					"desc" : "组播IP已回收。",
					"solution" : "请刷新页面后重试。"
				},
				"1211006" : {
					"cause" : "和已有组播IP池有重叠。",
					"desc" : "和已有组播IP池有重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211007" : {
					"cause" : "组播IP池数量超过上限。",
					"desc" : "组播IP池数量超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1220001" : {
					"cause" : "路由器的当前状态不允许操作",
					"desc" : "路由器的当前状态不允许操作",
					"solution" : "请联系系统管理员。"
				},
				"1220002" : {
					"cause" : "没有接入汇聚交换机",
					"desc" : "没有接入汇聚交换机",
					"solution" : "请联系系统管理员，接入汇聚交换机"
				},
				"1220003" : {
					"cause" : "指定的VPC已经创建了路由器",
					"desc" : "指定的VPC已经创建了路由器",
					"solution" : ""
				},
				"1220004" : {
					"cause" : "VPC中存在路由网络，不能删除路由器",
					"desc" : "VPC中存在路由网络，不能删除路由器",
					"solution" : "请先删除路由网络，再删除路由器"
				},
				"1220006" : {
					"cause" : "当前组网模式不支持硬件路由器。",
					"desc" : "当前组网模式不支持硬件路由器。",
					"solution" : ""
				},
				"1220007" : {
					"cause" : "路由器不属于指定VPC。",
					"desc" : "路由器不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1221001" : {
					"cause" : "VRF 不存在",
					"desc" : "VRF 不存在",
					"solution" : "Please contact the system administrator."
				},
				"1290000" : {
					"cause" : "没有修改过管理子网，不需要进行FM管理子网恢复操作。",
					"desc" : "没有修改过管理子网，不需要进行FM管理子网恢复操作。",
					"solution" : "没有修改过管理子网，不需要进行FM管理子网恢复操作。"
				},
				"1290002" : {
					"cause" : "VSAM不存在。",
					"desc" : "VSAM不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290006" : {
					"cause" : "恢复VSAM数据失败，请重试。",
					"desc" : "恢复VSAM数据失败，请重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290007" : {
					"cause" : "VSAM正在审计中。",
					"desc" : "VSAM正在审计中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290011" : {
					"cause" : "添加或者删除静态ip-mac绑定，mac重复。",
					"desc" : "添加或者删除静态ip-mac绑定，mac重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290012" : {
					"cause" : "VSA虚拟机不存在。",
					"desc" : "VSA虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290013" : {
					"cause" : "VSA上DHCP服务功能未开启。",
					"desc" : "VSA上DHCP服务功能未开启。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290035" : {
					"cause" : "dhcp服务器上有任务正在运行，请稍后再试。",
					"desc" : "dhcp服务器上有任务正在运行，请稍后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290044" : {
					"cause" : "DHCP relay服务异常。",
					"desc" : "DHCP relay服务异常。",
					"solution" : "请稍后重试。"
				},
				"1290045" : {
					"cause" : "接口IP段冲突。",
					"desc" : "接口IP段冲突。",
					"solution" : "请换一个子网IP重新尝试。"
				},
				"1290063" : {
					"cause" : "系统服务虚拟机时间与其管理节点不一致，请联系管理员处理保证系统时间一致。",
					"desc" : "系统服务虚拟机时间与其管理节点不一致，请联系管理员处理保证系统时间一致。",
					"solution" : "系统服务虚拟机时间与其管理节点不一致，请联系管理员处理保证系统时间一致。"
				},
				"1310002" : {
					"cause" : "该安全组中的安全规则数超过上限。",
					"desc" : "该安全组中的安全规则数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310003" : {
					"cause" : "安全规则不存在。",
					"desc" : "安全规则不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310021" : {
					"cause" : "网卡不属于当前虚拟机。",
					"desc" : "网卡不属于当前虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310022" : {
					"cause" : "虚拟机状态必须为运行中、已停止、已休眠、已暂停，其网卡才能加入或者退出安全组。",
					"desc" : "虚拟机状态必须为运行中、已停止、已休眠、已暂停，其网卡才能加入或者退出安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310023" : {
					"cause" : "网卡不属于安全组所在的VPC内。",
					"desc" : "网卡不属于安全组所在的VPC内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310024" : {
					"cause" : "网卡所属的网络类型不允许网卡加入安全组。",
					"desc" : "网卡所属的网络类型不允许网卡加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310025" : {
					"cause" : "待添加成员已经加入安全组，不允许再加入其他安全组。",
					"desc" : "待添加成员已经加入安全组，不允许再加入其他安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310026" : {
					"cause" : "待加入安全组的成员列表中有重复成员。",
					"desc" : "待加入安全组的成员列表中有重复成员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310027" : {
					"cause" : "待退出安全组的成员不存在。",
					"desc" : "待退出安全组的成员不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310028" : {
					"cause" : "默认安全组下没有规则。",
					"desc" : "默认安全组下没有规则。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310029" : {
					"cause" : "网卡不属于FusionComputer，不能进行安全组操作。",
					"desc" : "网卡不属于FusionComputer，不能进行安全组操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310030" : {
					"cause" : "安全组审计中，无法进行操作。",
					"desc" : "安全组审计中，无法进行操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310031" : {
					"cause" : "网卡正在加入安全组。",
					"desc" : "网卡正在加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310032" : {
					"cause" : "网卡正在退出安全组。",
					"desc" : "网卡正在退出安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310033" : {
					"cause" : "安全组中的成员数超过上限。",
					"desc" : "安全组中的成员数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310034" : {
					"cause" : "网卡类型不适合加入安全组。",
					"desc" : "网卡类型不适合加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310050" : {
					"cause" : "当前VPC下有同名的安全组。",
					"desc" : "当前VPC下有同名的安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310051" : {
					"cause" : "当前VPC下的安全组总数超过上限。",
					"desc" : "当前VPC下的安全组总数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310052" : {
					"cause" : "安全组不存在。",
					"desc" : "安全组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310053" : {
					"cause" : "安全组被授权访问其他安全组。",
					"desc" : "安全组被授权访问其他安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310054" : {
					"cause" : "安全组中有成员。",
					"desc" : "安全组中有成员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310055" : {
					"cause" : "查询安全组时，请求的查询数量超限。",
					"desc" : "查询安全组时，请求的查询数量超限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310056" : {
					"cause" : "安全规则中的子网或IP段非法。",
					"desc" : "安全规则中的子网或IP段非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310057" : {
					"cause" : "安全规则中的端口号非法。",
					"desc" : "安全规则中的端口号非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310058" : {
					"cause" : "安全规则重复。",
					"desc" : "安全规则重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310059" : {
					"cause" : "被授权的安全组不存在。",
					"desc" : "被授权的安全组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310063" : {
					"cause" : "安全规则处于创建中。",
					"desc" : "安全规则处于创建中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310064" : {
					"cause" : "安全规则处于删除中。",
					"desc" : "安全规则处于删除中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310065" : {
					"cause" : "vpc下没有FusionComputer资源。",
					"desc" : "vpc下没有FusionComputer资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310066" : {
					"cause" : "安全组名称非法。",
					"desc" : "安全组名称非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310067" : {
					"cause" : "删除失败，请先将虚拟机网卡退出安全组再删除。",
					"desc" : "删除失败，请先将虚拟机网卡退出安全组再删除。",
					"solution" : "请先将虚拟机网卡退出安全组再删除。"
				},
				"1310074" : {
					"cause" : "安全组不属于指定VPC。",
					"desc" : "安全组不属于指定VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310075": {
					"cause":"虚拟机属于共享VPC或者不在当前VDC内，不支持配置浮动IP地址。",
					"desc":"虚拟机属于共享VPC或者不在当前VDC内，不支持配置浮动IP地址。",
					"solution":"虚拟机属于共享VPC或者不在当前VDC内，不支持配置浮动IP地址。"
				},
				"1310076" : {
					"cause" : "一个网卡最多只能配置一个浮动IP。",
					"desc" : "一个网卡最多只能配置一个浮动IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310077" : {
					"cause" : "最多只能删除一个浮动IP。",
					"desc" : "最多只能删除一个浮动IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310079" : {
					"cause" : "浮动IP地址不存在。",
					"desc" : "浮动IP地址不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310081" : {
					"cause" : "网卡正在配置浮动IP。",
					"desc" : "网卡正在配置浮动IP。",
					"solution" : "请联系系统管理员。"
				},
				"1410021" : {
					"cause" : "挂载块存储失败，虚拟机所在的vpc和块存储所在的vpc不是同一个。",
					"desc" : "挂载块存储失败，虚拟机所在的vpc和块存储所在的vpc不是同一个。",
					"solution" : "请检查虚拟机与块存储。"
				},
				"1502006" : {
					"cause" : "vtep信息不完整。",
					"desc" : "vtep信息不完整。",
					"solution" : "输入完整的vtep信息。"
				},
				"1502007" : {
					"cause" : "vtep ip不正确。",
					"desc" : "vtep ip不正确。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502008" : {
					"cause" : "vtep mask必须介于0-32之间。",
					"desc" : "vtep mask必须介于0-32之间。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502009" : {
					"cause" : "vtep gw不正确。",
					"desc" : "vtep gw不正确。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502010" : {
					"cause" : "vtep vlan必须介于0-4094之间。",
					"desc" : "vtep vlan必须介于0-4094之间。",
					"solution" : "输入正确的vtep信息。"
				},
				"1600010" : {
					"cause" : "可用分区下不存在任何集群。",
					"desc" : "可用分区下不存在任何集群。",
					"solution" : "请联系技术支持工程师。"
				},
				"4000002" : {
					"cause" : "不支持此功能。",
					"desc" : "不支持此功能。",
					"solution" : "不支持此功能。"
				},
				"4000004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员或查看帮助手册。"
				},
				"4000010" : {
					"cause" : "参数不符合规范。",
					"desc" : "参数不符合规范。",
					"solution" : "请按照参数输入规范重新输入。"
				},
				"4000011" : {
					"cause" : "外部系统通信异常，如返回为空或字段不符等。",
					"desc" : "外部系统通信异常，如返回为空或字段不符等。",
					"solution" : "请联系管理员或查看帮助手册。"
				},
				"4000018" : {
					"cause" : "系统资源不足。",
					"desc" : "系统资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"4001003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员。"
				},
				"4001005" : {
					"cause" : "虚拟化服务鉴权失败。",
					"desc" : "虚拟化服务鉴权失败。",
					"solution" : "请联系管理员。"
				},
				"4001006" : {
					"cause" : "虚拟化服务鉴权失败。",
					"desc" : "虚拟化服务鉴权失败。",
					"solution" : "请联系管理员。"
				},
				"4001008" : {
					"cause" : "该虚拟机模板数据损坏或虚拟机模板不存在。",
					"desc" : "该虚拟机模板数据损坏或虚拟机模板不存在。",
					"solution" : "请删除此虚拟机模板。"
				},
				"4001010" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员。"
				},
				"4002000" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员。"
				},
				"4002005" : {
					"cause" : "虚拟机模板不存在。",
					"desc" : "虚拟机模板不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员。"
				},
				"4002015" : {
					"cause" : "输入的参数不符合规范。",
					"desc" : "输入的参数不符合规范。",
					"solution" : "请按照名称输入规范重新输入参数。"
				},
				"4002019" : {
					"cause" : "输入的参数不符合规范。",
					"desc" : "输入的参数不符合规范。",
					"solution" : "请按照描述输入规范重新输入参数。"
				},
				"4002071" : {
					"cause" : "服务器处于维护模式时不允许创建虚拟机。",
					"desc" : "服务器处于维护模式时不允许创建虚拟机。",
					"solution" : "请联系管理员。"
				},
				"4002082" : {
					"cause" : "配置的虚拟CPU预留不符合规范。",
					"desc" : "配置的虚拟CPU预留不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002083" : {
					"cause" : "配置的虚拟CPU份额不符合规范。",
					"desc" : "配置的虚拟CPU份额不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002084" : {
					"cause" : "配置的虚拟CPU限制不符合规范。",
					"desc" : "配置的虚拟CPU限制不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002085" : {
					"cause" : "配置的虚拟机内存个数不符合规范。",
					"desc" : "配置的虚拟机内存个数不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002086" : {
					"cause" : "配置的虚拟机内存份额不符合规范。",
					"desc" : "配置的虚拟机内存份额不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002087" : {
					"cause" : "硬盘编号不合法。",
					"desc" : "硬盘编号不合法。",
					"solution" : "请联系管理员。"
				},
				"4002088" : {
					"cause" : "配置的虚拟机硬盘大小不符合规范。",
					"desc" : "配置的虚拟机硬盘大小不符合规范。",
					"solution" : "查看帮助手册。"
				},
				"4002089" : {
					"cause" : "虚拟机硬盘超过最大数量。",
					"desc" : "虚拟机硬盘超过最大数量。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002091" : {
					"cause" : "虚拟机网卡网络为空。",
					"desc" : "虚拟机网卡网络为空。",
					"solution" : "请联系管理员。"
				},
				"4002092" : {
					"cause" : "配置的虚拟机网卡数量超过系统最大值。",
					"desc" : "配置的虚拟机网卡数量超过系统最大值。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002093" : {
					"cause" : "配置启动虚拟机不符合规范",
					"desc" : "配置启动虚拟机不符合规范",
					"solution" : "请联系管理员。"
				},
				"4002094" : {
					"cause" : "虚拟机故障处理策略不符合规范",
					"desc" : "虚拟机故障处理策略不符合规范",
					"solution" : "请联系管理员。"
				},
				"4002096" : {
					"cause" : "虚拟机Tools未启动。",
					"desc" : "虚拟机Tools未启动。",
					"solution" : "请联系管理员。"
				},
				"4002097" : {
					"cause" : "指定节点不存在。",
					"desc" : "指定节点不存在。",
					"solution" : "请联系管理员。"
				},
				"4002098" : {
					"cause" : "服务器不存在。",
					"desc" : "服务器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002099" : {
					"cause" : "指定的逻辑资源集群不存在。",
					"desc" : "指定的逻辑资源集群不存在。",
					"solution" : "请刷新界面查看相关的资源集群是否存在或联系管理员。"
				},
				"4002104" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员。"
				},
				"4002105" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请在该虚拟机挂载ISO文件。"
				},
				"4002106" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "查看帮助手册,按此格式输入: %%%\u00192.168.1.1%%***%%***.iso。"
				},
				"4002110" : {
					"cause" : "配置的虚拟机内存限制不符合规范。",
					"desc" : "配置的虚拟机内存限制不符合规范。",
					"solution" : "参数错误。"
				},
				"4002111" : {
					"cause" : "操作系统类型不正确。",
					"desc" : "操作系统类型不正确。",
					"solution" : "请根据下拉列表选项重新选择。"
				},
				"4002112" : {
					"cause" : "操作系统版本不正确。",
					"desc" : "操作系统版本不正确。",
					"solution" : "请根据下拉列表选项重新选择。"
				},
				"4002113" : {
					"cause" : "配置的虚拟CPU预留值不符合规范。",
					"desc" : "配置的虚拟CPU预留值不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002114" : {
					"cause" : "配置的虚拟机内存预留值不符合规范。",
					"desc" : "配置的虚拟机内存预留值不符合规范。",
					"solution" : "请查看帮助手册，根据规范重新配置。"
				},
				"4002115" : {
					"cause" : "MAC地址重复。",
					"desc" : "MAC地址重复。",
					"solution" : "请联系管理员。"
				},
				"4002117" : {
					"cause" : "MAC资源不足。",
					"desc" : "MAC资源不足。",
					"solution" : "请联系管理员。"
				},
				"4002121" : {
					"cause" : "MAC地址不合法。",
					"desc" : "MAC地址不合法。",
					"solution" : "请联系管理员。"
				},
				"4002123" : {
					"cause" : "集群或主机不能为空。",
					"desc" : "集群或主机不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002124" : {
					"cause" : "数据存储标识必选。",
					"desc" : "数据存储标识必选。",
					"solution" : "请选择数据存储标识。"
				},
				"4002125" : {
					"cause" : "操作系统类型不能为空。",
					"desc" : "操作系统类型不能为空。",
					"solution" : "请选择操作系统类型。"
				},
				"4002127" : {
					"cause" : "硬盘插槽号不能重复。",
					"desc" : "硬盘插槽号不能重复。",
					"solution" : "请联系管理员。"
				},
				"4002133" : {
					"cause" : "目标节点/集群没有满足虚拟机运行的存储条件。",
					"desc" : "目标节点/集群没有满足虚拟机运行的存储条件。",
					"solution" : "请联系管理员。"
				},
				"4002134" : {
					"cause" : "目标节点/集群没有满足虚拟机运行的网络条件。",
					"desc" : "目标节点/集群没有满足虚拟机运行的网络条件。",
					"solution" : "请联系管理员。"
				},
				"4002136" : {
					"cause" : "已存在的磁盘不能挂载此虚拟机上（该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了或该磁盘状态不允许挂载）。",
					"desc" : "已存在的磁盘不能挂载此虚拟机上（该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了或该磁盘状态不允许挂载）。",
					"solution" : "请联系管理员。"
				},
				"4002137" : {
					"cause" : "单个虚拟机最多只能挂载4个共享磁盘。",
					"desc" : "单个虚拟机最多只能挂载4个共享磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002138" : {
					"cause" : "指定虚拟存在该共享磁盘时不允许重复挂载。",
					"desc" : "指定虚拟存在该共享磁盘时不允许重复挂载。",
					"solution" : "请联系管理员。"
				},
				"4002140" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002146" : {
					"cause" : "指定集群或主机下不存在存储条件满足虚拟机启动的节点。",
					"desc" : "指定集群或主机下不存在存储条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002147" : {
					"cause" : "指定集群或主机下不存在网络条件满足虚拟机启动的节点。",
					"desc" : "指定集群或主机下不存在网络条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002158" : {
					"cause" : "存储资源不足。",
					"desc" : "存储资源不足。",
					"solution" : "请联系管理员。"
				},
				"4002159" : {
					"cause" : "数据存储不存在。",
					"desc" : "数据存储不存在。",
					"solution" : "请联系管理员。"
				},
				"4002173" : {
					"cause" : "磁盘大小非法。",
					"desc" : "磁盘大小非法。",
					"solution" : "请联系管理员。"
				},
				"4002206" : {
					"cause" : "该分布式虚拟交换机不存在。",
					"desc" : "该分布式虚拟交换机不存在。",
					"solution" : "请联系管理员。"
				},
				"4002227" : {
					"cause" : "虚拟机网卡网络不存在。",
					"desc" : "虚拟机网卡网络不存在。",
					"solution" : "请联系管理员。"
				},
				"4002275" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002286" : {
					"cause" : "虚拟机正在执行此操作。",
					"desc" : "虚拟机正在执行此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002288" : {
					"cause" : "虚拟机已经为停止状态或休眠状态，不能执行该操作。",
					"desc" : "虚拟机已经为停止状态或休眠状态，不能执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002289" : {
					"cause" : "虚拟机正在休眠中。",
					"desc" : "虚拟机正在休眠中。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002295" : {
					"cause" : "当前虚拟机所在服务器已挂载光驱，不能进行挂载。",
					"desc" : "当前虚拟机所在服务器已挂载光驱，不能进行挂载。",
					"solution" : "请联系管理员。"
				},
				"4002312" : {
					"cause" : "该虚拟机存在快照，无法转化为模板。",
					"desc" : "该虚拟机存在快照，无法转化为模板。",
					"solution" : "请删除该虚拟机的快照后重试。"
				},
				"4002320" : {
					"cause" : "用该子网给虚拟机分配ip，子网中的可用ip数目不足。",
					"desc" : "用该子网给虚拟机分配ip，子网中的可用ip数目不足。",
					"solution" : "请联系管理员。"
				},
				"4002345" : {
					"cause" : "创建磁盘失败，可能由网络、SAN设备异常或数据存储剩余容量不足导致，请排查。",
					"desc" : "创建磁盘失败，可能由网络、SAN设备异常或数据存储剩余容量不足导致，请排查。",
					"solution" : ""
				},
				"4002346" : {
					"cause" : "关联网络失败。",
					"desc" : "关联网络失败。",
					"solution" : "请联系管理员。"
				},
				"4002347" : {
					"cause" : "绑定磁盘失败。",
					"desc" : "绑定磁盘失败。",
					"solution" : "请联系管理员。"
				},
				"4002348" : {
					"cause" : "虚拟化业务进程异常。",
					"desc" : "虚拟化业务进程异常。",
					"solution" : "请联系管理员。"
				},
				"4002349" : {
					"cause" : "虚拟机异常停止。",
					"desc" : "虚拟机异常停止。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002350" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002351" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002352" : {
					"cause" : "无法连接共享文件所在机器。",
					"desc" : "无法连接共享文件所在机器。",
					"solution" : "请检查共享文件所在机器与服务器网络是否互通，是否已经关闭防火墙。"
				},
				"4002353" : {
					"cause" : "无法访问共享文件。",
					"desc" : "无法访问共享文件。",
					"solution" : "请检查用户名和密码的正确性，文件是否共享，是否已经关闭防火墙。"
				},
				"4002354" : {
					"cause" : "共享文件不存在。",
					"desc" : "共享文件不存在。",
					"solution" : "请检查共享路径下是否有此文件。"
				},
				"4002355" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "请联系管理员。"
				},
				"4002357" : {
					"cause" : "虚拟机网卡名称不能重复。",
					"desc" : "虚拟机网卡名称不能重复。",
					"solution" : ""
				},
				"4002358" : {
					"cause" : "虚拟机模板正在用于创建虚拟机，不能进行该操作。",
					"desc" : "虚拟机模板正在用于创建虚拟机，不能进行该操作。",
					"solution" : "请稍后重试。"
				},
				"4002359" : {
					"cause" : "虚拟机各网卡所属网络需要位于统一交换机下。",
					"desc" : "虚拟机各网卡所属网络需要位于统一交换机下。",
					"solution" : "请联系管理员。"
				},
				"4002366" : {
					"cause" : "无法找到该虚拟机模板信息。",
					"desc" : "无法找到该虚拟机模板信息。",
					"solution" : "请联系技术支持工程师。"
				},
				"4002371" : {
					"cause" : "CPU资源不足。",
					"desc" : "CPU资源不足。",
					"solution" : "请联系管理员。"
				},
				"4002372" : {
					"cause" : "内存资源不足。",
					"desc" : "内存资源不足。",
					"solution" : "请联系管理员。"
				},
				"4002373" : {
					"cause" : "超过可用主机的网卡上限。",
					"desc" : "超过可用主机的网卡上限。",
					"solution" : "请联系管理员。"
				},
				"4002374" : {
					"cause" : "供选择的主机均异常。",
					"desc" : "供选择的主机均异常。",
					"solution" : "请联系管理员。"
				},
				"4002375" : {
					"cause" : "供选择的主机均处于维护模式。",
					"desc" : "供选择的主机均处于维护模式。",
					"solution" : "请联系管理员。"
				},
				"4002376" : {
					"cause" : "供选择的主机均不可用。",
					"desc" : "供选择的主机均不可用。",
					"solution" : "请联系管理员。"
				},
				"4002377" : {
					"cause" : "无供选择的主机。",
					"desc" : "无供选择的主机。",
					"solution" : "请联系管理员。"
				},
				"4002379" : {
					"cause" : "给虚拟机分配ip只能有一块网卡带有网关。",
					"desc" : "给虚拟机分配ip只能有一块网卡带有网关。",
					"solution" : "请联系管理员。"
				},
				"4002415" : {
					"cause" : "虚拟机系统繁忙，请稍后重试。",
					"desc" : "虚拟机系统繁忙，请稍后重试。",
					"solution" : "请稍后重试。"
				},
				"4005000" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "请重新命名。"
				},
				"4040015" : {
					"cause" : "与虚拟化环境断开连接。",
					"desc" : "与虚拟化环境断开连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"4040024" : {
					"cause" : "资源集群不存在。",
					"desc" : "资源集群不存在。",
					"solution" : "请重新选择资源集群。"
				},
				"4040140" : {
					"cause" : "无法获取集群下最大cpu核数。",
					"desc" : "无法获取集群下最大cpu核数。",
					"solution" : "请确认集群下主机最大的cpu核数。"
				},
				"4040143" : {
					"cause" : "待创建的虚拟机核数超过集群下主机最大的cpu核数。",
					"desc" : "待创建的虚拟机核数超过集群下主机最大的cpu核数。",
					"solution" : "请确认虚拟机核数合法。"
				},
				"4040145" : {
					"cause" : "所需CPU核数超过主机CPU核数。",
					"desc" : "所需CPU核数超过主机CPU核数。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070007" : {
					"cause" : "所选虚拟机不是由虚拟机模板创建，不能修复。",
					"desc" : "所选虚拟机不是由虚拟机模板创建，不能修复。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070008" : {
					"cause" : "待修复虚拟机磁盘已经达到上限，不能修复。",
					"desc" : "待修复虚拟机磁盘已经达到上限，不能修复。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070021" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070022" : {
					"cause" : "虚拟机状态冲突，只有运行中或已停止状态才能修复。",
					"desc" : "虚拟机状态冲突，只有运行中或已停止状态才能修复。",
					"solution" : "请确认虚拟机状态后再试。"
				},
				"4070033" : {
					"cause" : "该虚拟机/模板存在未完成的任务，待任务完成后重试。",
					"desc" : "该虚拟机/模板存在未完成的任务，待任务完成后重试。",
					"solution" : "待任务完成后重试。"
				},
				"4070042" : {
					"cause" : "当前虚拟机未处于运行中状态，不支持该操作。",
					"desc" : "当前虚拟机未处于运行中状态，不支持该操作。",
					"solution" : "请在虚拟机状态允许情况下进行操作。"
				},
				"4070045" : {
					"cause" : "虚拟机模板正在发现中",
					"desc" : "虚拟机模板正在发现中",
					"solution" : "请联系技术支持工程师"
				},
				"4070052" : {
					"cause" : "集群下的cpu资源不足",
					"desc" : "集群下的cpu资源不足",
					"solution" : ""
				},
				"4070053" : {
					"cause" : "集群下的内存资源不足",
					"desc" : "集群下的内存资源不足",
					"solution" : ""
				},
				"4070054" : {
					"cause" : "集群下的共享存储资源不足。共享存储是指除本地硬盘和虚拟化本地磁盘类型外的存储。",
					"desc" : "集群下的共享存储资源不足。共享存储是指除本地硬盘和虚拟化本地磁盘类型外的存储。",
					"solution" : ""
				},
				"4070083" : {
					"cause" : "虚拟机不支持非停止状态进行删除操作。",
					"desc" : "虚拟机不支持非停止状态进行删除操作。",
					"solution" : "请关闭虚拟机后再进行删除操作。"
				},
				"4070097" : {
					"cause" : "当前存储类型只支持创建精简磁盘。",
					"desc" : "当前存储类型只支持创建精简磁盘。",
					"solution" : "请将磁盘开启精简配置。"
				},
				"4070133" : {
					"cause" : "挂载光驱时填写的参数有误。",
					"desc" : "挂载光驱时填写的参数有误。",
					"solution" : "请联系系统管理员。"
				},
				"4070134" : {
					"cause" : "该虚拟机已锁定DVD驱动托盘，因此DVD无法弹出。",
					"desc" : "该虚拟机已锁定DVD驱动托盘，因此DVD无法弹出。",
					"solution" : "请重启虚拟机。"
				},
				"4070135" : {
					"cause" : "驱动为空，操作无法进行。",
					"desc" : "驱动为空，操作无法进行。",
					"solution" : "请确认驱动是否为空。"
				},
				"4070136" : {
					"cause" : "文件路径错误或安装文件不存在。",
					"desc" : "文件路径错误或安装文件不存在。",
					"solution" : "请检查路径是否正确或路径下是否存在该安装文件。"
				},
				"4070211" : {
					"cause" : "集群下不存在支持创建延迟置零磁盘的存储。",
					"desc" : "集群下不存在支持创建延迟置零磁盘的存储。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070225" : {
					"cause" : "当前存储类型不支持创建普通延迟置零磁盘。",
					"desc" : "当前存储类型不支持创建普通延迟置零磁盘。",
					"solution" : "请重新选择磁盘类型。"
				},
				"4070514" : {
					"cause" : "集群下不存在支持创建精简配置磁盘的存储。",
					"desc" : "集群下不存在支持创建精简配置磁盘的存储。",
					"solution" : "请重新选择合适的集群进行操作。"
				},
				"4070529" : {
					"cause" : "虚拟机操作系统不支持打开CPU热插开关。",
					"desc" : "虚拟机操作系统不支持打开CPU热插开关。",
					"solution" : "请更换操作系统后重试。"
				},
				"4070530" : {
					"cause" : "虚拟机不支持启用CPU热插拔。",
					"desc" : "虚拟机不支持启用CPU热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070531" : {
					"cause" : "CPU热插拔开关非法。",
					"desc" : "CPU热插拔开关非法。",
					"solution" : "请选择合适的CPU热插拔开关。"
				},
				"4070532" : {
					"cause" : "虚拟机操作系统不支持打开内存热插开关。",
					"desc" : "虚拟机操作系统不支持打开内存热插开关。",
					"solution" : "请联系技术支持工程师。"
				},
				"4070533" : {
					"cause" : "内存热插拔开关非法。",
					"desc" : "内存热插拔开关非法。",
					"solution" : "请选择合适的内存热插拔开关。"
				},
				"4075006" : {
					"cause" : "虚拟机状态冲突，不允许此操作。",
					"desc" : "虚拟机状态冲突，不允许此操作。",
					"solution" : "请刷新虚拟机的状态。"
				},
				"4075015" : {
					"cause" : "VMware Tools响应异常",
					"desc" : "VMware Tools响应异常",
					"solution" : "请联系系统管理员"
				},
				"4075035" : {
					"cause" : "当前存储类型不支持创建精简磁盘。",
					"desc" : "当前存储类型不支持创建精简磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"4075048" : {
					"cause" : "虚拟机设置网络启动失败。",
					"desc" : "虚拟机设置网络启动失败。",
					"solution" : "请选择合适的启动方式。"
				},
				"4075049" : {
					"cause" : "虚拟机设置硬盘启动失败。",
					"desc" : "虚拟机设置硬盘启动失败。",
					"solution" : "请选择合适的启动方式。"
				},
				"4100001" : {
					"cause" : "缺少必选参数",
					"desc" : "缺少必选参数",
					"solution" : "请检查参数。"
				},
				"4100002" : {
					"cause" : "模板名称非法，合法名称只包含中文、英文、数字、空格以及. _ - ( ) [ ] #符号。",
					"desc" : "模板名称非法，合法名称只包含中文、英文、数字、空格以及. _ - ( ) [ ] #符号。",
					"solution" : "请检查模板名称中是否只包含中文、英文、数字、空格以及. _ - ( ) [ ] #符号。"
				},
				"4140016" : {
					"cause" : "系统内部通讯异常。",
					"desc" : "系统内部通讯异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4140048" : {
					"cause" : "虚拟化环境不存在已经关联的集群。",
					"desc" : "虚拟化环境不存在已经关联的集群。",
					"solution" : "请先关联集群。"
				},
				"4410011" : {
					"cause" : "集群下存储介质为“SAN-SATA”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-SATA”类型的数据存储资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"4410012" : {
					"cause" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"4410013" : {
					"cause" : "集群下存储介质为“SAN-SSD”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-SSD”类型的数据存储资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"4410014" : {
					"cause" : "集群下存储介质为“SAN-SAS&FC”类型的数据存储资源不足。",
					"desc" : "集群下存储介质为“SAN-SAS&FC”类型的数据存储资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"4410015" : {
					"cause" : "集群下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"desc" : "集群下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"solution" : "请联系技术支持工程师。"
				},
				"4410018" : {
					"cause" : "指定的存储资源不足或者无法使虚拟机正常启动。",
					"desc" : "指定的存储资源不足或者无法使虚拟机正常启动。",
					"solution" : "指定的存储资源不足或者无法使虚拟机正常启动。"
				},
				"4800000" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4800001" : {
					"cause" : "参数错误。",
					"desc" : "参数错误。",
					"solution" : "请确认输入正确的参数。"
				},
				"4800002" : {
					"cause" : "不支持此功能。",
					"desc" : "不支持此功能。",
					"solution" : "请联系管理员。"
				},
				"4800003" : {
					"cause" : "1.网络断连；2.云管理服务器磁盘空间不足；3.其他。",
					"desc" : "1.网络断连；2.云管理服务器磁盘空间不足；3.其他。",
					"solution" : "1.请检查网络配置并重试；2.清理服务器磁盘空间并重试；3.请联系技术支持工程师。"
				},
				"4800004" : {
					"cause" : "获取用户权限信息失败。",
					"desc" : "获取用户权限信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"4800005" : {
					"cause" : "模板与集群的对应关系错误。",
					"desc" : "模板与集群的对应关系错误。",
					"solution" : ""
				},
				"4800006" : {
					"cause" : "模板不是发布态不允许导出。",
					"desc" : "模板不是发布态不允许导出。",
					"solution" : "请创建发布模板。"
				},
				"4800007" : {
					"cause" : "导入的模板中有未匹配的软件包。",
					"desc" : "导入的模板中有未匹配的软件包。",
					"solution" : "请创建匹配的软件包后重试。"
				},
				"4800008" : {
					"cause" : "云管理服务器磁盘空间不足。",
					"desc" : "云管理服务器磁盘空间不足。",
					"solution" : "请联系管理员。"
				},
				"4800009" : {
					"cause" : "选择的目录已被删除。",
					"desc" : "选择的目录已被删除。",
					"solution" : "请刷新页面后重新选择。"
				},
				"4800010" : {
					"cause" : "选择的软件包重复。",
					"desc" : "选择的软件包重复。",
					"solution" : "请重新选择软件包，或在软件包管理中上传需要的软件包。"
				},
				"4800011" : {
					"cause" : "没有匹配的虚拟机模板。",
					"desc" : "没有匹配的虚拟机模板。",
					"solution" : "请联系管理员。"
				},
				"4800012" : {
					"cause" : "没有匹配的虚拟机模板。",
					"desc" : "没有匹配的虚拟机模板。",
					"solution" : "请创建匹配的虚拟机模板。"
				},
				"4800013" : {
					"cause" : "没有匹配的软件包。",
					"desc" : "没有匹配的软件包。",
					"solution" : "请上传匹配的软件包。"
				},
				"4800014" : {
					"cause" : "文件大小超过100M。",
					"desc" : "文件大小超过100M。",
					"solution" : "请上传小于100M的文件。"
				},
				"4800015" : {
					"cause" : "文件扩展名不正确，允许的扩展名为'tar.gz'。",
					"desc" : "文件扩展名不正确，允许的扩展名为'tar.gz'。",
					"solution" : "请选择正确的文件扩展名。"
				},
				"4810001" : {
					"cause" : "无此操作权限。",
					"desc" : "无此操作权限。",
					"solution" : "请联系管理员申请权限。"
				},
				"4810002" : {
					"cause" : "用户不存在。",
					"desc" : "用户不存在。",
					"solution" : "请联系管理员确认用户信息。"
				},
				"4810003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4810005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4810006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4810007" : {
					"cause" : "用户在该组织下无此操作权限",
					"desc" : "用户在该组织下无此操作权限",
					"solution" : "请联系管理员申请权限。"
				},
				"4820002" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员检查应用状态。"
				},
				"4820005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820008" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820009" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820010" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820011" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820012" : {
					"cause" : "应用名称重复。",
					"desc" : "应用名称重复。",
					"solution" : "请重新输入应用名称。"
				},
				"4820013" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员检查应用的资源状态。"
				},
				"4820014" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820015" : {
					"cause" : "应用不存在。",
					"desc" : "应用不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"4820016" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820017" : {
					"cause" : "停止的应用数量已达到系统最大值。",
					"desc" : "停止的应用数量已达到系统最大值。",
					"solution" : "请稍后重试或联系管理员。"
				},
				"4820018" : {
					"cause" : "当前应用状态不允许启动应用。",
					"desc" : "当前应用状态不允许启动应用。",
					"solution" : "请刷新后重试。"
				},
				"4820019" : {
					"cause" : "当前应用状态不允许停止应用。",
					"desc" : "当前应用状态不允许停止应用。",
					"solution" : "请刷新后重试。"
				},
				"4820020" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系管理员检查应用状态。"
				},
				"4820021" : {
					"cause" : "启动的应用数量已达到系统最大值。",
					"desc" : "启动的应用数量已达到系统最大值。",
					"solution" : "请稍后重试。"
				},
				"4820023" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820024" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820026" : {
					"cause" : "获取虚拟机信息失败。",
					"desc" : "获取虚拟机信息失败。",
					"solution" : "请联系管理员。"
				},
				"4820028" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820029" : {
					"cause" : "没有把当前操作用户指定为应用的管理员。",
					"desc" : "没有把当前操作用户指定为应用的管理员。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820030" : {
					"cause" : "选择的管理员中有管理员已经被销户。",
					"desc" : "选择的管理员中有管理员已经被销户。",
					"solution" : "系统已自动刷新了用户信息，请再次确认选择的管理员后继续操作。"
				},
				"4820032" : {
					"cause" : "应用名称重复。",
					"desc" : "应用名称重复。",
					"solution" : "请重新输入应用名称。"
				},
				"4820033" : {
					"cause" : "策略不存在。",
					"desc" : "策略不存在。",
					"solution" : "请检查当前策略是否存在。"
				},
				"4820034" : {
					"cause" : "伸缩组不存在。",
					"desc" : "伸缩组不存在。",
					"solution" : "请检查当前伸缩组是否存在。"
				},
				"4820035" : {
					"cause" : "伸缩组内策略已达到最大值10个，不能继续创建。",
					"desc" : "伸缩组内策略已达到最大值10个，不能继续创建。",
					"solution" : "请删除伸缩组内策略后重试。"
				},
				"4820036" : {
					"cause" : "应用正处于伸缩中，不能进行此操作。",
					"desc" : "应用正处于伸缩中，不能进行此操作。",
					"solution" : "请稍后重试。"
				},
				"4820037" : {
					"cause" : "组内策略处于阻塞状态，不能进行此操作。",
					"desc" : "组内策略处于阻塞状态，不能进行此操作。",
					"solution" : "请稍后重试。"
				},
				"4820039" : {
					"cause" : "注册任务失败",
					"desc" : "注册任务失败",
					"solution" : ""
				},
				"4820040" : {
					"cause" : "部分虚拟机不存在，请重新添加虚拟机。",
					"desc" : "部分虚拟机不存在，请重新添加虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"4820050" : {
					"cause" : "虚拟机正在操作VLB，请稍候再试",
					"desc" : "虚拟机正在操作VLB，请稍候再试",
					"solution" : "虚拟机正在操作VLB，请稍候再试"
				},
				"4820051" : {
					"cause" : "伸缩组正在操作VLB，请稍候再试",
					"desc" : "伸缩组正在操作VLB，请稍候再试",
					"solution" : "伸缩组正在操作VLB，请稍候再试"
				},
				"4821001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4821002" : {
					"cause" : "删除服务目录失败。",
					"desc" : "删除服务目录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"4821003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4821004" : {
					"cause" : "服务目录名称重复。",
					"desc" : "服务目录名称重复。",
					"solution" : "请重新命名服务目录名称。"
				},
				"4821005" : {
					"cause" : "服务目录不存在。",
					"desc" : "服务目录不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"4821006" : {
					"cause" : "服务目录中存在模板，不允许删除。",
					"desc" : "服务目录中存在模板，不允许删除。",
					"solution" : "请删除服务目录中所有模板后重试。请慎重操作。"
				},
				"4821008" : {
					"cause" : "添加的服务目录数量已达到系统上限500个。",
					"desc" : "添加的服务目录数量已达到系统上限500个。",
					"solution" : "请删除不需要的目录后重试。请慎重操作。"
				},
				"4821010" : {
					"cause" : "服务目录名称重复。",
					"desc" : "服务目录名称重复。",
					"solution" : "请重新命名服务目录名称。"
				},
				"4822001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822002" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822007" : {
					"cause" : "目录不存在。",
					"desc" : "目录不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"4822008" : {
					"cause" : "应用模板名称重复。",
					"desc" : "应用模板名称重复。",
					"solution" : "请重新输入应用模板名称。"
				},
				"4822009" : {
					"cause" : "应用模板数量已达到系统上限10000个。",
					"desc" : "应用模板数量已达到系统上限10000个。",
					"solution" : "请删除不需要的应用模板后重试。请慎重操作。"
				},
				"4822010" : {
					"cause" : "应用模板不存在。",
					"desc" : "应用模板不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"4822011" : {
					"cause" : "应用模板已为发布状态，不允许删除。",
					"desc" : "应用模板已为发布状态，不允许删除。",
					"solution" : "请刷新页面后重试。"
				},
				"4822012" : {
					"cause" : "应用模板内容不合法。",
					"desc" : "应用模板内容不合法。",
					"solution" : "请修改应用模板内容后重试。"
				},
				"4822013" : {
					"cause" : "该应用模板已经为发布状态。",
					"desc" : "该应用模板已经为发布状态。",
					"solution" : "请刷新页面后重试。"
				},
				"4822014" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822015" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822016" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822017" : {
					"cause" : "导出应用模板超时。",
					"desc" : "导出应用模板超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822018" : {
					"cause" : "导出应用模板失败。",
					"desc" : "导出应用模板失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822019" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822020" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822021" : {
					"cause" : "应用模板没有发布不允许导出。",
					"desc" : "应用模板没有发布不允许导出。",
					"solution" : "请刷新页面后重试。"
				},
				"4822023" : {
					"cause" : "应用模板格式校验失败。",
					"desc" : "应用模板格式校验失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822024" : {
					"cause" : "资源不存在。",
					"desc" : "资源不存在。",
					"solution" : "请联系管理员。"
				},
				"4822025" : {
					"cause" : "数据格式不正确。",
					"desc" : "数据格式不正确。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822026" : {
					"cause" : "资源属性不存在。",
					"desc" : "资源属性不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822027" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822028" : {
					"cause" : "资源未注册。",
					"desc" : "资源未注册。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822029" : {
					"cause" : "应用模板不存在。",
					"desc" : "应用模板不存在。",
					"solution" : "请刷新后重试。"
				},
				"4822030" : {
					"cause" : "应用模板没有发布不允许复制。",
					"desc" : "应用模板没有发布不允许复制。",
					"solution" : "请刷新页面后重试。"
				},
				"4822031" : {
					"cause" : "应用模板文件不存在。",
					"desc" : "应用模板文件不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822032" : {
					"cause" : "应用模板文件不符合定义。",
					"desc" : "应用模板文件不符合定义。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822033" : {
					"cause" : "应用模板数量已达到系统上限10000个。",
					"desc" : "应用模板数量已达到系统上限10000个。",
					"solution" : "请删除不需要的应用模板后重试。请慎重操作。"
				},
				"4822034" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822035" : {
					"cause" : "导入任务数量已达到系统上限10个。",
					"desc" : "导入任务数量已达到系统上限10个。",
					"solution" : "请稍后重试。"
				},
				"4822036" : {
					"cause" : "导出任务数量已达到系统上限10个。",
					"desc" : "导出任务数量已达到系统上限10个。",
					"solution" : "请稍后重试。"
				},
				"4822037" : {
					"cause" : "用户只能取消发布自己创建的模板。",
					"desc" : "用户只能取消发布自己创建的模板。",
					"solution" : "请联系管理员。"
				},
				"4822038" : {
					"cause" : "系统繁忙。",
					"desc" : "系统繁忙。",
					"solution" : "请稍后重试。"
				},
				"4822039" : {
					"cause" : "用户正在修改该应用模板。",
					"desc" : "用户正在修改该应用模板。",
					"solution" : "请稍后重试。"
				},
				"4822040" : {
					"cause" : "应用模板格式错误。",
					"desc" : "应用模板格式错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822041" : {
					"cause" : "应用模板关联的软件包附加文件不存在。",
					"desc" : "应用模板关联的软件包附加文件不存在。",
					"solution" : "请联系管理员。"
				},
				"4822042" : {
					"cause" : "应用模板没有发布不允许创建应用。",
					"desc" : "应用模板没有发布不允许创建应用。",
					"solution" : "请刷新后选择发布状态的应用模板创建应用。"
				},
				"4822043" : {
					"cause" : "应用模板关联待处理的应用创建任务。",
					"desc" : "应用模板关联待处理的应用创建任务。",
					"solution" : "请稍后重试。"
				},
				"4822044" : {
					"cause" : "导入模板时获取附加文件错误。",
					"desc" : "导入模板时获取附加文件错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822045" : {
					"cause" : "导入模板时解压错误。",
					"desc" : "导入模板时解压错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822046" : {
					"cause" : "导入模板时注册附加文件错误。",
					"desc" : "导入模板时注册附加文件错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822047" : {
					"cause" : "导入模板时模板转换失败。",
					"desc" : "导入模板时模板转换失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"4822048" : {
					"cause" : "导出的应用模板包或软件包不存在。",
					"desc" : "导出的应用模板包或软件包不存在。",
					"solution" : "请重新导出该应用模板后重试。"
				},
				"4822049" : {
					"cause" : "导入应用模板时匹配的软件包不存在。",
					"desc" : "导入应用模板时匹配的软件包不存在。",
					"solution" : "请检查所匹配的软件包是否存在。"
				},
				"4822050" : {
					"cause" : "导入应用模板时匹配的虚拟机模板不存在。",
					"desc" : "导入应用模板时匹配的虚拟机模板不存在。",
					"solution" : "请检查所匹配的虚拟机模板是否已被取消发布或者已被删除。"
				},
				"4822051" : {
					"cause" : "没有虚拟化环境。",
					"desc" : "没有虚拟化环境。",
					"solution" : "请联系管理员。"
				},
				"4822052" : {
					"cause" : "组织不存在。",
					"desc" : "组织不存在。",
					"solution" : "请重新选择组织。"
				},
				"4822053" : {
					"cause" : "虚拟化环境不存在。",
					"desc" : "虚拟化环境不存在。",
					"solution" : "请重新选择虚拟化环境。"
				},
				"4822054" : {
					"cause" : "用户不属于任何组织，不能够进行创建。",
					"desc" : "用户不属于任何组织，不能够进行创建。",
					"solution" : "请加入组织后再进行创建。"
				},
				"4822055" : {
					"cause" : "不存在可选择的VDC",
					"desc" : "不存在可选择的VDC",
					"solution" : "请联系华为技术支持。"
				},
				"4822056" : {
					"cause" : "应用模板数量已达到组织上限100个。",
					"desc" : "应用模板数量已达到组织上限100个。",
					"solution" : "请删除不需要的应用模板后重试。请慎重操作。"
				},
				"4822057" : {
					"cause" : "可见范围为系统的应用模板数量已达到上限100个。",
					"desc" : "可见范围为系统的应用模板数量已达到上限100个。",
					"solution" : "请删除不需要的应用模板后重试。请慎重操作。"
				},
				"4823001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823002" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823008" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823010" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823011" : {
					"cause" : "虚拟机模板不存在。",
					"desc" : "虚拟机模板不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"4823012" : {
					"cause" : "虚拟机创建失败，不能制作成模板。",
					"desc" : "虚拟机创建失败，不能制作成模板。",
					"solution" : "请删除创建失败的虚拟机模板并重新创建。"
				},
				"4823013" : {
					"cause" : "模板未制作完成或修改失败，不允许发布。",
					"desc" : "模板未制作完成或修改失败，不允许发布。",
					"solution" : "请完成虚拟机模板的制作或修改。"
				},
				"4823014" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823015" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请关联或解关联主机后提交任务。"
				},
				"4823016" : {
					"cause" : "共享文件路径不可为空。",
					"desc" : "共享文件路径不可为空。",
					"solution" : "请填写文件路径。"
				},
				"4823017" : {
					"cause" : "已发布的虚拟机模板不能删除。",
					"desc" : "已发布的虚拟机模板不能删除。",
					"solution" : "请取消发布虚拟机模板，请慎重操作。"
				},
				"4823018" : {
					"cause" : "该虚拟机模板已经创建完成，不能进行该操作。",
					"desc" : "该虚拟机模板已经创建完成，不能进行该操作。",
					"solution" : "请联系管理员。"
				},
				"4823019" : {
					"cause" : "启动虚拟机失败。",
					"desc" : "启动虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823020" : {
					"cause" : "只有创建完成的虚拟机模板才可以修改。",
					"desc" : "只有创建完成的虚拟机模板才可以修改。",
					"solution" : "请刷新页面后重试。"
				},
				"4823021" : {
					"cause" : "把模板转换为虚拟机时出错。",
					"desc" : "把模板转换为虚拟机时出错。",
					"solution" : "请稍后重试或联系管理员。"
				},
				"4823022" : {
					"cause" : "虚拟机模板已被用户锁定。",
					"desc" : "虚拟机模板已被用户锁定。",
					"solution" : "请联系该用户解除锁定。"
				},
				"4823023" : {
					"cause" : "用户域与资源所在域不匹配。",
					"desc" : "用户域与资源所在域不匹配。",
					"solution" : "请联系管理员。"
				},
				"4823024" : {
					"cause" : "不存在可用的资源集群，无法创建虚拟机模板。",
					"desc" : "不存在可用的资源集群，无法创建虚拟机模板。",
					"solution" : "请联系管理员添加资源集群。"
				},
				"4823025" : {
					"cause" : "虚拟机模板已经被发布。",
					"desc" : "虚拟机模板已经被发布。",
					"solution" : "请刷新页面后重试。"
				},
				"4823026" : {
					"cause" : "虚拟机模板已经取消发布。",
					"desc" : "虚拟机模板已经取消发布。",
					"solution" : "请刷新页面后重试。"
				},
				"4823027" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4823028" : {
					"cause" : "虚拟机模板正在被应用模板使用，不允许取消发布。",
					"desc" : "虚拟机模板正在被应用模板使用，不允许取消发布。",
					"solution" : "请删除使用该虚拟机模板的应用模板后重试。"
				},
				"4823029" : {
					"cause" : "创建虚拟机模板失败，不允许挂载ISO文件。",
					"desc" : "创建虚拟机模板失败，不允许挂载ISO文件。",
					"solution" : "请删除该虚拟机模板重新创建。"
				},
				"4823030" : {
					"cause" : "模板制作完成时不允许挂载ISO文件。",
					"desc" : "模板制作完成时不允许挂载ISO文件。",
					"solution" : "请单击修改按钮进行虚拟机模板修改。"
				},
				"4823031" : {
					"cause" : "虚拟机模板已经发布时不允许挂载ISO文件。",
					"desc" : "虚拟机模板已经发布时不允许挂载ISO文件。",
					"solution" : "请取消发布后单击修改按钮进行虚拟机模板修改。"
				},
				"4823033" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请确认用户密码是否正确、网络是否正常，防火墙是否已关闭，共享文件路径是否正确，文件是否共享等。"
				},
				"4823034" : {
					"cause" : "虚拟机模板正在卸载ISO文件，不能执行挂载操作。",
					"desc" : "虚拟机模板正在卸载ISO文件，不能执行挂载操作。",
					"solution" : "请稍后重试。"
				},
				"4823035" : {
					"cause" : "已发布虚拟机模板个数已达到系统上限100个。",
					"desc" : "已发布虚拟机模板个数已达到系统上限100个。",
					"solution" : "请清理不需要且已经发布的虚拟机模板。"
				},
				"4823036" : {
					"cause" : "虚拟机当前不支持VNC登录。",
					"desc" : "虚拟机当前不支持VNC登录。",
					"solution" : "请稍后重试或启动虚拟机。"
				},
				"4823037" : {
					"cause" : "虚拟机模板名称重复。",
					"desc" : "虚拟机模板名称重复。",
					"solution" : "请重新输入虚拟机模板名称。"
				},
				"4823038" : {
					"cause" : "只有未创建完成的虚拟机模板才能安装软件。",
					"desc" : "只有未创建完成的虚拟机模板才能安装软件。",
					"solution" : "请刷新后重试。"
				},
				"4823039" : {
					"cause" : "虚拟机模板正在被用于创建应用，不允许取消发布。",
					"desc" : "虚拟机模板正在被用于创建应用，不允许取消发布。",
					"solution" : "请稍后重试。"
				},
				"4823040" : {
					"cause" : "虚拟机为休眠状态，不能执行该操作。",
					"desc" : "虚拟机为休眠状态，不能执行该操作。",
					"solution" : "请启动该虚拟机后重试。"
				},
				"4823041" : {
					"cause" : "卸载光驱失败。",
					"desc" : "卸载光驱失败。",
					"solution" : "请稍后重试或联系技术支持工程师。"
				},
				"4823042" : {
					"cause" : "桌面云模板用于创建桌面云虚拟机，不需要发布。",
					"desc" : "桌面云模板用于创建桌面云虚拟机，不需要发布。",
					"solution" : "请联系管理员。"
				},
				"4823043" : {
					"cause" : "虚拟机模板不是停止状态，不能发布。",
					"desc" : "虚拟机模板不是停止状态，不能发布。",
					"solution" : "请稍后重试或联系技术支持工程师。"
				},
				"4823044" : {
					"cause" : "虚拟机未转化为模板，不能发布。",
					"desc" : "虚拟机未转化为模板，不能发布。",
					"solution" : "请稍后重试或联系技术支持工程师。"
				},
				"4823045" : {
					"cause" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"desc" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"solution" : "请稍后重试或联系技术支持工程师。"
				},
				"4823046" : {
					"cause" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"desc" : "服务器上已存在有挂载光驱的虚拟机，虚拟机不能挂载光驱。",
					"solution" : "请稍后重试或联系技术支持工程师。"
				},
				"4823047" : {
					"cause" : "虚拟机模板状态不允许修改。",
					"desc" : "虚拟机模板状态不允许修改。",
					"solution" : "请检查虚拟机模板状态。"
				},
				"4823048" : {
					"cause" : "关闭虚拟机失败。",
					"desc" : "关闭虚拟机失败。",
					"solution" : "请确认虚拟机Tools是否启运行中。"
				},
				"4823049" : {
					"cause" : "删除NFS模板失败",
					"desc" : "删除NFS模板失败",
					"solution" : "请检查当前虚拟机模板状态"
				},
				"4823051" : {
					"cause" : "过户虚拟机失败",
					"desc" : "过户虚拟机失败",
					"solution" : "请重试。"
				},
				"4823052" : {
					"cause" : "挂载ISO文件失败。",
					"desc" : "挂载ISO文件失败。",
					"solution" : "请确认用户密码是否正确、网络是否正常，防火墙是否已关闭，共享文件路径是否正确，文件是否共享等。"
				},
				"4823058" : {
					"cause" : "虚拟机模板状态冲突，不允许此操作.",
					"desc" : "虚拟机模板状态冲突，不允许此操作.",
					"solution" : "请状态正常后再操作."
				},
				"4823059" : {
					"cause" : "虚拟机模板描述信息参数非法",
					"desc" : "虚拟机模板描述信息参数非法",
					"solution" : "请修改描述信息参数后重试"
				},
				"4823060" : {
					"cause" : "虚拟机模板升级模式参数非法",
					"desc" : "虚拟机模板升级模式参数非法",
					"solution" : "请修改升级模式参数后重试"
				},
				"4823061" : {
					"cause" : "虚拟机模板基本块设备热迁移参数非法",
					"desc" : "虚拟机模板基本块设备热迁移参数非法",
					"solution" : "请修改基本块设备热迁移参数后重试"
				},
				"4823062" : {
					"cause" : "虚拟机模板图标参数非法",
					"desc" : "虚拟机模板图标参数非法",
					"solution" : "请修改图标参数后重试"
				},
				"4823063" : {
					"cause" : "虚拟机模板CPU参数非法",
					"desc" : "虚拟机模板CPU参数非法",
					"solution" : "请修改CPU参数后重试"
				},
				"4823064" : {
					"cause" : "虚拟机模板内存参数非法",
					"desc" : "虚拟机模板内存参数非法",
					"solution" : "请修改内存参数后重试"
				},
				"4823065" : {
					"cause" : "虚拟机模板磁盘参数非法",
					"desc" : "虚拟机模板磁盘参数非法",
					"solution" : "请修改磁盘参数后重试"
				},
				"4823066" : {
					"cause" : "虚拟机模板网卡参数非法",
					"desc" : "虚拟机模板网卡参数非法",
					"solution" : "请修改网卡参数后重试"
				},
				"4823067" : {
					"cause" : "虚拟机模板操作系统参数非法",
					"desc" : "虚拟机模板操作系统参数非法",
					"solution" : "请修改操作系统参数后重试"
				},
				"4823068" : {
					"cause" : "虚拟机模板名称参数非法",
					"desc" : "虚拟机模板名称参数非法",
					"solution" : "请修改名称参数后重试"
				},
				"4823069" : {
					"cause" : "虚拟机模板集群参数非法",
					"desc" : "虚拟机模板集群参数非法",
					"solution" : "请修改集群参数后重试"
				},
				"4825000" : {
					"cause" : "虚拟机逻辑模板未关联虚拟机模板.",
					"desc" : "虚拟机逻辑模板未关联虚拟机模板.",
					"solution" : "请联系系统管理员."
				},
				"4825001" : {
					"cause" : "虚拟机模板不存在关联关系。",
					"desc" : "虚拟机模板不存在关联关系。",
					"solution" : "请重新获取虚拟机模板信息。"
				},
				"4825002" : {
					"cause" : "虚拟机逻辑模板不存在。",
					"desc" : "虚拟机逻辑模板不存在。",
					"solution" : "请重新获取数据或联系技术支持工程师。"
				},
				"4825003" : {
					"cause" : "查询已关联的集群信息异常。",
					"desc" : "查询已关联的集群信息异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4825004" : {
					"cause" : "查询集群信息异常",
					"desc" : "查询集群信息异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825005" : {
					"cause" : "查询虚拟机逻辑模板异常",
					"desc" : "查询虚拟机逻辑模板异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825006" : {
					"cause" : "虚拟机逻辑模板数据异常",
					"desc" : "虚拟机逻辑模板数据异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825007" : {
					"cause" : "虚拟机逻辑模板为激活状态，不允许取消关联",
					"desc" : "虚拟机逻辑模板为激活状态，不允许取消关联",
					"solution" : "请去激活虚拟机逻辑模板后重试"
				},
				"4825008" : {
					"cause" : "虚拟机逻辑模板数据异常",
					"desc" : "虚拟机逻辑模板数据异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825009" : {
					"cause" : "查询虚拟环境名称异常",
					"desc" : "查询虚拟环境名称异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825010" : {
					"cause" : "查询集群名称异常",
					"desc" : "查询集群名称异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825011" : {
					"cause" : "虚拟机模板丢失",
					"desc" : "虚拟机模板丢失",
					"solution" : "虚拟机模板丢失"
				},
				"4825012" : {
					"cause" : "虚拟机逻辑模板状态为激活，不允许进行关联或者解关联操作",
					"desc" : "虚拟机逻辑模板状态为激活，不允许进行关联或者解关联操作",
					"solution" : "请去激活虚拟机逻辑模板后重试"
				},
				"4825013" : {
					"cause" : "虚拟机模板磁盘个数大于1",
					"desc" : "虚拟机模板磁盘个数大于1",
					"solution" : "虚拟机模板磁盘个数大于1"
				},
				"4825014" : {
					"cause" : "参数异常",
					"desc" : "参数异常",
					"solution" : "请联系技术支持工程师"
				},
				"4825015" : {
					"cause" : "逻辑模板状态冲突，操作失败",
					"desc" : "逻辑模板状态冲突，操作失败",
					"solution" : "请重新获取逻辑模板信息"
				},
				"4825016" : {
					"cause" : "逻辑模板操作系统版本号不匹配，关联失败",
					"desc" : "逻辑模板操作系统版本号不匹配，关联失败",
					"solution" : "请重新选择关联的虚拟机逻辑模板"
				},
				"4825017" : {
					"cause" : "逻辑模板系统磁盘大小不匹配，关联失败",
					"desc" : "逻辑模板系统磁盘大小不匹配，关联失败",
					"solution" : "请重新选择关联的虚拟机逻辑模板"
				},
				"4825018" : {
					"cause" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的操作系统版本号",
					"desc" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的操作系统版本号",
					"solution" : "请去关联后重试"
				},
				"4825019" : {
					"cause" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的系统磁盘大小",
					"desc" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的系统磁盘大小",
					"solution" : "请去关联后重试"
				},
				"4825020" : {
					"cause" : "虚拟机逻辑模板状态为激活，不允许修改",
					"desc" : "虚拟机逻辑模板状态为激活，不允许修改",
					"solution" : "请去激活后重试"
				},
				"4825021" : {
					"cause" : "虚拟机模板已关联逻辑模板，不允许取消发布",
					"desc" : "虚拟机模板已关联逻辑模板，不允许取消发布",
					"solution" : "请去关联后重试"
				},
				"4825022" : {
					"cause" : "虚拟机模板未发布，不允许关联逻辑模板",
					"desc" : "虚拟机模板未发布，不允许关联逻辑模板",
					"solution" : "请发布虚拟机模板后重试"
				},
				"4825023" : {
					"cause" : "虚拟机逻辑模板状态为激活，不允许删除",
					"desc" : "虚拟机逻辑模板状态为激活，不允许删除",
					"solution" : "请去关联后重试"
				},
				"4825025" : {
					"cause" : "虚拟机逻辑模板密码不一致。",
					"desc" : "虚拟机逻辑模板密码不一致。",
					"solution" : "重新输入密码后再次创建。"
				},
				"4825111" : {
					"cause" : "逻辑模板名称重复。",
					"desc" : "逻辑模板名称重复。",
					"solution" : "请重新输入逻辑模板名称。"
				},
				"4825113" : {
					"cause" : "虚拟机模板已关联逻辑模板",
					"desc" : "虚拟机模板已关联逻辑模板",
					"solution" : "请去关联后重新关联逻辑模板"
				},
				"4825116" : {
					"cause" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"desc" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"solution" : "请查看已关联的虚拟机模板"
				},
				"4825117" : {
					"cause" : "虚拟机模板数量达到系统限定最大值。",
					"desc" : "虚拟机模板数量达到系统限定最大值。",
					"solution" : "删除不用的虚拟机模板，请慎重操作。"
				},
				"4825118" : {
					"cause" : "虚拟机模板数量达到系统限定最大值。",
					"desc" : "虚拟机模板数量达到系统限定最大值。",
					"solution" : "删除不用的虚拟机模板，请慎重操作。"
				},
				"4826001" : {
					"cause" : "PVM网络余额业务虚拟机网络不匹配",
					"desc" : "PVM网络余额业务虚拟机网络不匹配",
					"solution" : "请修改PVM网络"
				},
				"4826002" : {
					"cause" : "PVM不存在或者未处于运行状态",
					"desc" : "PVM不存在或者未处于运行状态",
					"solution" : "请创建或者启动PVM"
				},
				"4826003" : {
					"cause" : "选择的ISO文件不存在。",
					"desc" : "选择的ISO文件不存在。",
					"solution" : "请确认ISO文件是否存在。"
				},
				"4840002" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4840003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4840004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4840005" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4840006" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4840007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"4840008" : {
					"cause" : "外部网络不存在。",
					"desc" : "外部网络不存在。",
					"solution" : "请创建外部网络后再试。"
				},
				"4840009" : {
					"cause" : "操作失败",
					"desc" : "操作失败",
					"solution" : "请接入VDI后重试"
				},
				"4840010" : {
					"cause" : "网卡关联的外部网络已经删除。",
					"desc" : "网卡关联的外部网络已经删除。",
					"solution" : "请重新选择外部网络。"
				},
				"4840011" : {
					"cause" : "网卡没有关联网络。",
					"desc" : "网卡没有关联网络。",
					"solution" : "请为网卡选择网络。"
				},
				"4840013" : {
					"cause" : "网卡未关联网络。",
					"desc" : "网卡未关联网络。",
					"solution" : "请确认网卡是否关联网络。"
				},
				"4840014" : {
					"cause" : "CPU个数超过最大限制。",
					"desc" : "CPU个数超过最大限制。",
					"solution" : "请确认cpu个数合法。"
				},
				"4840015" : {
					"cause" : "无法获取指定集群下CPU个数 。",
					"desc" : "无法获取指定集群下CPU个数 。",
					"solution" : "请确认指定集群下CPU个数。"
				},
				"5100001" : {
					"cause" : "缺少必选参数",
					"desc" : "缺少必选参数",
					"solution" : "请检查参数。"
				},
				"5100002" : {
					"cause" : "参数值无效。",
					"desc" : "参数值无效。",
					"solution" : "请换个名称重试。"
				},
				"5100003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"5100004" : {
					"cause" : "请求为空",
					"desc" : "请求为空",
					"solution" : "请确认输入请求或参数为有效值"
				},
				"5100005" : {
					"cause" : "分页信息设置有误。",
					"desc" : "分页信息设置有误。",
					"solution" : "请正确地设置分页信息。"
				},
				"5100006" : {
					"cause" : "页面大小无效。",
					"desc" : "页面大小无效。",
					"solution" : "重新设置页面大小符合的配置文件。"
				},
				"5100007" : {
					"cause" : "参考具体的数据库错误码。",
					"desc" : "参考具体的数据库错误码。",
					"solution" : "根据具体的数据库错误码解决。"
				},
				"5101001" : {
					"cause" : "服务模板不存在。",
					"desc" : "服务模板不存在。",
					"solution" : "请刷新服务模板管理页面后重试。"
				},
				"5101002" : {
					"cause" : "模板已经存在。",
					"desc" : "模板已经存在。",
					"solution" : "请更换服务模板重试。"
				},
				"5101003" : {
					"cause" : "服务模板校验失败。",
					"desc" : "服务模板校验失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"5101004" : {
					"cause" : "模板处于发布状态不允许修改。",
					"desc" : "模板处于发布状态不允许修改。",
					"solution" : "模板处于发布状态不允许修改，请确认。"
				},
				"5101005" : {
					"cause" : "模板处于发布状态不允许删除。",
					"desc" : "模板处于发布状态不允许删除。",
					"solution" : "模板处于发布状态不允许删除。"
				},
				"5101006" : {
					"cause" : "服务模板名称重复。",
					"desc" : "服务模板名称重复。",
					"solution" : "该服务模板名称已存在，请更换名称重试。"
				},
				"5101007" : {
					"cause" : "可能为DAS服务端处理请求速度较慢，导致队列中的请求等待超时。",
					"desc" : "可能为DAS服务端处理请求速度较慢，导致队列中的请求等待超时。",
					"solution" : "确认DAS客户端的业务量，数据库主机的负荷均正常。如果DAS客户端和数据库主机均正常，则需要重启DAS服务端。"
				},
				"5101008" : {
					"cause" : "模板ID配置错误或空。",
					"desc" : "模板ID配置错误或空。",
					"solution" : "检查模板文件。"
				},
				"5101010" : {
					"cause" : "模板校验失败。",
					"desc" : "模板校验失败。",
					"solution" : "请联系华为工程师解决。"
				},
				"5101014" : {
					"cause" : "模板不是有效的Json格式。",
					"desc" : "模板不是有效的Json格式。",
					"solution" : "请检查模板格式。"
				},
				"5101015" : {
					"cause" : "提取全局参数失败。",
					"desc" : "提取全局参数失败。",
					"solution" : "检查DAS全局配置文件。"
				},
				"5101018" : {
					"cause" : "删除模板参数失败。",
					"desc" : "删除模板参数失败。",
					"solution" : "请重新配置参数再重新删除。"
				},
				"5101019" : {
					"cause" : "删除模板资源失败。",
					"desc" : "删除模板资源失败。",
					"solution" : "无法删除模板资源，权限过低。"
				},
				"5101020" : {
					"cause" : "模板状态不支持创建。",
					"desc" : "模板状态不支持创建。",
					"solution" : "请修改模板状态之后再重新创建。"
				},
				"5101021" : {
					"cause" : "模板体内容不正确。",
					"desc" : "模板体内容不正确。",
					"solution" : "请检查模板内容，参数是否合法。"
				},
				"5101022" : {
					"cause" : "模板中存在循环依赖。",
					"desc" : "模板中存在循环依赖。",
					"solution" : "模板中存在循环依赖，请换个模板重试。"
				},
				"5101025" : {
					"cause" : "服务模板中没有包含虚拟机模板。",
					"desc" : "服务模板中没有包含虚拟机模板。",
					"solution" : "服务模板中不包含任何虚拟机模板，请确认。"
				},
				"5101026" : {
					"cause" : "模板不包含任何资源。",
					"desc" : "模板不包含任何资源。",
					"solution" : "模板不包含任何资源，请添加资源。"
				},
				"5101032" : {
					"cause" : "模板内容为空。",
					"desc" : "模板内容为空。",
					"solution" : "模板内容为空，请添加资源。"
				},
				"5101102" : {
					"cause" : "虚拟机中存在多个网卡分配了默认网关。",
					"desc" : "虚拟机中存在多个网卡分配了默认网关。",
					"solution" : "请重新设计该服务模板。"
				},
				"5102001" : {
					"cause" : "应用实例不存在。",
					"desc" : "应用实例不存在。",
					"solution" : "应用实例不存在，请重试。"
				},
				"5102002" : {
					"cause" : "应用实例已经存在。",
					"desc" : "应用实例已经存在。",
					"solution" : "应用实例已经存在，请重试。"
				},
				"5102003" : {
					"cause" : "应用实例正在运行中。",
					"desc" : "应用实例正在运行中。",
					"solution" : "应用实例正在运行中，请重试。"
				},
				"5102004" : {
					"cause" : "应用实例已经停止。",
					"desc" : "应用实例已经停止。",
					"solution" : "应用实例已经停止。"
				},
				"5102005" : {
					"cause" : "应用实例状态无效，不能进行操作。",
					"desc" : "应用实例状态无效，不能进行操作。",
					"solution" : "应用实例状态无效，不能进行操作。"
				},
				"5102006" : {
					"cause" : "应用实例当前状态不支持重试。",
					"desc" : "应用实例当前状态不支持重试。",
					"solution" : "应用实例当前状态不支持重试。"
				},
				"5102201" : {
					"cause" : "应用状态不允许启动",
					"desc" : "应用状态不允许启动",
					"solution" : "应用状态不允许启动，请等待应用更新为稳定状态后重试"
				},
				"5102204" : {
					"cause" : "当前应用状态不支持修复。",
					"desc" : "当前应用状态不支持修复。",
					"solution" : "请联系技术支持工程师。"
				},
				"5102600" : {
					"cause" : "端口组中的VlanID不存在。",
					"desc" : "端口组中的VlanID不存在。",
					"solution" : "端口组中的VlanID不存在，请重新选择VlanID。"
				},
				"5102601" : {
					"cause" : "校验端口组中的子网ID失败。",
					"desc" : "校验端口组中的子网ID失败。",
					"solution" : "端口组中的子网不存在，请重新选择子网ID。"
				},
				"5102603" : {
					"cause" : "应用状态不允许停止",
					"desc" : "应用状态不允许停止",
					"solution" : "应用状态不允许停止，请等待应用更新为稳定状态后重试"
				},
				"5102604" : {
					"cause" : "端口组没有可用的VlanID。",
					"desc" : "端口组没有可用的VlanID。",
					"solution" : "端口组没有可用的VlanID，请确认。"
				},
				"5102605" : {
					"cause" : "端口组没有可用的子网ID。",
					"desc" : "端口组没有可用的子网ID。",
					"solution" : "端口组没有可用的子网ID，请确认。"
				},
				"5102606" : {
					"cause" : "端口组中的“上限带宽”和“优先级”必须同时为空或者同时不为空。",
					"desc" : "端口组中的“上限带宽”和“优先级”必须同时为空或者同时不为空。",
					"solution" : "端口组中的“上限带宽”和“优先级”必须同时为空或者同时不为空，请确认。"
				},
				"5102608" : {
					"cause" : "停止应用失败。",
					"desc" : "停止应用失败。",
					"solution" : "请重试。"
				},
				"5102609" : {
					"cause" : "强制关闭虚拟机失败。",
					"desc" : "强制关闭虚拟机失败。",
					"solution" : "请重试。"
				},
				"5102700" : {
					"cause" : "创建实例资源失败。",
					"desc" : "创建实例资源失败。",
					"solution" : "创建实例资源失败。"
				},
				"5102701" : {
					"cause" : "删除实例资源失败。",
					"desc" : "删除实例资源失败。",
					"solution" : "删除实例资源失败。"
				},
				"5102702" : {
					"cause" : "查询实例资源内容失败。",
					"desc" : "查询实例资源内容失败。",
					"solution" : "查询实例资源内容失败。"
				},
				"5102703" : {
					"cause" : "模板虚拟机ID不存在。",
					"desc" : "模板虚拟机ID不存在。",
					"solution" : "模板虚拟机ID不存在，请换个虚拟机ID重试。"
				},
				"5102704" : {
					"cause" : "创建虚拟机实例超时。",
					"desc" : "创建虚拟机实例超时。",
					"solution" : "创建虚拟机实例超时，请重试。"
				},
				"5102705" : {
					"cause" : "虚拟机磁盘个数超过系统限定最大值。",
					"desc" : "虚拟机磁盘个数超过系统限定最大值。",
					"solution" : "虚拟机磁盘个数超过系统限定最大值。"
				},
				"5102706" : {
					"cause" : "虚拟机网卡个数超过系统限定最大值或小于最小值。",
					"desc" : "虚拟机网卡个数超过系统限定最大值或小于最小值。",
					"solution" : "虚拟机网卡个数超过系统限定最大值或小于最小值，请重试。"
				},
				"5102707" : {
					"cause" : "输入值不是整数。",
					"desc" : "输入值不是整数。",
					"solution" : "输入值不是整数，请重试。"
				},
				"5102708" : {
					"cause" : "网卡名称重复。",
					"desc" : "网卡名称重复。",
					"solution" : "网卡名称重复，请换个网卡名称重试。"
				},
				"5102709" : {
					"cause" : "实际创建虚拟机数量与申请数量不相符。",
					"desc" : "实际创建虚拟机数量与申请数量不相符。",
					"solution" : "实际创建虚拟机数量与申请数量不相符。"
				},
				"5102710" : {
					"cause" : "磁盘Json格式错误。",
					"desc" : "磁盘Json格式错误。",
					"solution" : "磁盘Json格式错误，请检查格式。"
				},
				"5102711" : {
					"cause" : "网卡Json格式错误。",
					"desc" : "网卡Json格式错误。",
					"solution" : "网卡Json格式错误，请检查格式。"
				},
				"5102712" : {
					"cause" : "资源Json格式错误",
					"desc" : "资源Json格式错误",
					"solution" : "资源Json格式错误，请检查格式。"
				},
				"5102713" : {
					"cause" : "资源子属性名称不合法。",
					"desc" : "资源子属性名称不合法。",
					"solution" : "资源子属性名称不合法，请检查资源子属性名称。"
				},
				"5102714" : {
					"cause" : "命令个数超过系统限定个数。",
					"desc" : "命令个数超过系统限定个数。",
					"solution" : "命令个数超过系统限定个数，请检查命令个数。"
				},
				"5102715" : {
					"cause" : "资源名称不合法。",
					"desc" : "资源名称不合法。",
					"solution" : "资源名称不合法，请检查资源名称。"
				},
				"5102716" : {
					"cause" : "资源描述不合法。",
					"desc" : "资源描述不合法。",
					"solution" : "资源描述不合法，请检查资源描述。"
				},
				"5102717" : {
					"cause" : "获取虚拟机实例IP失败。",
					"desc" : "获取虚拟机实例IP失败。",
					"solution" : "获取虚拟机实例IP失败，请重试。"
				},
				"5102718" : {
					"cause" : "虚拟机模板没有定义网卡。",
					"desc" : "虚拟机模板没有定义网卡。",
					"solution" : "虚拟机模板没有定义网卡，请确认是否存在定义的网卡。"
				},
				"5102719" : {
					"cause" : "创建虚拟机实例失败。",
					"desc" : "创建虚拟机实例失败。",
					"solution" : "创建虚拟机实例失败，请重试。"
				},
				"5102720" : {
					"cause" : "查询虚拟机实例状态失败。",
					"desc" : "查询虚拟机实例状态失败。",
					"solution" : "查询虚拟机实例状态失败，请重试。"
				},
				"5102721" : {
					"cause" : "查询虚拟机信息失败",
					"desc" : "查询虚拟机信息失败",
					"solution" : "请稍后重试"
				},
				"5102722" : {
					"cause" : "启动虚拟机失败。",
					"desc" : "启动虚拟机失败。",
					"solution" : "启动虚拟机失败，请重试。"
				},
				"5102723" : {
					"cause" : "停止虚拟机失败。",
					"desc" : "停止虚拟机失败。",
					"solution" : "停止虚拟机失败，请重试。"
				},
				"5102724" : {
					"cause" : "删除虚拟机失败。",
					"desc" : "删除虚拟机失败。",
					"solution" : "删除虚拟机失败，请重试。"
				},
				"5102725" : {
					"cause" : "应用实例数量达到系统限定最大值。",
					"desc" : "应用实例数量达到系统限定最大值。",
					"solution" : "应用实例数量达到系统限定最大值，请重试。"
				},
				"5102726" : {
					"cause" : "应用实例并发创建数量达到系统限定最大值。",
					"desc" : "应用实例并发创建数量达到系统限定最大值。",
					"solution" : "应用实例并发创建数量达到系统限定最大值，请重试。"
				},
				"5102727" : {
					"cause" : "资源创建超时。",
					"desc" : "资源创建超时。",
					"solution" : "资源创建超时，请重试。"
				},
				"5102728" : {
					"cause" : "不合法的IPv4格式。",
					"desc" : "不合法的IPv4格式。",
					"solution" : "不合法的IPv4格式，请输入合法的IPV4格式。如XXX.XXX.XXX.XXX。"
				},
				"5102729" : {
					"cause" : "资源未注册或状态异常。",
					"desc" : "资源未注册或状态异常。",
					"solution" : "资源未注册或状态异常，请确认。"
				},
				"5102730" : {
					"cause" : "查询资源状态未知原因失败。",
					"desc" : "查询资源状态未知原因失败。",
					"solution" : "查询资源状态未知原因失败。"
				},
				"5102731" : {
					"cause" : "资源属性不存在。",
					"desc" : "资源属性不存在。",
					"solution" : "资源属性不存在，请确认资源属性。"
				},
				"5102732" : {
					"cause" : "软件Json格式错误。",
					"desc" : "软件Json格式错误。",
					"solution" : "软件Json格式错误，请输入合法的Json格式。"
				},
				"5102733" : {
					"cause" : "软件超出系统资源限定。",
					"desc" : "软件超出系统资源限定。",
					"solution" : "软件超出系统资源限定，请重试。"
				},
				"5102736" : {
					"cause" : "虚拟机中的软件包未注册。",
					"desc" : "虚拟机中的软件包未注册。",
					"solution" : "虚拟机中的软件包未注册，请更换软件包。"
				},
				"5102737" : {
					"cause" : "虚拟机模板不存在。",
					"desc" : "虚拟机模板不存在。",
					"solution" : "虚拟机模板不存在，请换个虚拟机模板重试。"
				},
				"5102739" : {
					"cause" : "虚拟机模板未注册",
					"desc" : "虚拟机模板未注册",
					"solution" : "请确认虚拟机模板状态。"
				},
				"5102746" : {
					"cause" : "安装软件包时，执行命令失败。",
					"desc" : "安装软件包时，执行命令失败。",
					"solution" : "安装软件包时，执行命令失败。"
				},
				"5102750" : {
					"cause" : "安装软件包失败。",
					"desc" : "安装软件包失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"5102751" : {
					"cause" : "安装软件包超时。",
					"desc" : "安装软件包超时。",
					"solution" : "安装软件包超时。"
				},
				"5102752" : {
					"cause" : "安装文件失败。",
					"desc" : "安装文件失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"5102753" : {
					"cause" : "停止虚拟机超时",
					"desc" : "停止虚拟机超时",
					"solution" : "请重试"
				},
				"5102757" : {
					"cause" : "VPC内无部署服务实例",
					"desc" : "VPC内无部署服务实例",
					"solution" : "请确保VPC下存在部署服务实例"
				},
				"5102758" : {
					"cause" : "VPC不存在",
					"desc" : "VPC不存在",
					"solution" : "请联系系统管理员"
				},
				"5102759" : {
					"cause" : "部署服务实例未处于运行状态",
					"desc" : "部署服务实例未处于运行状态",
					"solution" : "请确认部署服务实例处于运行状态"
				},
				"5102760" : {
					"cause" : "业务虚拟机不存在",
					"desc" : "业务虚拟机不存在",
					"solution" : "请确认业务虚拟机是否存在"
				},
				"5102761" : {
					"cause" : "部署服务实例与业务虚拟机之间网络不匹配",
					"desc" : "部署服务实例与业务虚拟机之间网络不匹配",
					"solution" : "请修改部署服务确保网络与业务虚拟机网络匹配"
				},
				"5102820" : {
					"cause" : "应用实例名称重复",
					"desc" : "应用实例名称重复",
					"solution" : "请重新指定应用名称"
				},
				"5103001" : {
					"cause" : "该软件包已经删除。",
					"desc" : "该软件包已经删除。",
					"solution" : "请刷新软件包管理页面后重试。"
				},
				"5103002" : {
					"cause" : "资源已经存在。",
					"desc" : "资源已经存在。",
					"solution" : "资源已经存在，请确认。"
				},
				"5103003" : {
					"cause" : "资源类型不存在。",
					"desc" : "资源类型不存在。",
					"solution" : "资源类型不存在，请确认资源类型是否存在。"
				},
				"5103004" : {
					"cause" : "资源正在使用中。",
					"desc" : "资源正在使用中。",
					"solution" : "资源正在使用中，无法访问。"
				},
				"5103005" : {
					"cause" : "缺少资源属性。",
					"desc" : "缺少资源属性。",
					"solution" : "缺少资源属性，请确认。"
				},
				"5103006" : {
					"cause" : "该ISO已经删除。",
					"desc" : "该ISO已经删除。",
					"solution" : "请刷新ISO页面后重试。"
				},
				"5103007" : {
					"cause" : "资源类型暂不支持。",
					"desc" : "资源类型暂不支持。",
					"solution" : "资源类型暂不支持。"
				},
				"5103008" : {
					"cause" : "添加的软件包数量已达到系统最大值。",
					"desc" : "添加的软件包数量已达到系统最大值。",
					"solution" : "请删除不常用的软件包后再尝试添加，请慎重操作。"
				},
				"5103009" : {
					"cause" : "添加的软件包总大小达到系统最大值（80G）。",
					"desc" : "添加的软件包总大小达到系统最大值（80G）。",
					"solution" : "添加的软件包总大小达到系统最大值（80G），请确认。"
				},
				"5103011" : {
					"cause" : "软件包或脚本正在修复中",
					"desc" : "软件包或脚本正在修复中",
					"solution" : "请稍后重试"
				},
				"5103012" : {
					"cause" : "虚拟机的软件包损坏。",
					"desc" : "虚拟机的软件包损坏。",
					"solution" : "虚拟机的软件包损坏，请修复软件包或者重新设计服务模板。"
				},
				"5103013" : {
					"cause" : "虚拟机中的软件包的文件不存在。",
					"desc" : "虚拟机中的软件包的文件不存在。",
					"solution" : "请重新设计该服务模板。"
				},
				"5103014" : {
					"cause" : "软件包文件大小超过4G.",
					"desc" : "软件包文件大小超过4G.",
					"solution" : "请选择合适的文件大小."
				},
				"5103015" : {
					"cause" : "文件不存在.",
					"desc" : "文件不存在.",
					"solution" : "请选择存在的文件."
				},
				"5103016" : {
					"cause" : "文件大小超过1MB.",
					"desc" : "文件大小超过1MB.",
					"solution" : "请选择合适的文件大小."
				},
				"5103017" : {
					"cause" : "资源不存在.",
					"desc" : "资源不存在.",
					"solution" : "请联系系统管理员."
				},
				"5103088" : {
					"cause" : "添加的软件包数量已达到组织最大值。",
					"desc" : "添加的软件包数量已达到组织最大值。",
					"solution" : "请删除不常用的软件包后再尝试添加，请慎重操作。"
				},
				"5104002" : {
					"cause" : "磁盘空间不足。",
					"desc" : "磁盘空间不足。",
					"solution" : "请参考产品文档去清理不用的软件包或者给FusionManager虚拟机更换更大的磁盘。"
				},
				"5104003" : {
					"cause" : "该版本的操作系统可用于物理机发放，系统自动将其制作为安装源。故所需空间为该ISO文件的2.5倍，当前存储空间剩余不足。",
					"desc" : "该版本的操作系统可用于物理机发放，系统自动将其制作为安装源。故所需空间为该ISO文件的2.5倍，当前存储空间剩余不足。",
					"solution" : "请参考产品文档去清理不用的软件包或者给FusionManager虚拟机更换更大的磁盘。"
				},
				"5111000" : {
					"cause" : "函数内部错误",
					"desc" : "函数内部错误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111001" : {
					"cause" : "缺少必选参数。",
					"desc" : "缺少必选参数。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111002" : {
					"cause" : "参数值无效。",
					"desc" : "参数值无效。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111003" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111004" : {
					"cause" : "请求对象为空。",
					"desc" : "请求对象为空。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111005" : {
					"cause" : "页码无效。",
					"desc" : "页码无效。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111006" : {
					"cause" : "页面大小无效。",
					"desc" : "页面大小无效。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111007" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111008" : {
					"cause" : "策略名称重复。",
					"desc" : "策略名称重复。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111009" : {
					"cause" : "策略不存在。",
					"desc" : "策略不存在。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111010" : {
					"cause" : "策略不是停止状态不允许更新。",
					"desc" : "策略不是停止状态不允许更新。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111011" : {
					"cause" : "策略不是停止状态不允许删除。",
					"desc" : "策略不是停止状态不允许删除。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111012" : {
					"cause" : "策略正在阻塞状态，不能停止。",
					"desc" : "策略正在阻塞状态，不能停止。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111013" : {
					"cause" : "策略正在阻塞状态，不能启动。",
					"desc" : "策略正在阻塞状态，不能启动。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111014" : {
					"cause" : "只有指标值>=阈值是才执行扩容操作",
					"desc" : "只有指标值>=阈值是才执行扩容操作",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111015" : {
					"cause" : "只有指标值<=阈值是才执行减容操作。",
					"desc" : "只有指标值<=阈值是才执行减容操作。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111016" : {
					"cause" : "策略指标重复：一条策略里面同样的指标不能出现两次。",
					"desc" : "策略指标重复：一条策略里面同样的指标不能出现两次。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111017" : {
					"cause" : "策略名称有误",
					"desc" : "策略名称有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111018" : {
					"cause" : "策略描述有误",
					"desc" : "策略描述有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111019" : {
					"cause" : "统计周期有误",
					"desc" : "统计周期有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111020" : {
					"cause" : "连续次数有误",
					"desc" : "连续次数有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111021" : {
					"cause" : "触发动作有误",
					"desc" : "触发动作有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111022" : {
					"cause" : "冷却时间有误",
					"desc" : "冷却时间有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111023" : {
					"cause" : "伸缩步长有误",
					"desc" : "伸缩步长有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111024" : {
					"cause" : "伸缩步长计算类型有误",
					"desc" : "伸缩步长计算类型有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111025" : {
					"cause" : "策略指标类型有误",
					"desc" : "策略指标类型有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111026" : {
					"cause" : "指标类型CPU阈值有误",
					"desc" : "指标类型CPU阈值有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111027" : {
					"cause" : "指标类型MEMORY阈值有误",
					"desc" : "指标类型MEMORY阈值有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111028" : {
					"cause" : "指标类型上行网络流量阈值有误",
					"desc" : "指标类型上行网络流量阈值有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111029" : {
					"cause" : "指标类型下行网络流量阈值有误",
					"desc" : "指标类型下行网络流量阈值有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111030" : {
					"cause" : "指标类型读磁盘阈值有误",
					"desc" : "指标类型读磁盘阈值有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111031" : {
					"cause" : "指标类型写磁盘阈值有误",
					"desc" : "指标类型写磁盘阈值有误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111032" : {
					"cause" : "伸缩组内策略超过10个",
					"desc" : "伸缩组内策略超过10个",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111300" : {
					"cause" : "VDC下只能允许有一个组间策略在运行。",
					"desc" : "VDC下只能允许有一个组间策略在运行。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111301" : {
					"cause" : "VDC下有组间策略正在资源回收中，不能启动。",
					"desc" : "VDC下有组间策略正在资源回收中，不能启动。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111303" : {
					"cause" : "输入时间比系统时间早",
					"desc" : "输入时间比系统时间早",
					"solution" : "请查看服务器系统时间，并且确认输入时间比该时间晚"
				},
				"5111400" : {
					"cause" : "组间策略重名.",
					"desc" : "组间策略重名.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111401" : {
					"cause" : "组间策略超出系统限制.",
					"desc" : "组间策略超出系统限制.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111402" : {
					"cause" : "组间策略不存在.",
					"desc" : "组间策略不存在.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111403" : {
					"cause" : "组间策略运行中,不支持更新.",
					"desc" : "组间策略运行中,不支持更新.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111404" : {
					"cause" : "组间策略中含有重复的伸缩组.",
					"desc" : "组间策略中含有重复的伸缩组.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111405" : {
					"cause" : "组间策略中配置的cpu或内存的预留值和超出vdc 资源最大值.",
					"desc" : "组间策略中配置的cpu或内存的预留值和超出vdc 资源最大值.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111406" : {
					"cause" : "组间策略中选择的vdc不存在.",
					"desc" : "组间策略中选择的vdc不存在.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111407" : {
					"cause" : "组间策略运行中，不支持删除.",
					"desc" : "组间策略运行中，不支持删除.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111408" : {
					"cause" : "策略当前被计划任务引用，不支持删除.",
					"desc" : "策略当前被计划任务引用，不支持删除.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111409" : {
					"cause" : "请选择伸缩组.",
					"desc" : "请选择伸缩组.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111410" : {
					"cause" : "组间策略需要添加伸缩组.",
					"desc" : "组间策略需要添加伸缩组.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111411" : {
					"cause" : "启动的策略不存在.",
					"desc" : "启动的策略不存在.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111412" : {
					"cause" : "停止的策略不存在.",
					"desc" : "停止的策略不存在.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111413" : {
					"cause" : "只有停止状态的策略支持修改.",
					"desc" : "只有停止状态的策略支持修改.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111414" : {
					"cause" : "策略正在资源回收中，不能停止。",
					"desc" : "策略正在资源回收中，不能停止。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111415" : {
					"cause" : "策略正在资源回收中，不能启动。",
					"desc" : "策略正在资源回收中，不能启动。",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111416" : {
					"cause" : "策略当前被计划任务引用，不支持删除.",
					"desc" : "策略当前被计划任务引用，不支持删除.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111503" : {
					"cause" : "计划任务不存在",
					"desc" : "计划任务不存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111504" : {
					"cause" : "计划任务关联的策略的类型错误",
					"desc" : "计划任务关联的策略的类型错误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5111505" : {
					"cause" : "计划任务关联的策略的操作错误",
					"desc" : "计划任务关联的策略的操作错误",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112000" : {
					"cause" : "无效的输入参数",
					"desc" : "无效的输入参数",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112001" : {
					"cause" : "数据库操作异常",
					"desc" : "数据库操作异常",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112002" : {
					"cause" : "系统内部异常",
					"desc" : "系统内部异常",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112003" : {
					"cause" : "RPC异常",
					"desc" : "RPC异常",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112100" : {
					"cause" : "伸缩组名称已存在",
					"desc" : "伸缩组名称已存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112101" : {
					"cause" : "无效的伸缩组名称",
					"desc" : "无效的伸缩组名称",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112102" : {
					"cause" : "无效的伸缩组描述",
					"desc" : "无效的伸缩组描述",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112103" : {
					"cause" : "当前伸缩组状态不适合停止伸缩组",
					"desc" : "当前伸缩组状态不适合停止伸缩组",
					"solution" : "请等待伸缩组状态恢复正常后重试"
				},
				"5112104" : {
					"cause" : "伸缩组已存在",
					"desc" : "伸缩组已存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112105" : {
					"cause" : "组内策略状态不适合更新伸缩组",
					"desc" : "组内策略状态不适合更新伸缩组",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112106" : {
					"cause" : "伸缩组状态不适合创建组内策略",
					"desc" : "伸缩组状态不适合创建组内策略",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112107" : {
					"cause" : "伸缩组状态不适合更新组内策略",
					"desc" : "伸缩组状态不适合更新组内策略",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112108" : {
					"cause" : "伸缩组状态不适合更新伸缩组",
					"desc" : "伸缩组状态不适合更新伸缩组",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112109" : {
					"cause" : "伸缩组状态不适合删除伸缩组",
					"desc" : "伸缩组状态不适合删除伸缩组",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112110" : {
					"cause" : "伸缩组内虚拟机创建失败",
					"desc" : "伸缩组内虚拟机创建失败",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112111" : {
					"cause" : "组内策略与伸缩组不匹配",
					"desc" : "组内策略与伸缩组不匹配",
					"solution" : "请联系技术支持工程师或者查看手册"
				},
				"5112114" : {
					"cause" : "组内策略状态不允许执行停止操作",
					"desc" : "组内策略状态不允许执行停止操作",
					"solution" : "请等待策略状态恢复正常后重试"
				},
				"5112115" : {
					"cause" : "当前应用状态不允许此操作",
					"desc" : "当前应用状态不允许此操作",
					"solution" : "操作之前请检查应用是否处于运行状态"
				},
				"5112116" : {
					"cause" : "当前应用状态不允许伸缩",
					"desc" : "当前应用状态不允许伸缩",
					"solution" : "操作之前请检查应用是否处于运行状态"
				},
				"5112117" : {
					"cause" : "当前伸缩组已经存在定时伸缩计划",
					"desc" : "当前伸缩组已经存在定时伸缩计划",
					"solution" : "当前无法设定定时伸缩计划，请稍后重试"
				},
				"5112118" : {
					"cause" : "伸缩组触发时间不能迟于系统当前时间",
					"desc" : "伸缩组触发时间不能迟于系统当前时间",
					"solution" : "请选择正确触发时间"
				},
				"5112119" : {
					"cause" : "伸缩组数量超过系统最大值",
					"desc" : "伸缩组数量超过系统最大值",
					"solution" : "请联系技术支持工程师。"
				},
				"5112201" : {
					"cause" : "重复的动作名称",
					"desc" : "重复的动作名称",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112202" : {
					"cause" : "页码无效",
					"desc" : "页码无效",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112203" : {
					"cause" : "伸缩组不存在",
					"desc" : "伸缩组不存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112204" : {
					"cause" : "每页大小无效",
					"desc" : "每页大小无效",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112205" : {
					"cause" : "伸缩组状态不适合执行动作",
					"desc" : "伸缩组状态不适合执行动作",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112206" : {
					"cause" : "动作执行超时",
					"desc" : "动作执行超时",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112207" : {
					"cause" : "伸缩组的状态不支持启动策略",
					"desc" : "伸缩组的状态不支持启动策略",
					"solution" : "请重新选择"
				},
				"5112208" : {
					"cause" : "伸缩组状态不适合删除组内策略",
					"desc" : "伸缩组状态不适合删除组内策略",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112209" : {
					"cause" : "伸缩组的状态不支持停止策略",
					"desc" : "伸缩组的状态不支持停止策略",
					"solution" : "请重新选择"
				},
				"5112210" : {
					"cause" : "伸缩组正在伸缩不适合启动组内策略",
					"desc" : "伸缩组正在伸缩不适合启动组内策略",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112211" : {
					"cause" : "伸缩动作不存在",
					"desc" : "伸缩动作不存在",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112212" : {
					"cause" : "当前伸缩组允许回收的资源为0",
					"desc" : "当前伸缩组允许回收的资源为0",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112213" : {
					"cause" : "伸缩组处于冷却时间",
					"desc" : "伸缩组处于冷却时间",
					"solution" : "请稍后重试"
				},
				"5112216" : {
					"cause" : "策略处于冷却时间",
					"desc" : "策略处于冷却时间",
					"solution" : "请稍后重试"
				},
				"5112218" : {
					"cause" : "虚拟机启动失败",
					"desc" : "虚拟机启动失败",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5112300" : {
					"cause" : "绑定VLB，虚拟机网卡不存在",
					"desc" : "绑定VLB，虚拟机网卡不存在",
					"solution" : "请联系技术支持工程师"
				},
				"5112301" : {
					"cause" : "绑定VLB失败",
					"desc" : "绑定VLB失败",
					"solution" : "请稍后重试"
				},
				"5112302" : {
					"cause" : "解绑VLB失败",
					"desc" : "解绑VLB失败",
					"solution" : "请稍后重试"
				},
				"5113001" : {
					"cause" : "请求校验失败.",
					"desc" : "请求校验失败.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113002" : {
					"cause" : "事件无法找到.",
					"desc" : "事件无法找到.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113003" : {
					"cause" : "事件已经存在.",
					"desc" : "事件已经存在.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113100" : {
					"cause" : "系统没有初始化.",
					"desc" : "系统没有初始化.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113101" : {
					"cause" : "获取采集任务ID失败.",
					"desc" : "获取采集任务ID失败.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113102" : {
					"cause" : "无法找到插件实例.",
					"desc" : "无法找到插件实例.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113103" : {
					"cause" : "插件没有注册.",
					"desc" : "插件没有注册.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113104" : {
					"cause" : "创建插件实例失败.",
					"desc" : "创建插件实例失败.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113105" : {
					"cause" : "初始化插件实例失败.",
					"desc" : "初始化插件实例失败.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113106" : {
					"cause" : "无法找到插件类.",
					"desc" : "无法找到插件类.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113107" : {
					"cause" : "应用不是运行状态.",
					"desc" : "应用不是运行状态.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113108" : {
					"cause" : "应用不存在.",
					"desc" : "应用不存在.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113900" : {
					"cause" : "数据库异常.",
					"desc" : "数据库异常.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113901" : {
					"cause" : "系统异常.",
					"desc" : "系统异常.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5113902" : {
					"cause" : "非法参数.",
					"desc" : "非法参数.",
					"solution" : "Please contact your administrator or view the help manual."
				},
				"5120007" : {
					"cause" : "虚拟机上已安装指定软件包。",
					"desc" : "虚拟机上已安装指定软件包。",
					"solution" : "虚拟机上已安装指定软件包。"
				},
				"5400001" : {
					"cause" : "虚拟机重复选择。",
					"desc" : "虚拟机重复选择。",
					"solution" : "虚拟机重复选择。"
				},
				"5400002" : {
					"cause" : "没有选择虚拟机。",
					"desc" : "没有选择虚拟机。",
					"solution" : "请选择虚拟机，然后再进行操作。"
				},
				"5400003" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "参数非法。"
				},
				"5400004" : {
					"cause" : "虚拟机正在安装软件包。",
					"desc" : "虚拟机正在安装软件包。",
					"solution" : "虚拟机正在安装软件包。"
				},
				"5400005" : {
					"cause" : "选择的虚拟机个数达到最大上限30个。",
					"desc" : "选择的虚拟机个数达到最大上限30个。",
					"solution" : "选择的虚拟机个数达到最大上限30个。"
				},
				"5400006" : {
					"cause" : "选择的软件包文件大小超过4G。",
					"desc" : "选择的软件包文件大小超过4G。",
					"solution" : "选择的软件包文件大小超过4G。"
				},
				"5411001" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "请重新命名。"
				},
				"5411002" : {
					"cause" : "选择的ISO文件大小超过6G。",
					"desc" : "选择的ISO文件大小超过6G。",
					"solution" : "选择的ISO文件大小超过6G。"
				},
				"5411011" : {
					"cause" : "添加的ISO数量已达到系统最大值。",
					"desc" : "添加的ISO数量已达到系统最大值。",
					"solution" : "请删除不常用的ISO后再尝试添加，请慎重操作。"
				},
				"5411012" : {
					"cause" : "添加的ISO数量已达到组织最大值。",
					"desc" : "添加的ISO数量已达到组织最大值。",
					"solution" : "请删除不常用的ISO后再尝试添加，请慎重操作。"
				},
				"5411013" : {
					"cause" : "该ISO已经删除。",
					"desc" : "该ISO已经删除。",
					"solution" : "请刷新ISO管理页面后重试。"
				},
				"5600600" : {
					"cause" : "文件找不到。",
					"desc" : "文件找不到。",
					"solution" : "文件找不到。"
				},
				"5600601" : {
					"cause" : "文件传输出现异常。",
					"desc" : "文件传输出现异常。",
					"solution" : "文件传输出现异常。"
				},
				"5600602" : {
					"cause" : "文件传输出现异常。",
					"desc" : "文件传输出现异常。",
					"solution" : "文件传输出现异常。"
				},
				"5600603" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"5601006" : {
					"cause" : "系统繁忙。",
					"desc" : "系统繁忙。",
					"solution" : "系统繁忙，请稍后重试。"
				},
				"5602005" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "应用异常，请删除该应用。"
				},
				"5602007" : {
					"cause" : "对象状态冲突",
					"desc" : "对象状态冲突",
					"solution" : "请检查虚拟机的状态"
				},
				"5602096" : {
					"cause" : "虚拟机Tools未启动",
					"desc" : "虚拟机Tools未启动",
					"solution" : "请稍后重试或者联系系统管理员"
				},
				"5602371" : {
					"cause" : "CPU资源不足",
					"desc" : "CPU资源不足",
					"solution" : "请确认资源充足后重试"
				},
				"5602372" : {
					"cause" : "内存资源不足",
					"desc" : "内存资源不足",
					"solution" : "请确认资源充足后重试"
				},
				"0005011260": {
					"cause" : "可用分区下未关联任何资源。",
					"desc" : "可用分区下未关联任何资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"5602374" : {
					"cause" : "供选择的主机均异常",
					"desc" : "供选择的主机均异常",
					"solution" : "请检查并处理主机异常后重试。全部下电时，若故障无法恢复，可尝试强制关闭虚拟机后重试"
				},
				"5602375" : {
					"cause" : "供选择的主机均处于维护模式",
					"desc" : "供选择的主机均处于维护模式",
					"solution" : "请检查并处理主机异常后重试。全部下电时，若故障无法恢复，可尝试强制关闭虚拟机后重试"
				},
				"5602376" : {
					"cause" : "供选择的主机均不可用",
					"desc" : "供选择的主机均不可用",
					"solution" : "请检查并处理主机异常后重试。全部下电时，若故障无法恢复，可尝试强制关闭虚拟机后重试"
				},
				"5602377" : {
					"cause" : "无供选择的主机",
					"desc" : "无供选择的主机",
					"solution" : "请检查并处理主机异常后重试。"
				},
				"5640015" : {
					"cause" : "系统与FusionCompute无法连接。",
					"desc" : "系统与FusionCompute无法连接。",
					"solution" : "请确认虚拟化环境是否正常连接。"
				},
				"5640016" : {
					"cause" : "系统与统一硬件管理无法连接。",
					"desc" : "系统与统一硬件管理无法连接。",
					"solution" : "请确认虚拟化环境是否正常连接。"
				},
				"5670033" : {
					"cause" : "任务冲突，虚拟机存在尚未结束的任务",
					"desc" : "任务冲突，虚拟机存在尚未结束的任务",
					"solution" : "请稍后重试"
				},
				"5790012" : {
					"cause" : "绑定虚拟机失败。",
					"desc" : "绑定虚拟机失败。",
					"solution" : "请联系华为技术支持。"
				},
				"5790013" : {
					"cause" : "监视器状态不支持绑定虚拟机。",
					"desc" : "监视器状态不支持绑定虚拟机。",
					"solution" : "请联系华为技术支持。"
				},
				"5790014" : {
					"cause" : "创建负载均衡虚拟机获取IP失败。",
					"desc" : "创建负载均衡虚拟机获取IP失败。",
					"solution" : "请联系华为技术支持。"
				},
				"5790015" : {
					"cause" : "监视器关联的VM已经达到最大值。",
					"desc" : "监视器关联的VM已经达到最大值。",
					"solution" : "请联系华为技术支持。"
				},
				"5790016" : {
					"cause" : "监视器不存在。",
					"desc" : "监视器不存在。",
					"solution" : "请联系华为技术支持。"
				},
				"5790017" : {
					"cause" : "监视器和负载均衡不匹配。",
					"desc" : "监视器和负载均衡不匹配。",
					"solution" : "请联系华为技术支持。"
				},
				"5790019" : {
					"cause" : "负载均衡当前状态不适合此操作。",
					"desc" : "负载均衡当前状态不适合此操作。",
					"solution" : "请联系华为技术支持。"
				},
				"5790021" : {
					"cause" : "负载均衡不存在。",
					"desc" : "负载均衡不存在。",
					"solution" : "请联系华为技术支持。"
				},
				"5790022" : {
					"cause" : "负载均衡状态冲突。",
					"desc" : "负载均衡状态冲突。",
					"solution" : "请联系华为技术支持。"
				},
				"5790023" : {
					"cause" : "监视器状态冲突。",
					"desc" : "监视器状态冲突。",
					"solution" : "请联系华为技术支持。"
				},
				"5790034" : {
					"cause" : "监视器状态不支持绑定虚拟机。",
					"desc" : "监视器状态不支持绑定虚拟机。",
					"solution" : "请联系华为技术支持。"
				},
				"5790036" : {
					"cause" : "监视器状态不支持去关联虚拟机。",
					"desc" : "监视器状态不支持去关联虚拟机。",
					"solution" : "请联系华为技术支持。"
				},
				"5790040" : {
					"cause" : "负载均衡下绑定虚拟机不能超过20个。",
					"desc" : "负载均衡下绑定虚拟机不能超过20个。",
					"solution" : "请联系华为技术支持。"
				},
				"5790043" : {
					"cause" : "同时支持关联虚拟机的监视器个数不能超过5个 。",
					"desc" : "同时支持关联虚拟机的监视器个数不能超过5个 。",
					"solution" : "请联系华为技术支持。"
				},
				"5790060" : {
					"cause" : "负载均衡与监视器不匹配。",
					"desc" : "负载均衡与监视器不匹配。",
					"solution" : "请联系华为技术支持。"
				},
				"5790061" : {
					"cause" : "硬件负载均衡下绑定虚拟机ip不允许超过100个。",
					"desc" : "硬件负载均衡下绑定虚拟机ip不允许超过100个。",
					"solution" : "请联系华为技术支持。"
				},
				"5790107" : {
					"cause" : "数据库操作失败。",
					"desc" : "数据库操作失败。",
					"solution" : "请联系华为技术支持。"
				},
				"5790108" : {
					"cause" : "负载均衡ID非法。",
					"desc" : "负载均衡ID非法。",
					"solution" : "请联系华为技术支持。"
				},
				"5790109" : {
					"cause" : "监视器为空。",
					"desc" : "监视器为空。",
					"solution" : "请联系华为技术支持。"
				},
				"5790110" : {
					"cause" : "负载均衡不存在。",
					"desc" : "负载均衡不存在。",
					"solution" : "请联系华为技术支持。"
				},
				"5790111" : {
					"cause" : "负载均衡状态不正确。",
					"desc" : "负载均衡状态不正确。",
					"solution" : "请联系华为技术支持。"
				},
				"5790112" : {
					"cause" : "虚拟机为空。",
					"desc" : "虚拟机为空。",
					"solution" : "请联系华为技术支持。"
				},
				"5790113" : {
					"cause" : "监视器不存在。",
					"desc" : "监视器不存在。",
					"solution" : "请联系华为技术支持。"
				},
				"5790114" : {
					"cause" : "监视器和负载均衡不匹配。",
					"desc" : "监视器和负载均衡不匹配。",
					"solution" : "请联系华为技术支持。"
				},
				"5800000" : {
					"cause" : "该用户无此操作权限。",
					"desc" : "该用户无此操作权限。",
					"solution" : "对不起，您没有该操作的权限。请联系管理员申请权限。"
				},
				"5880002" : {
					"cause" : "参数非法.",
					"desc" : "参数非法.",
					"solution" : "请输入合法参数."
				},
				"5880003" : {
					"cause" : "内部服务错误.",
					"desc" : "内部服务错误.",
					"solution" : "请联系系统管理员."
				},
				"5880004" : {
					"cause" : "查询数据库异常.",
					"desc" : "查询数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"5880005" : {
					"cause" : "虚拟机资源不存在.",
					"desc" : "虚拟机资源不存在.",
					"solution" : "请联系系统管理员."
				},
				"5880006" : {
					"cause" : "应用资源不存在.",
					"desc" : "应用资源不存在.",
					"solution" : "请联系系统管理员."
				},
				"5880007" : {
					"cause" : "删除数据库异常.",
					"desc" : "删除数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"5880008" : {
					"cause" : "存入数据库异常.",
					"desc" : "存入数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"5880009" : {
					"cause" : "虚拟机状态为非停止状态，不允许删除磁盘.",
					"desc" : "虚拟机状态为非停止状态，不允许删除磁盘.",
					"solution" : "请联系系统管理员."
				},
	            "0005200067": {
	                "cause":"停止应用失败,请从应用实例查看部署报表。",
	                "desc":"停止应用失败,请从应用实例查看部署报表。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "0005200068": {
	                "cause":"删除应用失败,请从应用实例查看部署报表。",
	                "desc":"删除应用失败,请从应用实例查看部署报表。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "0005200069": {
	                "cause":"创建应用失败，请从应用实例查看部署报表。",
	                "desc":"创建应用失败，请从应用实例查看部署报表。",
	                "solution":"请联系技术支持工程师。"
	            },
                "1310083": {
	                "cause":"当前版本的FusionCompute不支持IPv6。",
	                "desc":"当前版本的FusionCompute不支持IPv6。",
	                "solution":"请联系技术支持工程师。"
	            },
	            "5103105" : {
					"cause" : "部分虚拟机不存在或者虚拟机状态不是运行态",
					"desc" : "部分虚拟机不存在或者虚拟机状态不是运行态",
					"solution" : "请确保虚拟机都存在并且是运行态的虚拟机"
				},
				"0005009001" : {
					"cause" : "查询路由信息失败。",
					"desc" : "查询路由信息失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005009002" : {
					"cause" : "创建弹性IP失败。",
					"desc" : "创建弹性IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005009003" : {
					"cause" : "创建浮动IP失败。",
					"desc" : "创建浮动IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005009004" : {
					"cause" : "删除弹性IP失败。",
					"desc" : "删除弹性IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005009005" : {
					"cause" : "删除浮动IP失败。",
					"desc" : "删除浮动IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
                "1166029": {
	                "cause":"当前版本的软件路由器不支持ACL。",
	                "desc":"当前版本的软件路由器不支持ACL。",
	                "solution":"请联系技术支持工程师。"
	            },
                "1184062": {
	                "cause":"当前版本的软件路由器不支持VPN。",
	                "desc":"当前版本的软件路由器不支持VPN。",
	                "solution":"请联系技术支持工程师。"
	            },
				"1184063": {
	                "cause":"L2TP类型的VPN链接，IKE策略不能使用AES类的加密算法。",
	                "desc":"L2TP类型的VPN链接，IKE策略不能使用AES类的加密算法。",
	                "solution":"请联系技术支持工程师。"
	            },
				"0005001111" : {
					"cause" : "不允许系统管理员将自己添加为VDC管理员。",
					"desc" : "不允许系统管理员将自己添加为VDC管理员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162660": {
	                "cause":"对端网络不通。",
	                "desc":"对端网络不通。",
	                "solution":"请联系技术支持工程师。"
	            },
				"1162661": {
	                "cause":"密码错误。",
	                "desc":"密码错误。",
	                "solution":"请联系技术支持工程师。"
	            },
				"1162662": {
	                "cause":"禁止主备倒换失败。",
	                "desc":"禁止主备倒换失败。",
	                "solution":"请联系技术支持工程师。"
	            }
                
			};
			return exceptionMap;
		})