define([ "tiny-lib/underscore" ], function(_) {
			var exceptionMap = {
				"0000000001" : {
					"cause" : "内部错误.",
					"desc" : "内部错误.",
					"solution" : "请联系系统管理员."
				},
				 "0000010007": {
                "cause":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                "desc":"连接超时，虚拟化环境IP地址或端口等信息不正确。",
                "solution":"请检查虚拟化环境接入信息是否输入正确。"
            },	
			 "0000030004": {
                "cause":"用户名或密码不正确。",
                "desc":"用户名或密码不正确。",
                "solution":"请输入正确的用户名和密码。"
            },
				"0000010002" : {
					"cause" : "参数非法.",
					"desc" : "参数非法.",
					"solution" : "请修改输入参数."
				},
				"0000010004" : {
					"cause" : "无权限.",
					"desc" : "无权限.",
					"solution" : "请联系系统管理员."
				},
				"0000020000" : {
					"cause" : "数据库异常.",
					"desc" : "数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"0005010001" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010002" : {
					"cause" : "数据库异常.",
					"desc" : "数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"0005010019" : {
					"cause" : "操作超时。",
					"desc" : "操作超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010022" : {
					"cause" : "虚拟化环境设置语言不合法。",
					"desc" : "虚拟化环境设置语言不合法。",
					"solution" : "请选择合适的语言进行设置。"
				},
				"0005010066" : {
					"cause" : "入参名称不合法。",
					"desc" : "入参名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010127" : {
					"cause" : "虚拟机硬盘超过最大数量。",
					"desc" : "虚拟机硬盘超过最大数量。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010145" : {
					"cause" : "虚拟机已挂载光驱.",
					"desc" : "虚拟机已挂载光驱.",
					"solution" : "请联系系统管理员."
				},
				"0005010156" : {
					"cause" : "磁盘被虚拟机使用中。",
					"desc" : "磁盘被虚拟机使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010186" : {
					"cause" : "输入参数非法。",
					"desc" : "输入参数非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010190" : {
					"cause" : "存储资源不足.",
					"desc" : "存储资源不足.",
					"solution" : "请联系系统管理员."
				},
				"0005010205" : {
					"cause" : "批量查询磁盘个数错误.",
					"desc" : "批量查询磁盘个数错误.",
					"solution" : "请联系系统管理员."
				},
				"0005010232" : {
					"cause" : "虚拟机网卡端口组不存在。",
					"desc" : "虚拟机网卡端口组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010280" : {
					"cause" : "虚拟机正在执行此操作.",
					"desc" : "虚拟机正在执行此操作.",
					"solution" : "请联系系统管理员."
				},
				"0005010366" : {
					"cause" : "虚拟机正在克隆，不能操作磁盘.",
					"desc" : "虚拟机正在克隆，不能操作磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005010409" : {
					"cause" : "用户取消任务。",
					"desc" : "用户取消任务。",
					"solution" : "请确认后再进行操作"
				},
				"0005010434" : {
					"cause" : "该磁盘不能绑定该虚拟机，请将虚拟机加入组织后再试.",
					"desc" : "该磁盘不能绑定该虚拟机，请将虚拟机加入组织后再试.",
					"solution" : "请联系系统管理员."
				},
				"0005010484" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "请重新命名。"
				},
				"0005010485" : {
					"cause" : "文件操作异常。",
					"desc" : "文件操作异常。",
					"solution" : "请重新命名。"
				},
				"0005010486" : {
					"cause" : "数据存储操作无效。",
					"desc" : "数据存储操作无效。",
					"solution" : "请重新命名。"
				},
				"0005010487" : {
					"cause" : "当前状态不允许此操作。",
					"desc" : "当前状态不允许此操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010488" : {
					"cause" : "名称不合法。",
					"desc" : "名称不合法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"0005010489" : {
					"cause" : "系统正在执行涉及该对象的另一操作。",
					"desc" : "系统正在执行涉及该对象的另一操作。",
					"solution" : "请稍后重试。"
				},
				"0005010491" : {
					"cause" : "创建或挂载的磁盘不支持容灾，请联系系统管理员。",
					"desc" : "创建或挂载的磁盘不支持容灾，请联系系统管理员。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005010492" : {
					"cause" : "目标节点/资源集群不能满足虚拟机运行的存储条件。",
					"desc" : "目标节点/资源集群不能满足虚拟机运行的存储条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011011" : {
					"cause" : "资源不足。",
					"desc" : "资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011014" : {
					"cause" : "任务执行失败。",
					"desc" : "任务执行失败。",
					"solution" : "请登录Vcenter查看任务详情。"
				},
				"0005011015" : {
					"cause" : "迁移操作异常。",
					"desc" : "迁移操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011016" : {
					"cause" : "此虚拟机在任务中心有尚未结束的任务.",
					"desc" : "此虚拟机在任务中心有尚未结束的任务.",
					"solution" : "请联系系统管理员."
				},
				"0005011025" : {
					"cause" : "可用CPU资源不足，无法执行该操作。",
					"desc" : "可用CPU资源不足，无法执行该操作。",
					"solution" : "请检查资源是否足够。"
				},
				"0005011026" : {
					"cause" : "可用内存资源不足。",
					"desc" : "可用内存资源不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011027" : {
					"cause" : "集群下的存储资源不足.",
					"desc" : "集群下的存储资源不足.",
					"solution" : "请联系系统管理员."
				},
				"0005011053" : {
					"cause" : "系统磁盘不允许在线删除.",
					"desc" : "系统磁盘不允许在线删除.",
					"solution" : "请联系系统管理员."
				},
				"0005011056" : {
					"cause" : "每个物理CPU的容量都不足。",
					"desc" : "每个物理CPU的容量都不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011065" : {
					"cause" : "虚拟机配置了独立磁盘，无法创建内存快照。",
					"desc" : "虚拟机配置了独立磁盘，无法创建内存快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011066" : {
					"cause" : "虚拟机有设备不满足迁移条件。例如：虚拟机有非持久化磁盘。",
					"desc" : "虚拟机有设备不满足迁移条件。例如：虚拟机有非持久化磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011067" : {
					"cause" : "虚拟机有快照，不支持修改磁盘属性。",
					"desc" : "虚拟机有快照，不支持修改磁盘属性。",
					"solution" : "请先删除该虚拟机的快照（如果允许），再执行此操作。"
				},
				"0005011069" : {
					"cause" : "可读写的存储空间不足。",
					"desc" : "可读写的存储空间不足。",
					"solution" : "请选择合适的存储容量。"
				},
				"0005011076" : {
					"cause" : "虚拟机的状态自上次执行快照操作以来未发生变化。",
					"desc" : "虚拟机的状态自上次执行快照操作以来未发生变化。",
					"solution" : "请等待虚拟机状态发生改变后重试。"
				},
				"0005011077" : {
					"cause" : "源或目标主机上的vMotion接口未配置（或者配置错误）。",
					"desc" : "源或目标主机上的vMotion接口未配置（或者配置错误）。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011078" : {
					"cause" : "在主机的当前连接状况下不允许执行该操作。",
					"desc" : "在主机的当前连接状况下不允许执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011085" : {
					"cause" : "主机不兼容该操作系统。",
					"desc" : "主机不兼容该操作系统。",
					"solution" : "请选择其它操作系统。"
				},
				"0005011087" : {
					"cause" : "没有主机兼容此虚拟机。",
					"desc" : "没有主机兼容此虚拟机。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011101" : {
					"cause" : "无法访问虚拟机配置文件。",
					"desc" : "无法访问虚拟机配置文件。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011125" : {
					"cause" : "磁盘的大小超过数据存储支持的最大值。",
					"desc" : "磁盘的大小超过数据存储支持的最大值。",
					"solution" : "请确认数据存储支持的最大值。"
				},
				"0005011127" : {
					"cause" : "共享磁盘必须是不受快照影响磁盘.",
					"desc" : "共享磁盘必须是不受快照影响磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005011162" : {
					"cause" : "目的主机故障。",
					"desc" : "目的主机故障。",
					"solution" : "请检查目的主机状态是否正常。"
				},
				"0005011163" : {
					"cause" : "无法访问虚拟机文件。",
					"desc" : "无法访问虚拟机文件。",
					"solution" : "请检查虚拟机文件是否存在。"
				},
				"0005011164" : {
					"cause" : "目标存储空间不足。",
					"desc" : "目标存储空间不足。",
					"solution" : "请检查目标存储的空间是否足够。"
				},
				"0005011165" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请检查参数。"
				},
				"0005011166" : {
					"cause" : "目标存储不支持迁移。",
					"desc" : "目标存储不支持迁移。",
					"solution" : "请检查目标数据存储是否支持迁移。"
				},
				"0005011167" : {
					"cause" : "无法访问目标数据存储。",
					"desc" : "无法访问目标数据存储。",
					"solution" : "请检查目标存储的状态是否正常。"
				},
				"0005011168" : {
					"cause" : "模板虚拟机不支持迁移。",
					"desc" : "模板虚拟机不支持迁移。",
					"solution" : "请确认虚拟机是否为模板虚拟机。"
				},
				"0005011169" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011170" : {
					"cause" : "迁移超时。",
					"desc" : "迁移超时。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011195" : {
					"cause" : "VMWARE不支持此操作。",
					"desc" : "VMWARE不支持此操作。",
					"solution" : "请在FusionCompute下执行。"
				},
				"0005011197" : {
					"cause" : "无法访问虚拟机磁盘。",
					"desc" : "无法访问虚拟机磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011198" : {
					"cause" : "系统中该对象已不存在。",
					"desc" : "系统中该对象已不存在。",
					"solution" : "请刷新后重试。"
				},
				"0005011201" : {
					"cause" : "虚拟机配置错误。",
					"desc" : "虚拟机配置错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011202" : {
					"cause" : "不支持该操作。",
					"desc" : "不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011203" : {
					"cause" : "虚拟机不支持CPU热插拔。",
					"desc" : "虚拟机不支持CPU热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011204" : {
					"cause" : "虚拟机状态冲突，不允许此操作。",
					"desc" : "虚拟机状态冲突，不允许此操作。",
					"solution" : "请刷新虚拟机的状态。"
				},
				"0005011205" : {
					"cause" : "该虚拟机不支持内存热插拔。",
					"desc" : "该虚拟机不支持内存热插拔。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011206" : {
					"cause" : "虚拟设备的数量超过最大值。",
					"desc" : "虚拟设备的数量超过最大值。",
					"solution" : "请联系系统管理员。"
				},
				"0005011207" : {
					"cause" : "主机故障不允许操作。",
					"desc" : "主机故障不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011208" : {
					"cause" : "VMWare产品没有足够的licenses。",
					"desc" : "VMWare产品没有足够的licenses。",
					"solution" : "请联系技术支持工程师，购买VMWare产品的licenses，并注册，方可使用。"
				},
				"0005011209" : {
					"cause" : "VMware Tools响应异常",
					"desc" : "VMware Tools响应异常",
					"solution" : "请联系系统管理员"
				},
				"0005011210" : {
					"cause" : "创建虚拟机时自定义配置虚拟机失败。",
					"desc" : "创建虚拟机时自定义配置虚拟机失败。",
					"solution" : "请检查虚拟机模板的配置是否正确。"
				},
				"0005011211" : {
					"cause" : "资源不足，无法满足配置的HA故障切换级别。",
					"desc" : "资源不足，无法满足配置的HA故障切换级别。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"0005011212" : {
					"cause" : "主机的CPU资源不足，无法满足预留。",
					"desc" : "主机的CPU资源不足，无法满足预留。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"0005011213" : {
					"cause" : "主机的内存资源不足，无法满足预留。",
					"desc" : "主机的内存资源不足，无法满足预留。",
					"solution" : "请选择合适的虚拟机规格进行配置。"
				},
				"0005011215" : {
					"cause" : "请求中的虚拟机id错误.",
					"desc" : "请求中的虚拟机id错误.",
					"solution" : "请联系系统管理员."
				},
				"0005011216" : {
					"cause" : "目标磁盘大小应大于原磁盘大小。",
					"desc" : "目标磁盘大小应大于原磁盘大小。",
					"solution" : "请修改扩容的大小。"
				},
				"0005011217" : {
					"cause" : "该磁盘存在快照或为链接克隆虚拟机的系统磁盘。",
					"desc" : "该磁盘存在快照或为链接克隆虚拟机的系统磁盘。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011220" : {
					"cause" : "模板虚拟机的磁盘不能进行扩容。",
					"desc" : "模板虚拟机的磁盘不能进行扩容。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005011221" : {
					"cause" : "目标磁盘大小应小于最大上限。",
					"desc" : "目标磁盘大小应小于最大上限。",
					"solution" : "请修改扩容的大小。"
				},
				"0005011223" : {
					"cause" : "当前存类型不支持创建非持久化磁盘差分磁盘.",
					"desc" : "当前存类型不支持创建非持久化磁盘差分磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005011224" : {
					"cause" : "非持久化磁盘必须是不受快照影响磁盘.",
					"desc" : "非持久化磁盘必须是不受快照影响磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005011225" : {
					"cause" : "磁盘必须是普通磁盘才能设置为非持久化.",
					"desc" : "磁盘必须是普通磁盘才能设置为非持久化.",
					"solution" : "请联系系统管理员."
				},
				"0005011226" : {
					"cause" : "磁盘必须是虚拟化存储才能进行非持久化设置.",
					"desc" : "磁盘必须是虚拟化存储才能进行非持久化设置.",
					"solution" : "请联系系统管理员."
				},
				"0005011227" : {
					"cause" : "BSB无法查询到指定磁盘.",
					"desc" : "BSB无法查询到指定磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005011228" : {
					"cause" : "磁盘状态或绑定的虚拟机状态冲突，无法修改磁盘持久化属性.",
					"desc" : "磁盘状态或绑定的虚拟机状态冲突，无法修改磁盘持久化属性.",
					"solution" : "请联系系统管理员."
				},
				"0005011230" : {
					"cause" : "磁盘存在快照，不允许修改不受快照影响参数.",
					"desc" : "磁盘存在快照，不允许修改不受快照影响参数.",
					"solution" : "请联系系统管理员."
				},
				"0005011239" : {
					"cause" : "参数refreshflag无效.",
					"desc" : "参数refreshflag无效.",
					"solution" : "请联系系统管理员."
				},
				"0005011241" : {
					"cause" : "非持久化磁盘不能设置为受快照影响磁盘.",
					"desc" : "非持久化磁盘不能设置为受快照影响磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005011246" : {
					"cause" : "当前虚拟化环境不支持该操作。",
					"desc" : "当前虚拟化环境不支持该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012023" : {
					"cause" : "内存交换磁盘不允许卸载.",
					"desc" : "内存交换磁盘不允许卸载.",
					"solution" : "请联系系统管理员."
				},
				"0005012024" : {
					"cause" : "共享磁盘不允许格式化.",
					"desc" : "共享磁盘不允许格式化.",
					"solution" : "请联系系统管理员."
				},
				"0005012025" : {
					"cause" : "数据存储的存储类型不支持创建精简磁盘.",
					"desc" : "数据存储的存储类型不支持创建精简磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005012034" : {
					"cause" : "数据存储不可访问。",
					"desc" : "数据存储不可访问。",
					"solution" : "请联系技术支持工程师。"
				},
				"0005012041" : {
					"cause" : "数据存储不在FusionManager中，请更新虚拟化环境资源重试.",
					"desc" : "数据存储不在FusionManager中，请更新虚拟化环境资源重试.",
					"solution" : "请联系系统管理员."
				},
				"0005012046" : {
					"cause" : "存储处于维护模式，不允许该操作.",
					"desc" : "存储处于维护模式，不允许该操作.",
					"solution" : "请联系系统管理员."
				},
				"0005012050" : {
					"cause" : "数据存储的存储类型不支持创建普通延迟置零磁盘.",
					"desc" : "数据存储的存储类型不支持创建普通延迟置零磁盘.",
					"solution" : "请联系系统管理员."
				},
				"0005012063" : {
					"cause" : "未挂载的卷不允许卸载.",
					"desc" : "未挂载的卷不允许卸载.",
					"solution" : "请联系系统管理员."
				},
				"0005012082" : {
					"cause" : "磁盘不存在或者当前磁盘已被删除.",
					"desc" : "磁盘不存在或者当前磁盘已被删除.",
					"solution" : "请联系系统管理员."
				},
				"0005101000" : {
					"cause" : "VPC规格不存在。",
					"desc" : "VPC规格不存在。",
					"solution" : "VPC规格不存在。"
				},
				"0005101001" : {
					"cause" : "VPC规格数量达到最大值16。",
					"desc" : "VPC规格数量达到最大值16。",
					"solution" : "VPC规格数量达到最大值16。"
				},
				"0005101002" : {
					"cause" : "名称重复。",
					"desc" : "名称重复。",
					"solution" : "名称重复。"
				},
				"0005101003" : {
					"cause" : "VSA虚拟机模板不存在。",
					"desc" : "VSA虚拟机模板不存在。",
					"solution" : "请发现VSA虚拟机模板。"
				},
				"0005101004" : {
					"cause" : "VPC内存在网络，无法删除。",
					"desc" : "VPC内存在网络，无法删除。",
					"solution" : "请先删除VPC内的网络。"
				},
				"0005101005" : {
					"cause" : "VPC内存在路由器，无法删除。",
					"desc" : "VPC内存在路由器，无法删除。",
					"solution" : "请先删除VPC内的路由器。"
				},
				"0005101006" : {
					"cause" : "VPC内存在磁盘，无法删除。",
					"desc" : "VPC内存在磁盘，无法删除。",
					"solution" : "请先删除VPC内的磁盘。"
				},
				"0005101007" : {
					"cause" : "VPC内存在虚拟机，无法删除。",
					"desc" : "VPC内存在虚拟机，无法删除。",
					"solution" : "请先删除VPC内的虚拟机。"
				},
				"0005101008" : {
					"cause" : "VPC内存在安全组，无法删除。",
					"desc" : "VPC内存在安全组，无法删除。",
					"solution" : "请先删除VPC内的安全组。"
				},
				"0005101010" : {
					"cause" : "IP带宽模板数量达到最大值128。",
					"desc" : "IP带宽模板数量达到最大值128。",
					"solution" : "IP带宽模板数量达到最大值128。"
				},
				"0005201001" : {
					"cause" : "缺乏必选参数.",
					"desc" : "缺乏必选参数.",
					"solution" : "请输入必选参数."
				},
				"0005201002" : {
					"cause" : "内部服务错误.",
					"desc" : "内部服务错误.",
					"solution" : "请联系系统管理员."
				},
				"0005201003" : {
					"cause" : "数据库错误.",
					"desc" : "数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"0005201004" : {
					"cause" : "脚本（软件/ISO）不存在.",
					"desc" : "脚本（软件/ISO）不存在.",
					"solution" : "请联系系统管理员."
				},
				"0005201005" : {
					"cause" : "脚本（软件/ISO）文件不存在或者查询失败.",
					"desc" : "脚本（软件/ISO）文件不存在或者查询失败.",
					"solution" : "请联系系统管理员."
				},
				"0005201006" : {
					"cause" : "脚本（软件/ISO）文件路径为空.",
					"desc" : "脚本（软件/ISO）文件路径为空.",
					"solution" : "请手动输入脚本（软件/ISO）文件的路径."
				},
				"0005201007" : {
					"cause" : "脚本（软件/ISO）文件的路径非法.",
					"desc" : "脚本（软件/ISO）文件的路径非法.",
					"solution" : "请输入合法的脚本（软件/ISO）文件路径."
				},
				"0005201008" : {
					"cause" : "脚本（软件/ISO）ID重复.",
					"desc" : "脚本（软件/ISO）ID重复.",
					"solution" : "请联系系统管理员."
				},
				"0005201009" : {
					"cause" : "脚本（软件/ISO）名称在数据库中已经存在.",
					"desc" : "脚本（软件/ISO）名称在数据库中已经存在.",
					"solution" : "请输入其他脚本名称."
				},
				"0005201010" : {
					"cause" : "脚本（软件/ISO）数量超出最大数量限制.",
					"desc" : "脚本（软件/ISO）数量超出最大数量限制.",
					"solution" : "请联系系统管理员."
				},
				"0005201011" : {
					"cause" : "脚本（软件/ISO）文件不存在或者移动失败.",
					"desc" : "脚本（软件/ISO）文件不存在或者移动失败.",
					"solution" : "请联系系统管理员."
				},
				"0005201012" : {
					"cause" : "输入了非法的每页显示数.",
					"desc" : "输入了非法的每页显示数.",
					"solution" : "请输入合法的每页显示数."
				},
				"0005201013" : {
					"cause" : "输入了非法的分页起始数.",
					"desc" : "输入了非法的分页起始数.",
					"solution" : "请输入合法的分页起始数."
				},
				"0005201014" : {
					"cause" : "资源被占用.",
					"desc" : "资源被占用.",
					"solution" : "请联系系统管理员."
				},
				"0005201015" : {
					"cause" : "脚本（软件/ISO）文件不存在或者删除失败.",
					"desc" : "脚本（软件/ISO）文件不存在或者删除失败.",
					"solution" : "请联系系统管理员."
				},
				"0005201016" : {
					"cause" : "资源已经存在.",
					"desc" : "资源已经存在.",
					"solution" : "请联系系统管理员."
				},
				"0005202001" : {
					"cause" : "缺少必选参数.",
					"desc" : "缺少必选参数.",
					"solution" : "请输入必选参数."
				},
				"0005202002" : {
					"cause" : "输入的参数不合法.",
					"desc" : "输入的参数不合法.",
					"solution" : "请输入合法参数."
				},
				"0005202003" : {
					"cause" : "查询数据库错误.",
					"desc" : "查询数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"0005202004" : {
					"cause" : "内部服务错误.",
					"desc" : "内部服务错误.",
					"solution" : "请联系系统管理员."
				},
				"0005203001" : {
					"cause" : "输入的参数错误.",
					"desc" : "输入的参数错误.",
					"solution" : "请输入合法参数."
				},
				"0005203002" : {
					"cause" : "用户无操作权限.",
					"desc" : "用户无操作权限.",
					"solution" : "请联系系统管理员."
				},
				"0005203003" : {
					"cause" : "VM 数据库异常.",
					"desc" : "VM 数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"0005203004" : {
					"cause" : "调用IRM失败.",
					"desc" : "调用IRM失败.",
					"solution" : "请联系系统管理员."
				},
				"0005203005" : {
					"cause" : "虚拟机模板不存在.",
					"desc" : "虚拟机模板不存在.",
					"solution" : "请联系系统管理员."
				},
				"0005203006" : {
					"cause" : "注册状态不能删除.",
					"desc" : "注册状态不能删除.",
					"solution" : "请联系系统管理员."
				},
				"0005203007" : {
					"cause" : "虚拟机模板正被其他用户锁定，操作不允许.",
					"desc" : "虚拟机模板正被其他用户锁定，操作不允许.",
					"solution" : "请联系系统管理员."
				},
				"0005203008" : {
					"cause" : "用户所在域与资源所在域不匹配，操作不允许.",
					"desc" : "用户所在域与资源所在域不匹配，操作不允许.",
					"solution" : "请联系系统管理员."
				},
				"0005203009" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203011" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203012" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203013" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203014" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203015" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203017" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203019" : {
					"cause" : "虚拟机创建失败，不能制作成模板",
					"desc" : "虚拟机创建失败，不能制作成模板",
					"solution" : "请删除创建失败的虚拟机模板并重新创建"
				},
				"0005203020" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203021" : {
					"cause" : "共享文件路径不可为空",
					"desc" : "共享文件路径不可为空",
					"solution" : "请填写文件路径"
				},
				"0005203023" : {
					"cause" : "启动虚拟机失败",
					"desc" : "启动虚拟机失败",
					"solution" : "请联系技术支持工程师"
				},
				"0005203024" : {
					"cause" : "只有创建完成的虚拟机模板才可以修改",
					"desc" : "只有创建完成的虚拟机模板才可以修改",
					"solution" : "请刷新页面后重试"
				},
				"0005203025" : {
					"cause" : "把模板转换为虚拟机时出错",
					"desc" : "把模板转换为虚拟机时出错",
					"solution" : "请稍后重试或联系管理员"
				},
				"0005203026" : {
					"cause" : "虚拟机模板已经被发布",
					"desc" : "虚拟机模板已经被发布",
					"solution" : "请刷新页面后重试"
				},
				"0005203029" : {
					"cause" : "不存在可用的资源集群，无法创建虚拟机模板",
					"desc" : "不存在可用的资源集群，无法创建虚拟机模板",
					"solution" : "请联系管理员添加资源集群"
				},
				"0005203030" : {
					"cause" : "模板未制作完成或修改失败，不允许发布",
					"desc" : "模板未制作完成或修改失败，不允许发布",
					"solution" : "请完成虚拟机模板的制作或修改"
				},
				"0005203031" : {
					"cause" : "虚拟机模板已经取消发布",
					"desc" : "虚拟机模板已经取消发布",
					"solution" : "请刷新页面后重试"
				},
				"0005203032" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"0005203033" : {
					"cause" : "虚拟机模板正在被应用模板使用，不允许取消发布",
					"desc" : "虚拟机模板正在被应用模板使用，不允许取消发布",
					"solution" : "请删除使用该虚拟机模板的应用模板后重试"
				},
				"0005203034" : {
					"cause" : "创建虚拟机模板失败，不允许挂载ISO文件",
					"desc" : "创建虚拟机模板失败，不允许挂载ISO文件",
					"solution" : "请删除该虚拟机模板重新创建"
				},
				"0005203035" : {
					"cause" : "模板制作完成时不允许挂载ISO文件",
					"desc" : "模板制作完成时不允许挂载ISO文件",
					"solution" : "请单击修改按钮进行虚拟机模板修改"
				},
				"0005203036" : {
					"cause" : "虚拟机模板已经发布时不允许挂载ISO文件",
					"desc" : "虚拟机模板已经发布时不允许挂载ISO文件",
					"solution" : "请取消发布后单击修改按钮进行虚拟机模板修改"
				},
				"0005203037" : {
					"cause" : "所选虚拟机不是由虚拟机模板创建，不能修复",
					"desc" : "所选虚拟机不是由虚拟机模板创建，不能修复",
					"solution" : "请联系技术支持工程师"
				},
				"0005203038" : {
					"cause" : "外部系统通信异常，如返回为空或字段不符等",
					"desc" : "外部系统通信异常，如返回为空或字段不符等",
					"solution" : "请联系管理员或查看帮助手册"
				},
				"0005203039" : {
					"cause" : "该虚拟机模板数据损坏或虚拟机模板不存在",
					"desc" : "该虚拟机模板数据损坏或虚拟机模板不存在",
					"solution" : "请删除此虚拟机模板"
				},
				"0005203040" : {
					"cause" : "虚拟机模板正在卸载ISO文件，不能执行挂载操作",
					"desc" : "虚拟机模板正在卸载ISO文件，不能执行挂载操作",
					"solution" : "请稍后重试"
				},
				"0005203041" : {
					"cause" : "已发布虚拟机模板个数已达到系统上限100个",
					"desc" : "已发布虚拟机模板个数已达到系统上限100个",
					"solution" : "请清理不需要且已经发布的虚拟机模板"
				},
				"0005203042" : {
					"cause" : "虚拟机模板正在用于创建虚拟机，不能进行该操作",
					"desc" : "虚拟机模板正在用于创建虚拟机，不能进行该操作",
					"solution" : "请稍后重试"
				},
				"0005203043" : {
					"cause" : "该虚拟机存在快照，无法转化为模板",
					"desc" : "该虚拟机存在快照，无法转化为模板",
					"solution" : "请删除该虚拟机的快照后重试"
				},
				"0005203044" : {
					"cause" : "虚拟机模板名称重复",
					"desc" : "虚拟机模板名称重复",
					"solution" : "请重新输入虚拟机模板名称"
				},
				"0005203045" : {
					"cause" : "只有未创建完成的虚拟机模板才能安装软件",
					"desc" : "只有未创建完成的虚拟机模板才能安装软件",
					"solution" : "请刷新后重试"
				},
				"0005203046" : {
					"cause" : "该虚拟机模板已经创建完成，不能进行该操作",
					"desc" : "该虚拟机模板已经创建完成，不能进行该操作",
					"solution" : "请联系管理员"
				},
				"0005203047" : {
					"cause" : "待修复虚拟机磁盘已经达到上限，不能修复",
					"desc" : "待修复虚拟机磁盘已经达到上限，不能修复",
					"solution" : "请联系技术支持工程师"
				},
				"0005203048" : {
					"cause" : "虚拟机状态冲突，只有运行中或已停止状态才能修复",
					"desc" : "虚拟机状态冲突，只有运行中或已停止状态才能修复",
					"solution" : "请确认虚拟机状态后再试"
				},
				"0005203049" : {
					"cause" : "系统资源不足",
					"desc" : "系统资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"0005203050" : {
					"cause" : "无法找到该虚拟机模板信息",
					"desc" : "无法找到该虚拟机模板信息",
					"solution" : "请联系技术支持工程师"
				},
				"0005203051" : {
					"cause" : "虚拟机模板正在被用于创建应用，不允许取消发布",
					"desc" : "虚拟机模板正在被用于创建应用，不允许取消发布",
					"solution" : "请稍后重试"
				},
				"0005203052" : {
					"cause" : "虚拟机已经为停止状态或休眠状态，不能执行该操作",
					"desc" : "虚拟机已经为停止状态或休眠状态，不能执行该操作",
					"solution" : "请联系技术支持工程师"
				},
				"0005203053" : {
					"cause" : "虚拟机正在执行此操作",
					"desc" : "虚拟机正在执行此操作",
					"solution" : "请联系技术支持工程师"
				},
				"0005203054" : {
					"cause" : "虚拟机正在休眠中",
					"desc" : "虚拟机正在休眠中",
					"solution" : "请联系技术支持工程师"
				},
				"0005203055" : {
					"cause" : "虚拟机为休眠状态，不能执行该操作",
					"desc" : "虚拟机为休眠状态，不能执行该操作",
					"solution" : "请启动该虚拟机后重试"
				},
				"0005203056" : {
					"cause" : "资源集群不存在",
					"desc" : "资源集群不存在",
					"solution" : "请重新选择资源集群"
				},
				"0005203057" : {
					"cause" : "没有匹配的虚拟机模板",
					"desc" : "没有匹配的虚拟机模板",
					"solution" : "请创建匹配的虚拟机模板"
				},
				"0005203058" : {
					"cause" : "桌面云模板用于创建桌面云虚拟机，不需要发布",
					"desc" : "桌面云模板用于创建桌面云虚拟机，不需要发布",
					"solution" : "请联系管理员"
				},
				"0005203059" : {
					"cause" : "虚拟机模板不是停止状态，不能发布",
					"desc" : "虚拟机模板不是停止状态，不能发布",
					"solution" : "请稍后重试或联系技术支持工程师"
				},
				"0005203060" : {
					"cause" : "虚拟机未转化为模板，不能发布",
					"desc" : "虚拟机未转化为模板，不能发布",
					"solution" : "请稍后重试或联系技术支持工程师"
				},
				"0005203061" : {
					"cause" : "虚拟机模板状态不允许修改",
					"desc" : "虚拟机模板状态不允许修改",
					"solution" : "请检查虚拟机模板状态"
				},
				"0005203062" : {
					"cause" : "策略不存在",
					"desc" : "策略不存在",
					"solution" : "请检查当前策略是否存在"
				},
				"0005203063" : {
					"cause" : "虚拟机模板正在发现中",
					"desc" : "虚拟机模板正在发现中",
					"solution" : "请联系技术支持工程师"
				},
				"0005203064" : {
					"cause" : "虚拟机模板已关联逻辑模板，不允许取消发布",
					"desc" : "虚拟机模板已关联逻辑模板，不允许取消发布",
					"solution" : "请去关联后重试"
				},
				"0005203065" : {
					"cause" : "虚拟机模板未发布，不允许关联逻辑模板",
					"desc" : "虚拟机模板未发布，不允许关联逻辑模板",
					"solution" : "请发布虚拟机模板后重试"
				},
				"0005203066" : {
					"cause" : "虚拟机模板已关联逻辑模板",
					"desc" : "虚拟机模板已关联逻辑模板",
					"solution" : "请去关联后重新关联逻辑模板"
				},
				"0005203067" : {
					"cause" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"desc" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"solution" : "请查看已关联的虚拟机模板"
				},
				"0005203068" : {
					"cause" : "虚拟机模板数量达到系统限定最大值",
					"desc" : "虚拟机模板数量达到系统限定最大值",
					"solution" : "删除不用的虚拟机模板，请慎重操作"
				},
				"0005203069" : {
					"cause" : "虚拟机模板不存在",
					"desc" : "虚拟机模板不存在",
					"solution" : "请联系技术支持工程师"
				},
				"0005203070" : {
					"cause" : "存在链接克隆虚拟机的模板不能转为虚拟机",
					"desc" : "存在链接克隆虚拟机的模板不能转为虚拟机",
					"solution" : "请选择其他虚拟机模板进行操作"
				},
				"0005203077" : {
					"cause" : "虚拟机模板已关联逻辑模板，删除失败",
					"desc" : "虚拟机模板已关联逻辑模板，删除失败",
					"solution" : "请取消关联，再进行删除"
				},
				"0005201030" : {
					"cause" : "用户ftp账户不存在，请尝试修改密码以触发创建",
					"desc" : "用户ftp账户不存在，请尝试修改密码以触发创建",
					"solution" : "请尝试修改密码已触发创建"
				},
				"1000002" : {
					"cause" : "数据库异常。",
					"desc" : "数据库异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000004" : {
					"cause" : "系统异常。",
					"desc" : "系统异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1000008" : {
					"cause" : "无权限",
					"desc" : "无权限",
					"solution" : "请联系系统管理员."
				},
				"1000010" : {
					"cause" : "参数非法。",
					"desc" : "参数非法。",
					"solution" : "请输入合法参数。"
				},
				"1000022" : {
					"cause" : "连接异常，请检查IP或者端口是否正确。",
					"desc" : "连接异常，请检查IP或者端口是否正确。",
					"solution" : "请检查IP地址是否正确和桌面服务系统是否正常。"
				},
				"1000700" : {
					"cause" : "网络通信异常。",
					"desc" : "网络通信异常。",
					"solution" : "请稍候重试。"
				},
				"1002005" : {
					"cause" : "虚拟机不存在。",
					"desc" : "虚拟机不存在。",
					"solution" : "请检查虚拟机是否存在再操作。"
				},
				"1002022" : {
					"cause" : "入参IP地址不合法。",
					"desc" : "入参IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002028" : {
					"cause" : "用户描述长度错误。",
					"desc" : "用户描述长度错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002054" : {
					"cause" : "域信息的IP地址不合法。",
					"desc" : "域信息的IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002062" : {
					"cause" : "角色描述非法。",
					"desc" : "角色描述非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002064" : {
					"cause" : "服务器IP地址不合法。",
					"desc" : "服务器IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002065" : {
					"cause" : "服务器IP地址已经存在。",
					"desc" : "服务器IP地址已经存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002066" : {
					"cause" : "BMC IP地址不合法。",
					"desc" : "BMC IP地址不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002073" : {
					"cause" : "BMC IP地址不可达。",
					"desc" : "BMC IP地址不可达。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002080" : {
					"cause" : "BMC IP地址为空。",
					"desc" : "BMC IP地址为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002132" : {
					"cause" : "快照任务正在进行中，单个虚拟机不能同时做多个快照。",
					"desc" : "快照任务正在进行中，单个虚拟机不能同时做多个快照。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002134" : {
					"cause" : "目标节点/资源集群不能满足虚拟机运行的网络条件。",
					"desc" : "目标节点/资源集群不能满足虚拟机运行的网络条件。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002147" : {
					"cause" : "指定位置下不存在网络条件满足虚拟机启动的节点。",
					"desc" : "指定位置下不存在网络条件满足虚拟机启动的节点。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002151" : {
					"cause" : "目的节点存储或网络不支持虚拟机运行。",
					"desc" : "目的节点存储或网络不支持虚拟机运行。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002166" : {
					"cause" : "存储IP地址正在使用中。",
					"desc" : "存储IP地址正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002177" : {
					"cause" : "VLAN ID不合法。",
					"desc" : "VLAN ID不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002183" : {
					"cause" : "保留IP不能包含网关。",
					"desc" : "保留IP不能包含网关。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002184" : {
					"cause" : "子网预留IP地址段有重叠。",
					"desc" : "子网预留IP地址段有重叠。",
					"solution" : "请确保子网保留IP地址段没有重叠。"
				},
				"1002185" : {
					"cause" : "预留IP地址段有重叠。",
					"desc" : "预留IP地址段有重叠。",
					"solution" : "请确保保留IP地址段没有重叠。"
				},
				"1002186" : {
					"cause" : "DHCP服务器的首选DNS服务器不合法。",
					"desc" : "DHCP服务器的首选DNS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002187" : {
					"cause" : "DHCP服务器的备用DNS服务器不合法。",
					"desc" : "DHCP服务器的备用DNS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002189" : {
					"cause" : "DHCP服务器的域名不合法。",
					"desc" : "DHCP服务器的域名不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002191" : {
					"cause" : "DHCP服务器的首选WINS服务器不合法。",
					"desc" : "DHCP服务器的首选WINS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002192" : {
					"cause" : "DHCP服务器的备用WINS服务器不合法。",
					"desc" : "DHCP服务器的备用WINS服务器不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002193" : {
					"cause" : "保留IP地址段结束地址不能小于起始地址。",
					"desc" : "保留IP地址段结束地址不能小于起始地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002194" : {
					"cause" : "保留IP必须在子网的范围内。",
					"desc" : "保留IP必须在子网的范围内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002198" : {
					"cause" : "VLAN池不能为空。",
					"desc" : "VLAN池不能为空。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002200" : {
					"cause" : "VLAN ID取值范围是2～4094。",
					"desc" : "VLAN ID取值范围是2～4094。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002202" : {
					"cause" : "起始VLAN ID小于结束VLAN ID。",
					"desc" : "起始VLAN ID小于结束VLAN ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002203" : {
					"cause" : "起始VLAN ID要小于等于结束VLAN ID。",
					"desc" : "起始VLAN ID要小于等于结束VLAN ID。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002205" : {
					"cause" : "VLAN池之间不能重叠。",
					"desc" : "VLAN池之间不能重叠。",
					"solution" : "请确保VLAN池之间没有重叠。"
				},
				"1002215" : {
					"cause" : "VLAN池不存在。",
					"desc" : "VLAN池不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002216" : {
					"cause" : "VLAN池被使用。",
					"desc" : "VLAN池被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002222" : {
					"cause" : "子网ID和VLAN ID只能二选一。",
					"desc" : "子网ID和VLAN ID只能二选一。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002224" : {
					"cause" : "VLAN在VLAN池内不存在。",
					"desc" : "VLAN在VLAN池内不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002225" : {
					"cause" : "端口组选择的子网对应VLAN不在VLAN池内。",
					"desc" : "端口组选择的子网对应VLAN不在VLAN池内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002229" : {
					"cause" : "该网络内有虚拟机，无法删除。",
					"desc" : "该网络内有虚拟机，无法删除。",
					"solution" : "请先删除该路由网络下的虚拟机，然后再试。"
				},
				"1002243" : {
					"cause" : "上行端口聚合的描述不合法。",
					"desc" : "上行端口聚合的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002256" : {
					"cause" : "VLAN ID冲突。",
					"desc" : "VLAN ID冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002267" : {
					"cause" : "虚拟机交换机描述不合法。",
					"desc" : "虚拟机交换机描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002268" : {
					"cause" : "端口组描述不合法。",
					"desc" : "端口组描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002269" : {
					"cause" : "子网的描述不合法。",
					"desc" : "子网的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002270" : {
					"cause" : "系统平面描述不合法。",
					"desc" : "系统平面描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002271" : {
					"cause" : "上行端口的描述不合法。",
					"desc" : "上行端口的描述不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002317" : {
					"cause" : "保留IP地址已被分配。",
					"desc" : "保留IP地址已被分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002318" : {
					"cause" : "网关IP地址已被使用。",
					"desc" : "网关IP地址已被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002319" : {
					"cause" : "IP地址和掩码不匹配。",
					"desc" : "IP地址和掩码不匹配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002320" : {
					"cause" : "子网内可用IP地址不足。",
					"desc" : "子网内可用IP地址不足。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002322" : {
					"cause" : "VLAN池数量达到上限。",
					"desc" : "VLAN池数量达到上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002326" : {
					"cause" : "网口映射参数不合法。",
					"desc" : "网口映射参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002340" : {
					"cause" : "子网地址和网关不在同一网段。",
					"desc" : "子网地址和网关不在同一网段。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002345" : {
					"cause" : "创建磁盘失败。",
					"desc" : "创建磁盘失败。",
					"solution" : "可能由网络、SAN设备异常或数据存储剩余容量不足导致，请排查。"
				},
				"1002346" : {
					"cause" : "VRM初始化网络失败。",
					"desc" : "VRM初始化网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002359" : {
					"cause" : "虚拟机各网卡所属portgroup需要位于同一DVSwitch下。",
					"desc" : "虚拟机各网卡所属portgroup需要位于同一DVSwitch下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002408" : {
					"cause" : "ip或者掩码非法。",
					"desc" : "ip或者掩码非法。",
					"solution" : "请使用合法的信息进行设置。"
				},
				"1002461" : {
					"cause" : "磁盘迁移失败，可能由迁移过程中虚拟机状态发生变化、主机状态变化或者网络异常导致。",
					"desc" : "磁盘迁移失败，可能由迁移过程中虚拟机状态发生变化、主机状态变化或者网络异常导致。",
					"solution" : "请联系技术支持工程师。"
				},
				"1002503" : {
					"cause" : "内存热插立即生效的内存值必须为1024M的整数倍。",
					"desc" : "内存热插立即生效的内存值必须为1024M的整数倍。",
					"solution" : "内存热插立即生效的内存值必须为1024M的整数倍。请重新设置内存值。"
				},
				"1003000" : {
					"cause" : "VLAN ID不在1～4096之间。",
					"desc" : "VLAN ID不在1～4096之间。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003001" : {
					"cause" : "IP地址格式不合法（A.B.C.D（0～255））、结束地址小于开始地址、地址范围非法。",
					"desc" : "IP地址格式不合法（A.B.C.D（0～255））、结束地址小于开始地址、地址范围非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003003" : {
					"cause" : "由IPV4子网和IPV4前缀生成的网关不合法。",
					"desc" : "由IPV4子网和IPV4前缀生成的网关不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003004" : {
					"cause" : "IP地址与已添加的地址重叠。",
					"desc" : "IP地址与已添加的地址重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003011" : {
					"cause" : "IP地址池名词不存在。",
					"desc" : "IP地址池名词不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003012" : {
					"cause" : "IP地址池类型错误（非外部）。",
					"desc" : "IP地址池类型错误（非外部）。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003013" : {
					"cause" : "部署IP地址池失败。",
					"desc" : "部署IP地址池失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003014" : {
					"cause" : "IP地址池正在使用。",
					"desc" : "IP地址池正在使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003018" : {
					"cause" : "划分VLAN失败。",
					"desc" : "划分VLAN失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003021" : {
					"cause" : "配置SAN设备地址和网络失败。",
					"desc" : "配置SAN设备地址和网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003022" : {
					"cause" : "VLAN池参数内容VLAN区域冲突。",
					"desc" : "VLAN池参数内容VLAN区域冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003023" : {
					"cause" : "VLAN正在使用中。",
					"desc" : "VLAN正在使用中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003024" : {
					"cause" : "vlanIf冲突。",
					"desc" : "vlanIf冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003026" : {
					"cause" : "配置的子网在VLAN池中。",
					"desc" : "配置的子网在VLAN池中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003034" : {
					"cause" : "VLAN已经被使用。",
					"desc" : "VLAN已经被使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003039" : {
					"cause" : "操作失败，该防火墙不存在。",
					"desc" : "操作失败，该防火墙不存在。",
					"solution" : "请刷新设备列表。"
				},
				"1003040" : {
					"cause" : "起始/终止IP地址不在可用范围之内。可用IP地址是：网段内除第一个IP地址（预留网段地址），最后一个IP 地址（预留广播地址）之外的IP地址。",
					"desc" : "起始/终止IP地址不在可用范围之内。可用IP地址是：网段内除第一个IP地址（预留网段地址），最后一个IP 地址（预留广播地址）之外的IP地址。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1003043" : {
					"cause" : "防火墙状态不允许该操作，请稍后重试。",
					"desc" : "防火墙状态不允许该操作，请稍后重试。",
					"solution" : "防火墙状态不允许该操作，请稍后重试。"
				},
				"1003044" : {
					"cause" : "虚拟防火墙不存在。",
					"desc" : "虚拟防火墙不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1003045" : {
					"cause" : "已配置了路由业务。",
					"desc" : "已配置了路由业务。",
					"solution" : "请删除路由业务。"
				},
				"1003050" : {
					"cause" : "结束IP地址小于起始IP地址。",
					"desc" : "结束IP地址小于起始IP地址。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003051" : {
					"cause" : "IP地址池正在创建中，不能更新。",
					"desc" : "IP地址池正在创建中，不能更新。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003052" : {
					"cause" : "IP地址池正在删除中，不能更新。",
					"desc" : "IP地址池正在删除中，不能更新。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003053" : {
					"cause" : "修改后的IP个数小于当前的使用个数。",
					"desc" : "修改后的IP个数小于当前的使用个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1003056" : {
					"cause" : "防火墙状态异常。",
					"desc" : "防火墙状态异常。",
					"solution" : "请查看防火墙连接参数。"
				},
				"1003057" : {
					"cause" : "物理防火墙上创建有虚拟防火墙，无法删除。",
					"desc" : "物理防火墙上创建有虚拟防火墙，无法删除。",
					"solution" : "请查看物理防火墙上是否有未删除的虚拟防火墙。"
				},
				"1003058" : {
					"cause" : "配置信息不存在。",
					"desc" : "配置信息不存在。",
					"solution" : "请检查防火墙的配置信息。"
				},
				"1005000" : {
					"cause" : "名称重复",
					"desc" : "名称重复",
					"solution" : "请检查名称"
				},
				"1010055" : {
					"cause" : "设备IP无法连接。",
					"desc" : "设备IP无法连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010058" : {
					"cause" : "设备重复接入，IP或者MAC地址已存在。",
					"desc" : "设备重复接入，IP或者MAC地址已存在。",
					"solution" : "请检查设备是否已接入。"
				},
				"1010060" : {
					"cause" : "BMC IP无法连接。",
					"desc" : "BMC IP无法连接。",
					"solution" : "请检查参数。"
				},
				"1010072" : {
					"cause" : "主机未上电、管理ip不可达、管理密码错误或管理板连接异常。",
					"desc" : "主机未上电、管理ip不可达、管理密码错误或管理板连接异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010077" : {
					"cause" : "密码错误或者设备IP不可达。",
					"desc" : "密码错误或者设备IP不可达。",
					"solution" : "请联系技术支持工程师。"
				},
				"1010078" : {
					"cause" : "网络异常。",
					"desc" : "网络异常。",
					"solution" : "请稍候重试。"
				},
				"1010085" : {
					"cause" : "BMC IP冲突。",
					"desc" : "BMC IP冲突。",
					"solution" : "请重新输入BMC IP。"
				},
				"1010086" : {
					"cause" : "OS IP冲突。",
					"desc" : "OS IP冲突。",
					"solution" : "请重新输入OS IP。"
				},
				"1010087" : {
					"cause" : "位置信息重复(存在相同机房、机架、机框号的设备，或存在相同槽位号的交换板)。",
					"desc" : "位置信息重复(存在相同机房、机架、机框号的设备，或存在相同槽位号的交换板)。",
					"solution" : "请重新输入位置信息。"
				},
				"1010101" : {
					"cause" : "IP:{0}不在子网:{1}内。",
					"desc" : "IP:{0}不在子网:{1}内。",
					"solution" : "请重新输入IP。"
				},
				"1010102" : {
					"cause" : "IP:{0}已被主机:{1}使用。",
					"desc" : "IP:{0}已被主机:{1}使用。",
					"solution" : "请重新输入IP。"
				},
				"1010103" : {
					"cause" : "IP:{0}已被占用。",
					"desc" : "IP:{0}已被占用。",
					"solution" : "请重新输入IP。"
				},
				"1010104" : {
					"cause" : "子网[{0}]中的主机IP修改失败。",
					"desc" : "子网[{0}]中的主机IP修改失败。",
					"solution" : "请重新修改。"
				},
				"1011090" : {
					"cause" : "设置SNMP Trap失败",
					"desc" : "设置SNMP Trap失败",
					"solution" : "请联系技术支持工程师"
				},
				"1020009" : {
					"cause" : "IP地址非法。",
					"desc" : "IP地址非法。",
					"solution" : "请填写合法的IP地址。"
				},
				"1020018" : {
					"cause" : "VLAN ID与系统保留VLAN ID冲突。",
					"desc" : "VLAN ID与系统保留VLAN ID冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020026" : {
					"cause" : "配置上行端口VLAN、IP地址失败。",
					"desc" : "配置上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020027" : {
					"cause" : "删除上行端口VLAN、IP地址失败。",
					"desc" : "删除上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020028" : {
					"cause" : "修改上行端口VLAN、IP地址失败。",
					"desc" : "修改上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020029" : {
					"cause" : "查询上行端口VLAN、IP地址失败。",
					"desc" : "查询上行端口VLAN、IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1020030" : {
					"cause" : "网关的IP地址和指定的IP地址不在同一网段。",
					"desc" : "网关的IP地址和指定的IP地址不在同一网段。",
					"solution" : "请输入合法的网关或者IP地址。"
				},
				"1020034" : {
					"cause" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。",
					"desc" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。",
					"solution" : "VLAN ID在VLAN池中不存在，请先创建包含该VLAN ID的VLAN池。"
				},
				"1020037" : {
					"cause" : "以127开头的IP地址无效，该地址保留给环回地址使用，请指定介于1和223间的其他某个有效值。",
					"desc" : "以127开头的IP地址无效，该地址保留给环回地址使用，请指定介于1和223间的其他某个有效值。",
					"solution" : "请指定开头介于1和223间的其他某个有效值。"
				},
				"1020039" : {
					"cause" : "不允许输入网络地址或广播地址。",
					"desc" : "不允许输入网络地址或广播地址。",
					"solution" : "请填写合法的IP地址。"
				},
				"1020050" : {
					"cause" : "资源分区下没有接入交换机。",
					"desc" : "资源分区下没有接入交换机。",
					"solution" : "请先接入交换机然后再试。"
				},
				"1020051" : {
					"cause" : "VLAN ID与网络资源池中的VLAN池中VLAN ID有冲突。",
					"desc" : "VLAN ID与网络资源池中的VLAN池中VLAN ID有冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020052" : {
					"cause" : "VLAN ID与网络资源池中的子网中的VLAN ID有冲突。",
					"desc" : "VLAN ID与网络资源池中的子网中的VLAN ID有冲突。",
					"solution" : "请填写合法的VLAN ID。"
				},
				"1020055" : {
					"cause" : "登陆SAN设备失败。",
					"desc" : "登陆SAN设备失败。",
					"solution" : "请检查连接参数是否正常。"
				},
				"1040004" : {
					"cause" : "网络不允许为空",
					"desc" : "网络不允许为空",
					"solution" : "请至少选择一个子网或者一个VLAN。"
				},
				"1040016" : {
					"cause" : "系统与UHM无法连接",
					"desc" : "系统与UHM无法连接",
					"solution" : "请联系系统管理员"
				},
				"1040034" : {
					"cause" : "资源集群下有关联的网络存在，删除失败。",
					"desc" : "资源集群下有关联的网络存在，删除失败。",
					"solution" : "请先删除端口组。"
				},
				"1040046" : {
					"cause" : "裸机BMC IP池不存在，无法创建裸机资源集群。",
					"desc" : "裸机BMC IP池不存在，无法创建裸机资源集群。",
					"solution" : "请先配置裸机BMC IP池，然后再进行创建裸机集群操作。"
				},
				"1040054" : {
					"cause" : "存在Vlan池已经被端口组使用，减容失败。",
					"desc" : "存在Vlan池已经被端口组使用，减容失败。",
					"solution" : "减容Vlan之前请校验是否已经被端口组使用。"
				},
				"1040068" : {
					"cause" : "子网{0}的VLAN号与子网{1}的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与子网{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040069" : {
					"cause" : "VLAN池{0}的VLAN号与子网{1}的VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与子网{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040070" : {
					"cause" : "子网{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040071" : {
					"cause" : "VLAN池{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与VLAN池{1}的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040072" : {
					"cause" : "子网{0}的IP段与子网{1}的IP段冲突。",
					"desc" : "子网{0}的IP段与子网{1}的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040073" : {
					"cause" : "子网{0}的IP段与系统的内部子网IP段冲突。",
					"desc" : "子网{0}的IP段与系统的内部子网IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040074" : {
					"cause" : "子网{0}的IP段与系统的BMC IP池的IP段冲突。",
					"desc" : "子网{0}的IP段与系统的BMC IP池的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040075" : {
					"cause" : "子网{0}的VLAN号与系统的BMC IP池的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的BMC IP池的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040076" : {
					"cause" : "VLAN池{0}的VLAN号与系统的BMC IP池VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与系统的BMC IP池VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040077" : {
					"cause" : "子网{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040078" : {
					"cause" : "VLAN池{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"desc" : "VLAN池{0}的VLAN号与系统的内部子网VLAN号冲突。",
					"solution" : "请重新选择不冲突的的VLAN池。"
				},
				"1040083" : {
					"cause" : "子网{0}的IP段与系统的汇聚交换机的IP段冲突。",
					"desc" : "子网{0}的IP段与系统的汇聚交换机的IP段冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040084" : {
					"cause" : "子网{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"desc" : "子网{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040085" : {
					"cause" : "VLAN{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"desc" : "VLAN{0}的VLAN号与系统的汇聚交换机的VLAN号冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040086" : {
					"cause" : "汇聚交换机的IP与系统子网IP冲突。",
					"desc" : "汇聚交换机的IP与系统子网IP冲突。",
					"solution" : "请重新选择不冲突的的子网。"
				},
				"1040123" : {
					"cause" : "配置管理网络失败。",
					"desc" : "配置管理网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040124" : {
					"cause" : "分配可用的管理IP失败。",
					"desc" : "分配可用的管理IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1040138" : {
					"cause" : "该资源集群下正在进行网络的创建、修改或删除，无法进行此操作。",
					"desc" : "该资源集群下正在进行网络的创建、修改或删除，无法进行此操作。",
					"solution" : "请稍后重试。"
				},
				"1040146" : {
					"cause" : "有多个主机开启了opensm。",
					"desc" : "有多个主机开启了opensm。",
					"solution" : "请选择单个主机减容。"
				},
				"1050002" : {
					"cause" : "子网ID和VLAN ID有且只能有一个有值。",
					"desc" : "子网ID和VLAN ID有且只能有一个有值。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050004" : {
					"cause" : "无效的VLAN ID。",
					"desc" : "无效的VLAN ID。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050007" : {
					"cause" : "无效的端口组描述。",
					"desc" : "无效的端口组描述。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050013" : {
					"cause" : "端口组列表中的子网或VLAN不属于同一个资源集群。",
					"desc" : "端口组列表中的子网或VLAN不属于同一个资源集群。",
					"solution" : "请选择同一个资源集群下的端口组。"
				},
				"1050016" : {
					"cause" : "VLAN类型不能修改为子网类型。",
					"desc" : "VLAN类型不能修改为子网类型。",
					"solution" : "请不要禁用JavaScript或者试图绕过前台校验。"
				},
				"1050017" : {
					"cause" : "DVS不存在。",
					"desc" : "DVS不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050022" : {
					"cause" : "DVS没有关联VLAN Pool。",
					"desc" : "DVS没有关联VLAN Pool。",
					"solution" : "请联系技术支持工程师。"
				},
				"1050027" : {
					"cause" : "所选DVS下VLAN ID 重复。",
					"desc" : "所选DVS下VLAN ID 重复。",
					"solution" : "请选其他VLAN ID。"
				},
				"1050042" : {
					"cause" : "关联dvs失败。",
					"desc" : "关联dvs失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060006" : {
					"cause" : "无效的SAN设备序列号。",
					"desc" : "无效的SAN设备序列号。",
					"solution" : "请联系技术支持工程师。"
				},
				"1060008" : {
					"cause" : "存储描述信息太长。",
					"desc" : "存储描述信息太长。",
					"solution" : "请填写合适的描述信息长度。"
				},
				"1060139" : {
					"cause" : "存储IP不允许重复。",
					"desc" : "存储IP不允许重复。",
					"solution" : "请输入没有重复的存储IP。"
				},
				"1060140" : {
					"cause" : "存储IP或端口参数不合法。",
					"desc" : "存储IP或端口参数不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070025" : {
					"cause" : "虚拟机已被冻结。",
					"desc" : "虚拟机已被冻结。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070077" : {
					"cause" : "虚拟机不存在该网卡，无法进行此操作。",
					"desc" : "虚拟机不存在该网卡，无法进行此操作。",
					"solution" : "请选择合适的网卡进行操作。"
				},
				"1070080" : {
					"cause" : "快照任务正在进行中，单个虚拟机不能同时操作多个快照任务。",
					"desc" : "快照任务正在进行中，单个虚拟机不能同时操作多个快照任务。",
					"solution" : "请等进行中的快照任务完成后再开始另一个快照任务。"
				},
				"1070098" : {
					"cause" : "主机已断开连接，无法与之进行通信。",
					"desc" : "主机已断开连接，无法与之进行通信。",
					"solution" : "请检查主机状态是否正常，或联系技术支持工程师。"
				},
				"1070108" : {
					"cause" : "虚拟机的网络配置不允许执行该操作。",
					"desc" : "虚拟机的网络配置不允许执行该操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070112" : {
					"cause" : "虚拟机和选择的网络不在相同的集群下。",
					"desc" : "虚拟机和选择的网络不在相同的集群下。",
					"solution" : "请选择其它网络重新操作。"
				},
				"1070113" : {
					"cause" : "虚拟机网卡绑定了弹性IP，不能删除和修改。",
					"desc" : "虚拟机网卡绑定了弹性IP，不能删除和修改。",
					"solution" : "请解绑定后重试。"
				},
				"1070114" : {
					"cause" : "虚拟机有网卡绑定了弹性IP.",
					"desc" : "虚拟机有网卡绑定了弹性IP.",
					"solution" : "请将弹性IP解绑后再进行该操作."
				},
				"10700115" : {
					"cause" : "虚拟机有网卡设置了DNAT.",
					"desc" : "虚拟机有网卡设置了DNAT.",
					"solution" : "请将DNAT删除后再进行该操作."
				},
				"10700116" : {
					"cause" : "虚拟机有网卡在安全组中.",
					"desc" : "虚拟机有网卡在安全组中.",
					"solution" : "请将网卡从安全组中退出再进行该操作."
				},
				"1070118" : {
					"cause" : "iNIC网卡不允许在线增加。",
					"desc" : "iNIC网卡不允许在线增加。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070119" : {
					"cause" : "iNIC网卡不允许在线删除。",
					"desc" : "iNIC网卡不允许在线删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070124" : {
					"cause" : "网络ID或者VPC ID与虚拟机的网络不一致。",
					"desc" : "网络ID或者VPC ID与虚拟机的网络不一致。",
					"solution" : "确保输入的网络ID或VPC ID是有效的。"
				},
				"1070213" : {
					"cause" : "分配ip地址失败。",
					"desc" : "分配ip地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1070228" : {
					"cause" : "该虚拟机上未安装VSS插件。",
					"desc" : "该虚拟机上未安装VSS插件。",
					"solution" : "请在虚拟机上安装VSS插件。"
				},
				"1070547" : {
					"cause" : "准备网络失败。",
					"desc" : "准备网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1075048" : {
					"cause" : "虚拟机没有网卡，无法设置为网络启动。",
					"desc" : "虚拟机没有网卡，无法设置为网络启动。",
					"solution" : "请选择合适的启动方式。"
				},
				"1080002" : {
					"cause" : "保留IP地址段结束地址小于起始地址。",
					"desc" : "保留IP地址段结束地址小于起始地址。",
					"solution" : "请确保保留IP段的结束地址不小于起始地址。"
				},
				"1080003" : {
					"cause" : "保留IP段的起始IP地址或结束IP地址不在子网内。",
					"desc" : "保留IP段的起始IP地址或结束IP地址不在子网内。",
					"solution" : "请输入正确的保留IP段信息。"
				},
				"1080006" : {
					"cause" : "不能指定已被使用的VLAN ID。",
					"desc" : "不能指定已被使用的VLAN ID。",
					"solution" : "请分配没有被使用的VLAN ID。"
				},
				"1080011" : {
					"cause" : "当前子网已经被外部网络或组织内部网络使用，删除失败。",
					"desc" : "当前子网已经被外部网络或组织内部网络使用，删除失败。",
					"solution" : "请查看子网是否被某个资源集群使用。"
				},
				"1080012" : {
					"cause" : "当前子网已经被网络使用，修改失败。",
					"desc" : "当前子网已经被网络使用，修改失败。",
					"solution" : "请查看子网是否被某个网络使用。"
				},
				"1080014" : {
					"cause" : "DHCP服务IP地址不合法。",
					"desc" : "DHCP服务IP地址不合法。",
					"solution" : "请输入正确的DHCP信息。"
				},
				"1080016" : {
					"cause" : "VLAN ID已经被使用。",
					"desc" : "VLAN ID已经被使用。",
					"solution" : "请输入正确的VLAN ID。"
				},
				"1080019" : {
					"cause" : "主DNS服务器IP地址不合法。",
					"desc" : "主DNS服务器IP地址不合法。",
					"solution" : "请输入正确的DNS信息。"
				},
				"1080020" : {
					"cause" : "备DNS服务器IP地址不合法。",
					"desc" : "备DNS服务器IP地址不合法。",
					"solution" : "请输入正确的DNS信息。"
				},
				"1080021" : {
					"cause" : "主WINS服务器IP地址不合法。",
					"desc" : "主WINS服务器IP地址不合法。",
					"solution" : "请输入正确的WINS信息。"
				},
				"1080022" : {
					"cause" : "备WINS服务器IP地址不合法。",
					"desc" : "备WINS服务器IP地址不合法。",
					"solution" : "请输入正确的WINS信息。"
				},
				"1080023" : {
					"cause" : "修改管理子网中，没有足够IP地址分配。",
					"desc" : "修改管理子网中，没有足够IP地址分配。",
					"solution" : "请输入更大的子网网段。"
				},
				"1080026" : {
					"cause" : "管理子网分配IP地址失败。",
					"desc" : "管理子网分配IP地址失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080029" : {
					"cause" : "修改IP地址操作的参数检查失败。",
					"desc" : "修改IP地址操作的参数检查失败。",
					"solution" : "请检查输入参数是否正确。"
				},
				"1080030" : {
					"cause" : "修改IP地址操作的IP地址参数无效。",
					"desc" : "修改IP地址操作的IP地址参数无效。",
					"solution" : "请检查输入IP参数是否有效。"
				},
				"1080031" : {
					"cause" : "修改IP地址操作的掩码参数无效，不能大于24位。",
					"desc" : "修改IP地址操作的掩码参数无效，不能大于24位。",
					"solution" : "请检查输入掩码参数是否有效或者是否大于24位。"
				},
				"1080032" : {
					"cause" : "修改IP地址操作的网关参数无效。",
					"desc" : "修改IP地址操作的网关参数无效。",
					"solution" : "请检查输入网关参数是否有效。"
				},
				"1080033" : {
					"cause" : "修改IP地址操作的VLAN参数无效。",
					"desc" : "修改IP地址操作的VLAN参数无效。",
					"solution" : "请检查输入VLAN参数是否有效。"
				},
				"1080034" : {
					"cause" : "指定的IP地址与网关IP地址冲突。",
					"desc" : "指定的IP地址与网关IP地址冲突。",
					"solution" : "请确保指定的IP地址与网关IP地址是否在同一网段。"
				},
				"1080035" : {
					"cause" : "保留IP地址操作失败。",
					"desc" : "保留IP地址操作失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080037" : {
					"cause" : "获取云管理IP失败。",
					"desc" : "获取云管理IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080038" : {
					"cause" : "更新管理IP地址记录失败。",
					"desc" : "更新管理IP地址记录失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080044" : {
					"cause" : "输入的保留IP段地址范围有重叠。",
					"desc" : "输入的保留IP段地址范围有重叠。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080045" : {
					"cause" : "保留IP总个数超过128个。",
					"desc" : "保留IP总个数超过128个。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080046" : {
					"cause" : "保留IP段的起始IP地址或结束IP地址为空。",
					"desc" : "保留IP段的起始IP地址或结束IP地址为空。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080047" : {
					"cause" : "子网IP和掩码的与运算结果必须和子网IP相等。",
					"desc" : "子网IP和掩码的与运算结果必须和子网IP相等。",
					"solution" : "请输入正确的保留IP段范围。"
				},
				"1080048" : {
					"cause" : "该子网已经被集群使用，不允许删除。",
					"desc" : "该子网已经被集群使用，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080049" : {
					"cause" : "子网已经分配了4096个IP，超出了系统的能力。",
					"desc" : "子网已经分配了4096个IP，超出了系统的能力。",
					"solution" : "请重新选择网络。"
				},
				"1080050" : {
					"cause" : "子网中没有可用的IP。",
					"desc" : "子网中没有可用的IP。",
					"solution" : "请重新选择网络。"
				},
				"1080051" : {
					"cause" : "子网中可用IP数量不足。",
					"desc" : "子网中可用IP数量不足。",
					"solution" : "请重新选择网络。"
				},
				"1080052" : {
					"cause" : "当前网络的子网与VPC下其他网络的子网重叠。",
					"desc" : "当前网络的子网与VPC下其他网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080053" : {
					"cause" : "子网内没有可用IP，预留IP已经将子网占满。",
					"desc" : "子网内没有可用IP，预留IP已经将子网占满。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080054" : {
					"cause" : "当前网络的子网与VPN下远端用户网络的子网重叠。",
					"desc" : "当前网络的子网与VPN下远端用户网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080055" : {
					"cause" : "当前网络的子网与VSA网络的子网重叠。",
					"desc" : "当前网络的子网与VSA网络的子网重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080056" : {
					"cause" : "子网所在网段已经被外部网络或者DHCP服务器使用。",
					"desc" : "子网所在网段已经被外部网络或者DHCP服务器使用。",
					"solution" : ""
				},
				"1080057" : {
					"cause" : "子网所在网段已经被物理管理网络使用。",
					"desc" : "子网所在网段已经被物理管理网络使用。",
					"solution" : ""
				},
				"1080058" : {
					"cause" : "子网所在网段已经被业务安装网络使用。",
					"desc" : "子网所在网段已经被业务安装网络使用。",
					"solution" : ""
				},
				"1080059" : {
					"cause" : "保留IP段中包含已经分配出去的IP。",
					"desc" : "保留IP段中包含已经分配出去的IP。",
					"solution" : ""
				},
				"1080061" : {
					"cause" : "私有IP已被分配。",
					"desc" : "私有IP已被分配。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080062" : {
					"cause" : "指定的私有IP不在子网中。",
					"desc" : "指定的私有IP不在子网中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080063" : {
					"cause" : "网络中没有需要修复的IP。",
					"desc" : "网络中没有需要修复的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080064" : {
					"cause" : "指定的私有IP已被系统保留或在保留的IP段内。",
					"desc" : "指定的私有IP已被系统保留或在保留的IP段内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080067" : {
					"cause" : "只有静态注入或内部dhcp类型的子网才能指定IP。",
					"desc" : "只有静态注入或内部dhcp类型的子网才能指定IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080068" : {
					"cause" : "指定IP预占时，指定的私有IP在保留IP段中。",
					"desc" : "指定IP预占时，指定的私有IP在保留IP段中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1080101" : {
					"cause" : "可用IP段中包含了FM的浮动IP或管理IP。",
					"desc" : "可用IP段中包含了FM的浮动IP或管理IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1082000" : {
					"cause" : "可用管理IP地址段范围有重叠",
					"desc" : "可用管理IP地址段范围有重叠",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082001" : {
					"cause" : "可用管理IP地址段和网关冲突",
					"desc" : "可用管理IP地址段和网关冲突",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"10820010" : {
					"cause" : "选择的多个网络冲突。",
					"desc" : "选择的多个网络冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1082002" : {
					"cause" : "可用管理IP地址段内IP超过最大个数10000",
					"desc" : "可用管理IP地址段内IP超过最大个数10000",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082003" : {
					"cause" : "校验IP不在可用管理IP地址段内",
					"desc" : "校验IP不在可用管理IP地址段内",
					"solution" : "请确认GM IP在可用管理IP地址段内。"
				},
				"1082004" : {
					"cause" : "更新可用管理IP地址段信息异常",
					"desc" : "更新可用管理IP地址段信息异常",
					"solution" : "请联系技术支持工程师。"
				},
				"1082005" : {
					"cause" : "可用管理IP地址段内IP数量不够",
					"desc" : "可用管理IP地址段内IP数量不够",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082006" : {
					"cause" : "可用管理IP地址段不在管理子网内",
					"desc" : "可用管理IP地址段不在管理子网内",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082007" : {
					"cause" : "可用管理IP地址段与VDI预留IP冲突",
					"desc" : "可用管理IP地址段与VDI预留IP冲突",
					"solution" : "请输入正确的可用管理IP地址段。"
				},
				"1082008" : {
					"cause" : "网关与VDI预留IP冲突",
					"desc" : "网关与VDI预留IP冲突",
					"solution" : "请确认网关不在VDI预留IP内。"
				},
				"1083003" : {
					"cause" : "起始结束IP地址不在网段中。",
					"desc" : "起始结束IP地址不在网段中。",
					"solution" : "起始结束IP不在网段中。"
				},
				"1083004" : {
					"cause" : "起始IP地址大于结束IP地址。",
					"desc" : "起始IP地址大于结束IP地址。",
					"solution" : "起始IP必须小于等于结束IP。"
				},
				"1083006" : {
					"cause" : "设置GMN外部IP失败。",
					"desc" : "设置GMN外部IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1083007" : {
					"cause" : "未配置组网模式，不能修改管理子网。",
					"desc" : "未配置组网模式，不能修改管理子网。",
					"solution" : "修改管理子网前，请先配置组网模式。"
				},
				"1089998" : {
					"cause" : "当前系统存在子网或VLAN池或路由，或配置了汇聚交换机IP地址，不允许修改组网模式。",
					"desc" : "当前系统存在子网或VLAN池或路由，或配置了汇聚交换机IP地址，不允许修改组网模式。",
					"solution" : "请与系统管理员确认是否要执行该操作，如果确认要执行，请将相关子网，VLAN池，汇聚交换机IP，路由删除后，再修改组网模式。"
				},
				"1090000" : {
					"cause" : "VLAN池输入信息不符合要求。",
					"desc" : "VLAN池输入信息不符合要求。",
					"solution" : "请按照提示输入正确的VLAN池信息。"
				},
				"1090001" : {
					"cause" : "VLAN池不存在。",
					"desc" : "VLAN池不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090002" : {
					"cause" : "VLAN池的VLAN范围与存在的VLAN池有交叉或者包含。",
					"desc" : "VLAN池的VLAN范围与存在的VLAN池有交叉或者包含。",
					"solution" : "请填写正确的VLAN范围。"
				},
				"1090003" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090004" : {
					"cause" : "当前VLAN池名称已经存在。",
					"desc" : "当前VLAN池名称已经存在。",
					"solution" : "请填写唯一的VLAN池名称。"
				},
				"1090005" : {
					"cause" : "资源集群所选VLAN池中{0}已经不存在。",
					"desc" : "资源集群所选VLAN池中{0}已经不存在。",
					"solution" : "请选择存在的VLAN池。"
				},
				"1090006" : {
					"cause" : "资源集群所选VLAN池中{0}已经被其它资源集群使用。",
					"desc" : "资源集群所选VLAN池中{0}已经被其它资源集群使用。",
					"solution" : "请选择没有被资源集群使用的VLAN池。"
				},
				"1090007" : {
					"cause" : "当前VLAN池已经被外部网络或组织内部网络使用，删除失败。",
					"desc" : "当前VLAN池已经被外部网络或组织内部网络使用，删除失败。",
					"solution" : "请查看VLAN池是否被某个资源集群使用。"
				},
				"1090008" : {
					"cause" : "当前VLAN池已经被资源集群使用，修改失败。",
					"desc" : "当前VLAN池已经被资源集群使用，修改失败。",
					"solution" : "请查看VLAN池是否被某个资源集群使用。"
				},
				"1090009" : {
					"cause" : "内部错误。",
					"desc" : "内部错误。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090010" : {
					"cause" : "当前VLAN池中的VLAN ID已经被使用。",
					"desc" : "当前VLAN池中的VLAN ID已经被使用。",
					"solution" : "请输入没有使用的VLAN ID。"
				},
				"1090011" : {
					"cause" : "当前VLAN池正被使用，删除失败。",
					"desc" : "当前VLAN池正被使用，删除失败。",
					"solution" : "请在VLAN池没有被使用的时候再删除。"
				},
				"1090013" : {
					"cause" : "VLAN池已经被端口组使用，修改失败。",
					"desc" : "VLAN池已经被端口组使用，修改失败。",
					"solution" : "请先删除端口组再试。"
				},
				"1090014" : {
					"cause" : "VLAN池不能关联同一集群下的多个DVS。",
					"desc" : "VLAN池不能关联同一集群下的多个DVS。",
					"solution" : "请检查参数。"
				},
				"1090015" : {
					"cause" : "基于该关联关系，已经存在网络，不允许解关联.",
					"desc" : "基于该关联关系，已经存在网络，不允许解关联.",
					"solution" : "请检查参数。"
				},
				"1090016" : {
					"cause" : "该DVS所属的资源集群已被VDC使用，无法解关联。",
					"desc" : "该DVS所属的资源集群已被VDC使用，无法解关联。",
					"solution" : "请联系系统管理员。"
				},
				"1090017" : {
					"cause" : "集群中的DVS关联的VLAN池没有包含当前VDC所使用的所有VLAN，无法扩容。",
					"desc" : "集群中的DVS关联的VLAN池没有包含当前VDC所使用的所有VLAN，无法扩容。",
					"solution" : "请联系系统管理员。"
				},
				"1090018" : {
					"cause" : "VLAN不可用。",
					"desc" : "VLAN不可用。",
					"solution" : "请联系系统管理员。"
				},
				"1090050" : {
					"cause" : "VLAN不在VLAN池内。",
					"desc" : "VLAN不在VLAN池内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1090053" : {
					"cause" : "VLAN池的VLAN段包含VSA网络已经使用的VLAN ID。",
					"desc" : "VLAN池的VLAN段包含VSA网络已经使用的VLAN ID。",
					"solution" : "请重新输入VLAN段信息。"
				},
				"1090054" : {
					"cause" : "VLAN池{0}的VLAN段中包含被使用的VLAN{1}。",
					"desc" : "VLAN池{0}的VLAN段中包含被使用的VLAN{1}。",
					"solution" : "请修改VLAN段后重试。"
				},
				"1090056" : {
					"cause" : "没有可用的设备对接vlan",
					"desc" : "没有可用的设备对接vlan",
					"solution" : "请联系系统管理员"
				},
				"1100009" : {
					"cause" : "FusionStorage管理IP重复。",
					"desc" : "FusionStorage管理IP重复。",
					"solution" : "请修改管理IP后重试。"
				},
				"1100011" : {
					"cause" : "FusionStorage主IP重复了",
					"desc" : "FusionStorage主IP重复了",
					"solution" : "FusionStorage主IP不能重复"
				},
				"1110007" : {
					"cause" : "组织vdc存在关联的网络资源。",
					"desc" : "组织vdc存在关联的网络资源。",
					"solution" : "如需删除该组织VDC，请保证不存在资源与其关联。"
				},
				"1110021" : {
					"cause" : "组织VDC下存在VPC。",
					"desc" : "组织VDC下存在VPC。",
					"solution" : "如需删除该VDC，请保证VDC不存在VPC与其关联。"
				},
				"1110026" : {
					"cause" : "组织VDC修改的公网IP上限少于已用容量。",
					"desc" : "组织VDC修改的公网IP上限少于已用容量。",
					"solution" : "组织VDC修改的公网IP上限必须大于已用容量。"
				},
				"1110027" : {
					"cause" : "组织VDC修改的硬件虚拟防火墙上限少于已用容量。",
					"desc" : "组织VDC修改的硬件虚拟防火墙上限少于已用容量。",
					"solution" : "组织VDC修改的硬件虚拟防火墙上限必须大于已用容量。"
				},
				"1110028" : {
					"cause" : "组织VDC修改的软件虚拟防火墙上限少于已用容量。",
					"desc" : "组织VDC修改的软件虚拟防火墙上限少于已用容量。",
					"solution" : "组织VDC修改的软件虚拟防火墙上限必须大于已用容量。"
				},
				"1120003" : {
					"cause" : "BMC IP地址池更新失败。",
					"desc" : "BMC IP地址池更新失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120004" : {
					"cause" : "BMC IP地址池查询失败。",
					"desc" : "BMC IP地址池查询失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120005" : {
					"cause" : "BMC IP地址池的VLAN号和已有的子网VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和已有的子网VLAN号冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120006" : {
					"cause" : "BMC IP地址池的VLAN号和已有的VLAN池VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和已有的VLAN池VLAN号冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120007" : {
					"cause" : "没有配置组网模式，无法创建BMC IP地址池。",
					"desc" : "没有配置组网模式，无法创建BMC IP地址池。",
					"solution" : "请配置组网模式。"
				},
				"1120008" : {
					"cause" : "没有配置组网模式，无法修改BMC IP地址池。",
					"desc" : "没有配置组网模式，无法修改BMC IP地址池。",
					"solution" : "请配置组网模式。"
				},
				"1120009" : {
					"cause" : "BMC IP地址池的VLAN号和汇聚交换机上行端口的VLAN号冲突。",
					"desc" : "BMC IP地址池的VLAN号和汇聚交换机上行端口的VLAN号冲突。",
					"solution" : "请选择正确的VLAN号。"
				},
				"1120010" : {
					"cause" : "BMC IP地址池的IP和汇聚交换机上行端口的IP冲突。",
					"desc" : "BMC IP地址池的IP和汇聚交换机上行端口的IP冲突。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1120011" : {
					"cause" : "BMC IP地址池的IP和系统子网的IP冲突。",
					"desc" : "BMC IP地址池的IP和系统子网的IP冲突。",
					"solution" : "请选择正确的IP地址范围。"
				},
				"1120012" : {
					"cause" : "BMC IP地址池操作异常。",
					"desc" : "BMC IP地址池操作异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1120013" : {
					"cause" : "BMC IP地址池创建失败。",
					"desc" : "BMC IP地址池创建失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1130000" : {
					"cause" : "没有可以分配的VLAN。",
					"desc" : "没有可以分配的VLAN。",
					"solution" : "请联系技术支持工程师。"
				},
				"1130010" : {
					"cause" : "增加的vlan中存在被其他vdc使用的vlan。",
					"desc" : "增加的vlan中存在被其他vdc使用的vlan。",
					"solution" : "请修改增加的vlan后重试。"
				},
				"1130011" : {
					"cause" : "增加的vlan中存在被外部网络使用的vlan。",
					"desc" : "增加的vlan中存在被外部网络使用的vlan。",
					"solution" : "请修改增加的vlan后重试。"
				},
				"1130012" : {
					"cause" : "减少的vlan中存在被使用的vlan。",
					"desc" : "减少的vlan中存在被使用的vlan。",
					"solution" : "请修改减少的vlan后重试。"
				},
				"1140018" : {
					"cause" : "虚拟化环境端口和IP重复。",
					"desc" : "虚拟化环境端口和IP重复。",
					"solution" : "请重新输入。"
				},
				"1140019" : {
					"cause" : "DVS和VLAN池关联。",
					"desc" : "DVS和VLAN池关联。",
					"solution" : "请解关联DVS与VLAN池。"
				},
				"1140020" : {
					"cause" : "DVS和VSA网络关联。",
					"desc" : "DVS和VSA网络关联。",
					"solution" : "请解关联DVS与VSA网络。"
				},
				"1140040" : {
					"cause" : "同一个DVS的集群必须在一个资源分区内。",
					"desc" : "同一个DVS的集群必须在一个资源分区内。",
					"solution" : "请在正确的资源分区下操作，或选择正确的集群。"
				},
				"1140044" : {
					"cause" : "存在与该集群相关的外部网络或组织网络，不允许解除关联。",
					"desc" : "存在与该集群相关的外部网络或组织网络，不允许解除关联。",
					"solution" : "请先删除与该集群相关的外部网络和组织网络。"
				},
				"1140046" : {
					"cause" : "集群不存在关联",
					"desc" : "集群不存在关联",
					"solution" : "请检查该集群的关联关系"
				},
				"1140047" : {
					"cause" : "当前DVS下不包含任何VSS。",
					"desc" : "当前DVS下不包含任何VSS。",
					"solution" : "请重新添加VSS。"
				},
				"1140067" : {
					"cause" : "集群下DVS已关联Vlan池，不允许解除关联。",
					"desc" : "集群下DVS已关联Vlan池，不允许解除关联。",
					"solution" : "请先删除集群下DVS与Vlan池的关联关系。"
				},
				"1140068" : {
					"cause" : "集群已关联VSA网络或VTEP网络，不允许解除关联。",
					"desc" : "集群已关联VSA网络或VTEP网络，不允许解除关联。",
					"solution" : "请先删除集群下的VSA网络或VTEP网络。"
				},
				"1140069" : {
					"cause" : "资源分区下存在路由器，不允许修改物理组网模式。",
					"desc" : "资源分区下存在路由器，不允许修改物理组网模式。",
					"solution" : "请先从资源分区下删除路由器。"
				},
				"1150008" : {
					"cause" : "IP重复。",
					"desc" : "IP重复。",
					"solution" : "请检查IP是否重复。"
				},
				"1150009" : {
					"cause" : "IP格式非法。",
					"desc" : "IP格式非法。",
					"solution" : "请检查IP格式是否正确。"
				},
				"1150022" : {
					"cause" : "存储中不存在指定的管理IP。",
					"desc" : "存储中不存在指定的管理IP。",
					"solution" : "请填写正确的管理IP。"
				},
				"1150036" : {
					"cause" : "请求超时。",
					"desc" : "请求超时。",
					"solution" : "请先检查网络是否连通。"
				},
				"1150038" : {
					"cause" : "添加失败，请检查IP、端口、用户名和密码是否正确，网络是否连通。",
					"desc" : "添加失败，请检查IP、端口、用户名和密码是否正确，网络是否连通。",
					"solution" : "请检查Ip、用户名和密码是否正确，网络是否连通。"
				},
				"1150040" : {
					"cause" : "获得结点的存储IP失败。",
					"desc" : "获得结点的存储IP失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1150051" : {
					"cause" : "存在正在减容的服务器。",
					"desc" : "存在正在减容的服务器。",
					"solution" : "请等待减容完成后再操作。"
				},
				"1150054" : {
					"cause" : "该网络设备已经不存在。",
					"desc" : "该网络设备已经不存在。",
					"solution" : "请刷新页面查看网络设备列表。"
				},
				"1150059" : {
					"cause" : "没有可用的FusionStorage 逻辑设备，不能修改管理IP。",
					"desc" : "没有可用的FusionStorage 逻辑设备，不能修改管理IP。",
					"solution" : "请检查FusionStorage逻辑设备是否可用。"
				},
				"1162003" : {
					"cause" : "系统没有可分配资源。",
					"desc" : "系统没有可分配资源。",
					"solution" : "请联系系统管理员。"
				},
				"1162004" : {
					"cause" : "网络不存在。",
					"desc" : "网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162005" : {
					"cause" : "该网络已被虚拟机使用。",
					"desc" : "该网络已被虚拟机使用。",
					"solution" : "请删除使用该网络的资源后重试。"
				},
				"1162011" : {
					"cause" : "当前网络已被ACL使用。",
					"desc" : "当前网络已被ACL使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162012" : {
					"cause" : "当前网络已开启SNAT。",
					"desc" : "当前网络已开启SNAT。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162013" : {
					"cause" : "当前网络已被VPN连接使用。",
					"desc" : "当前网络已被VPN连接使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162014" : {
					"cause" : "当前网络已被直连网络使用。",
					"desc" : "当前网络已被直连网络使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162015" : {
					"cause" : "外部网络已经被软件防火墙使用，无法删除。",
					"desc" : "外部网络已经被软件防火墙使用，无法删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162016" : {
					"cause" : "当前网络有手动申请IP，不能修改或删除。",
					"desc" : "当前网络有手动申请IP，不能修改或删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162017" : {
					"cause" : "当前网络已被VLB使用。",
					"desc" : "当前网络已被VLB使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162117" : {
					"cause" : "网络当前状态不支持该操作，请稍后重试。",
					"desc" : "网络当前状态不支持该操作，请稍后重试。",
					"solution" : "请稍候重试。"
				},
				"1162118" : {
					"cause" : "修改后的可用IP个数小于该网络已分配的IP个数。",
					"desc" : "修改后的可用IP个数小于该网络已分配的IP个数。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162200" : {
					"cause" : "VPC规格模板个数超过系统最大值。",
					"desc" : "VPC规格模板个数超过系统最大值。",
					"solution" : ""
				},
				"1162201" : {
					"cause" : "VPC规格模板名称重复。",
					"desc" : "VPC规格模板名称重复。",
					"solution" : ""
				},
				"1162202" : {
					"cause" : "VPC规格模板不存在。",
					"desc" : "VPC规格模板不存在。",
					"solution" : ""
				},
				"1162203" : {
					"cause" : "VPC规格模板已被使用。",
					"desc" : "VPC规格模板已被使用。",
					"solution" : ""
				},
				"1162500" : {
					"cause" : "外部网络不存在。",
					"desc" : "外部网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162501" : {
					"cause" : "网络超出规格。",
					"desc" : "网络超出规格。",
					"solution" : "请联系系统管理员。"
				},
				"1162503" : {
					"cause" : "VLAN已被使用或VLAN对应的VLAN池不可用。",
					"desc" : "VLAN已被使用或VLAN对应的VLAN池不可用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162505" : {
					"cause" : "VLAN已被使用或VLAN所在的VLAN池被删除。",
					"desc" : "VLAN已被使用或VLAN所在的VLAN池被删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162506" : {
					"cause" : "DVS上创建了外部网络或者组织网络。",
					"desc" : "DVS上创建了外部网络或者组织网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162507" : {
					"cause" : "VSS所在的DVS创建了外部网络或组织网络。",
					"desc" : "VSS所在的DVS创建了外部网络或组织网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162508" : {
					"cause" : "VPC不存在。",
					"desc" : "VPC不存在。",
					"solution" : ""
				},
				"1162510" : {
					"cause" : "创建组织网络失败。",
					"desc" : "创建组织网络失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162511" : {
					"cause" : "创建DHCP子网失败。",
					"desc" : "创建DHCP子网失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162512" : {
					"cause" : "没有可用的外部网络。",
					"desc" : "没有可用的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162514" : {
					"cause" : "网络不存在。",
					"desc" : "网络不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162515" : {
					"cause" : "该外部网络已经被当前VPC使用。",
					"desc" : "该外部网络已经被当前VPC使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162516" : {
					"cause" : "该网络不属于当前VPC。",
					"desc" : "该网络不属于当前VPC。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162517" : {
					"cause" : "网络数量已经到达VPC的最大规格。",
					"desc" : "网络数量已经到达VPC的最大规格。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162519" : {
					"cause" : "该网络不是完成状态，无法使用。",
					"desc" : "该网络不是完成状态，无法使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162520" : {
					"cause" : "该VLAN已被VLAN类型的网络使用，无法用于创建子网类型的网络。",
					"desc" : "该VLAN已被VLAN类型的网络使用，无法用于创建子网类型的网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162521" : {
					"cause" : "该vlan已被其他网络的子网使用。",
					"desc" : "该vlan已被其他网络的子网使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162522" : {
					"cause" : "该网络不是直连网络。",
					"desc" : "该网络不是直连网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162523" : {
					"cause" : "没有可用的VSA管理网络。",
					"desc" : "没有可用的VSA管理网络。",
					"solution" : "请联系系统管理员。"
				},
				"1162524" : {
					"cause" : "一个VPC下最多能创建200个DHCP的网络。",
					"desc" : "一个VPC下最多能创建200个DHCP的网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162525" : {
					"cause" : "没有可用的VTEP网络。",
					"desc" : "没有可用的VTEP网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162526" : {
					"cause" : "删除dhcpsubnet失败",
					"desc" : "删除dhcpsubnet失败",
					"solution" : "请联系技术支持工程师。"
				},
				"1162527" : {
					"cause" : "子网和公网IP池中的IP段冲突。",
					"desc" : "子网和公网IP池中的IP段冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162528" : {
					"cause" : "该手动分配IP不存在。",
					"desc" : "该手动分配IP不存在。",
					"solution" : "请刷新列表后重试。"
				},
				"1162529" : {
					"cause" : "外部网络的DHCP服务器不存在。",
					"desc" : "外部网络的DHCP服务器不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1162530" : {
					"cause" : "DHCP服务器的状态不允许操作。",
					"desc" : "DHCP服务器的状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1162531" : {
					"cause" : "一个申请了软件防火墙的VPC最多可创建200个路由网络。",
					"desc" : "一个申请了软件防火墙的VPC最多可创建200个路由网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162532" : {
					"cause" : "一个ZONE下最多创建199个内部DHCP的外部网络。",
					"desc" : "一个ZONE下最多创建199个内部DHCP的外部网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163003" : {
					"cause" : "虚拟防火墙与VPC关联关系不正常。",
					"desc" : "虚拟防火墙与VPC关联关系不正常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163006" : {
					"cause" : "当前虚拟防火墙已与VPC关联。",
					"desc" : "当前虚拟防火墙已与VPC关联。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163007" : {
					"cause" : "VPC已经关联了虚拟防火墙。",
					"desc" : "VPC已经关联了虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163008" : {
					"cause" : "VPC下存在网络，不能释放虚拟防火墙。",
					"desc" : "VPC下存在网络，不能释放虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163009" : {
					"cause" : "虚拟防火墙未关联VPC，不需要释放。",
					"desc" : "虚拟防火墙未关联VPC，不需要释放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163010" : {
					"cause" : "防火墙资源ID不存在。",
					"desc" : "防火墙资源ID不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163012" : {
					"cause" : "预留的防火墙已经被使用，请修配置文件。",
					"desc" : "预留的防火墙已经被使用，请修配置文件。",
					"solution" : "请修改配置文件。"
				},
				"1163013" : {
					"cause" : "VPC下存在弹性IP，无法释放虚拟防火墙。",
					"desc" : "VPC下存在弹性IP，无法释放虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1163014" : {
					"cause" : "该VPC已经创建了授权，不能再次授权。",
					"desc" : "该VPC已经创建了授权，不能再次授权。",
					"solution" : "请联系技术支持工程师。"
				},
				"1164200" : {
					"cause" : "该zone没有可用的公网IP。",
					"desc" : "该zone没有可用的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1166003" : {
					"cause" : "防火墙已冻结，不能创建ACL。",
					"desc" : "防火墙已冻结，不能创建ACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166006" : {
					"cause" : "虚拟防火墙已冻结，不能创建ACL规则。",
					"desc" : "虚拟防火墙已冻结，不能创建ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166007" : {
					"cause" : "ACL已经存在。",
					"desc" : "ACL已经存在。",
					"solution" : "请联系系统管理员。"
				},
				"1166016" : {
					"cause" : "当前VPC状态不能创建FWACL。",
					"desc" : "当前VPC状态不能创建FWACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166017" : {
					"cause" : "当前网络不是路由网络，不能用来创建NetACL。",
					"desc" : "当前网络不是路由网络，不能用来创建NetACL。",
					"solution" : "请联系系统管理员。"
				},
				"1166018" : {
					"cause" : "VPC没有申请路由器。",
					"desc" : "VPC没有申请路由器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1166019" : {
					"cause" : "弹性IP与ACL不属于同一个虚拟防火墙。",
					"desc" : "弹性IP与ACL不属于同一个虚拟防火墙。",
					"solution" : "请联系系统管理员。"
				},
				"1166020" : {
					"cause" : "当前ACL不是FWACL，不能创建FWACL规则。",
					"desc" : "当前ACL不是FWACL，不能创建FWACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166023" : {
					"cause" : "网络不是完成状态，不能创建NetACL规则。",
					"desc" : "网络不是完成状态，不能创建NetACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1166026" : {
					"cause" : "VPC内不存在可用的路由器",
					"desc" : "VPC内不存在可用的路由器",
					"solution" : "请检查路由器是否创建成功"
				},
				"1167002" : {
					"cause" : "SNAT不存在。",
					"desc" : "SNAT不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167011" : {
					"cause" : "DNAT不存在。",
					"desc" : "DNAT不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167012" : {
					"cause" : "底层设备配置SNAT失败。",
					"desc" : "底层设备配置SNAT失败。",
					"solution" : "请联系系统管理员。"
				},
				"1167019" : {
					"cause" : "正在配置SNAT。",
					"desc" : "正在配置SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167021" : {
					"cause" : "该公网IP池没有可用IP。",
					"desc" : "该公网IP池没有可用IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167029" : {
					"cause" : "正在删除SNAT。",
					"desc" : "正在删除SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167030" : {
					"cause" : "DNAT不是处于成功状态。",
					"desc" : "DNAT不是处于成功状态。",
					"solution" : "请联系系统管理员。"
				},
				"1167033" : {
					"cause" : "该虚拟机没有可以设置DNAT的网卡。",
					"desc" : "该虚拟机没有可以设置DNAT的网卡。",
					"solution" : "请联系系统管理员。"
				},
				"1167034" : {
					"cause" : "该zone没有配置公网访问虚拟机的参数。",
					"desc" : "该zone没有配置公网访问虚拟机的参数。",
					"solution" : "请联系系统管理员。"
				},
				"1167035" : {
					"cause" : "该网络不是路由网络。",
					"desc" : "该网络不是路由网络。",
					"solution" : "请联系系统管理员。"
				},
				"1167036" : {
					"cause" : "该网络已经设置了SNAT。",
					"desc" : "该网络已经设置了SNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167038" : {
					"cause" : "网络不在指定的VPC中。",
					"desc" : "网络不在指定的VPC中。",
					"solution" : "请联系系统管理员。"
				},
				"1167039" : {
					"cause" : "网络没有创建成功。",
					"desc" : "网络没有创建成功。",
					"solution" : "请联系系统管理员。"
				},
				"1167040" : {
					"cause" : "SNAT不在指定的VPC中。",
					"desc" : "SNAT不在指定的VPC中。",
					"solution" : "请联系系统管理员。"
				},
				"1167041" : {
					"cause" : "该虚拟机已经设置了DNAT。",
					"desc" : "该虚拟机已经设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167045" : {
					"cause" : "该网卡和私有端口已经配置了DNAT。",
					"desc" : "该网卡和私有端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167047" : {
					"cause" : "该私有IP和私有端口已经配置了DNAT。",
					"desc" : "该私有IP和私有端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167048" : {
					"cause" : "该公网IP和公网端口已经配置了DNAT。",
					"desc" : "该公网IP和公网端口已经配置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167049" : {
					"cause" : "VPC下无可用的公网IP。",
					"desc" : "VPC下无可用的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167050" : {
					"cause" : "VPC下的公网IP地址已被使用。",
					"desc" : "VPC下的公网IP地址已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1167051" : {
					"cause" : "已超过VDC下的公网IP上限。",
					"desc" : "已超过VDC下的公网IP上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167052" : {
					"cause" : "已超过VDC下的硬件虚拟防火墙上限。",
					"desc" : "已超过VDC下的硬件虚拟防火墙上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167053" : {
					"cause" : "已超过VDC下的软件虚拟防火墙上限。",
					"desc" : "已超过VDC下的软件虚拟防火墙上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167054" : {
					"cause" : "指定的公网IP非VPC下的公网IP。",
					"desc" : "指定的公网IP非VPC下的公网IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167055" : {
					"cause" : "指定的公网IP不存在。",
					"desc" : "指定的公网IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167056" : {
					"cause" : "指定的公网IP与VPC下已开启SNAT的公网IP不一致。",
					"desc" : "指定的公网IP与VPC下已开启SNAT的公网IP不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1167057" : {
					"cause" : "VPC下存在公网IP，不允许释放虚拟防火墙。",
					"desc" : "VPC下存在公网IP，不允许释放虚拟防火墙。",
					"solution" : "请联系系统管理员。"
				},
				"1167058" : {
					"cause" : "公网IP池中不存在要申请的IP。",
					"desc" : "公网IP池中不存在要申请的IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167059" : {
					"cause" : "所在资源分区下可用的公网IP不足。",
					"desc" : "所在资源分区下可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167060" : {
					"cause" : "指定公网IP池内可用的公网IP不足。",
					"desc" : "指定公网IP池内可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167061" : {
					"cause" : "虚拟防火墙所在外部网络可用的公网IP不足。",
					"desc" : "虚拟防火墙所在外部网络可用的公网IP不足。",
					"solution" : "请联系系统管理员。"
				},
				"1167062" : {
					"cause" : "公网端口已被占用。",
					"desc" : "公网端口已被占用。",
					"solution" : "请联系系统管理员。"
				},
				"1167200" : {
					"cause" : "该弹性IP不存在。",
					"desc" : "该弹性IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167202" : {
					"cause" : "弹性IP和虚拟机已绑定。",
					"desc" : "弹性IP和虚拟机已绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167204" : {
					"cause" : "指定网卡无法设置弹性IP。",
					"desc" : "指定网卡无法设置弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167205" : {
					"cause" : "该弹性IP未被绑定。",
					"desc" : "该弹性IP未被绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167208" : {
					"cause" : "该弹性IP已经冻结。",
					"desc" : "该弹性IP已经冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1167209" : {
					"cause" : "该弹性IP已经恢复。",
					"desc" : "该弹性IP已经恢复。",
					"solution" : "请联系系统管理员。"
				},
				"1167210" : {
					"cause" : "该弹性IP正在绑定。",
					"desc" : "该弹性IP正在绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167211" : {
					"cause" : "该弹性IP正在解绑。",
					"desc" : "该弹性IP正在解绑。",
					"solution" : "请联系系统管理员。"
				},
				"1167212" : {
					"cause" : "该弹性IP正在冻结。",
					"desc" : "该弹性IP正在冻结。",
					"solution" : "请联系系统管理员。"
				},
				"1167213" : {
					"cause" : "该弹性IP正在恢复。",
					"desc" : "该弹性IP正在恢复。",
					"solution" : "请联系系统管理员。"
				},
				"1167214" : {
					"cause" : "申请的弹性IP地址超过上限。",
					"desc" : "申请的弹性IP地址超过上限。",
					"solution" : "请联系系统管理员。"
				},
				"1167215" : {
					"cause" : "没有可以绑定弹性IP的网卡。",
					"desc" : "没有可以绑定弹性IP的网卡。",
					"solution" : "请联系系统管理员。"
				},
				"1167216" : {
					"cause" : "弹性IP所在的VPC与网卡所在的VPC不一致。",
					"desc" : "弹性IP所在的VPC与网卡所在的VPC不一致。",
					"solution" : "请联系系统管理员。"
				},
				"1167217" : {
					"cause" : "该弹性IP有ACL规则。",
					"desc" : "该弹性IP有ACL规则。",
					"solution" : "请联系系统管理员。"
				},
				"1167218" : {
					"cause" : "该私有IP不存在。",
					"desc" : "该私有IP不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1167219" : {
					"cause" : "VPN使用了该弹性IP",
					"desc" : "VPN使用了该弹性IP",
					"solution" : "请联系系统管理员。"
				},
				"1167220" : {
					"cause" : "不允许使用静态注入网络配置类型。",
					"desc" : "不允许使用静态注入网络配置类型。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167222" : {
					"cause" : "绑定的弹性IP已达到最大值。",
					"desc" : "绑定的弹性IP已达到最大值。",
					"solution" : "请联系系统管理员。"
				},
				"1167223" : {
					"cause" : "弹性IP和F5中的VLB进行了绑定",
					"desc" : "弹性IP和F5中的VLB进行了绑定",
					"solution" : "请联系系统管理员。"
				},
				"1167224" : {
					"cause" : "私有IP绑定了弹性IP。",
					"desc" : "私有IP绑定了弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1167226" : {
					"cause" : "弹性IP和私有IP进行了绑定",
					"desc" : "弹性IP和私有IP进行了绑定",
					"solution" : "请联系系统管理员。"
				},
				"1167228" : {
					"cause" : "网卡设置了DNAT。",
					"desc" : "网卡设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167229" : {
					"cause" : "私有IP设置了DNAT。",
					"desc" : "私有IP设置了DNAT。",
					"solution" : "请联系系统管理员。"
				},
				"1167230" : {
					"cause" : "弹性IP和软件负载均衡器进行了绑定。",
					"desc" : "弹性IP和软件负载均衡器进行了绑定。",
					"solution" : "请联系系统管理员。"
				},
				"1167231" : {
					"cause" : "正在修改IP带宽。",
					"desc" : "正在修改IP带宽。",
					"solution" : "请联系系统管理员。"
				},
				"1167232" : {
					"cause" : "弹性IP不属于VPC。",
					"desc" : "弹性IP不属于VPC。",
					"solution" : "请联系系统管理员。"
				},
				"1167300" : {
					"cause" : "IP池中有名称冲突。",
					"desc" : "IP池中有名称冲突。",
					"solution" : "请重新输入名称。"
				},
				"1167301" : {
					"cause" : "有公网IP地址已经被其他公网IP池使用。",
					"desc" : "有公网IP地址已经被其他公网IP池使用。",
					"solution" : "请修改公网IP段。"
				},
				"1167302" : {
					"cause" : "公网IP池不存在。",
					"desc" : "公网IP池不存在。",
					"solution" : "请重新刷新公网IP池列表。"
				},
				"1167303" : {
					"cause" : "IP池中有IP地址已被分配或正在使用，不允许删除。",
					"desc" : "IP池中有IP地址已被分配或正在使用，不允许删除。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167304" : {
					"cause" : "IP池中有IP地址不在。",
					"desc" : "IP池中有IP地址不在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167305" : {
					"cause" : "IP池中有IP地址已作他用。",
					"desc" : "IP池中有IP地址已作他用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167306" : {
					"cause" : "一个公网IP池中最多能添加32个IP地址段。",
					"desc" : "一个公网IP池中最多能添加32个IP地址段。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167307" : {
					"cause" : "一个资源分区最多能添加8个IP池。",
					"desc" : "一个资源分区最多能添加8个IP池。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167308" : {
					"cause" : "该IP和zone不匹配。",
					"desc" : "该IP和zone不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1167309" : {
					"cause" : "公网IP段和外部网络的子网冲突。",
					"desc" : "公网IP段和外部网络的子网冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1167310" : {
					"cause" : "IP地址已被释放。",
					"desc" : "IP地址已被释放。",
					"solution" : "请联系技术支持工程师。"
				},
				"1168001" : {
					"cause" : "虚拟防火墙不允许设置ASPF规则。",
					"desc" : "虚拟防火墙不允许设置ASPF规则。",
					"solution" : "请打开ASPF开关，然后重试。"
				},
				"1168002" : {
					"cause" : "虚拟防火墙当前状态不允许设置ASPF规则。",
					"desc" : "虚拟防火墙当前状态不允许设置ASPF规则。",
					"solution" : "请联系系统管理员。"
				},
				"1168007" : {
					"cause" : "虚拟防火墙ASPF正在更新中，不能设置。",
					"desc" : "虚拟防火墙ASPF正在更新中，不能设置。",
					"solution" : "请联系系统管理员。"
				},
				"1169002" : {
					"cause" : "该IP未被设置在虚拟防火墙上。",
					"desc" : "该IP未被设置在虚拟防火墙上。",
					"solution" : "请联系系统管理员。"
				},
				"1169101" : {
					"cause" : "该IP带宽模板不存在。",
					"desc" : "该IP带宽模板不存在。",
					"solution" : "请刷新列表后重试。"
				},
				"1169103" : {
					"cause" : "IP带宽模板个数超过系统最大值。",
					"desc" : "IP带宽模板个数超过系统最大值。",
					"solution" : ""
				},
				"1169105" : {
					"cause" : "底层设备配置IP带宽失败。",
					"desc" : "底层设备配置IP带宽失败。",
					"solution" : "请联系系统管理员。"
				},
				"1170027" : {
					"cause" : "VSA管理网络和VPC下的网络有重叠。",
					"desc" : "VSA管理网络和VPC下的网络有重叠。",
					"solution" : "请重新输入。"
				},
				"1180000" : {
					"cause" : "VPC下的DHCP VSA不存在。",
					"desc" : "VPC下的DHCP VSA不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1180100" : {
					"cause" : "DHCP服务器不存在。",
					"desc" : "DHCP服务器不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180101" : {
					"cause" : "创建VSA虚拟机失败。",
					"desc" : "创建VSA虚拟机失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180102" : {
					"cause" : "添加VSA外部接口失败。",
					"desc" : "添加VSA外部接口失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180103" : {
					"cause" : "添加VSA失败。",
					"desc" : "添加VSA失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180104" : {
					"cause" : "vsa虚拟机模板不存在。",
					"desc" : "vsa虚拟机模板不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1180105" : {
					"cause" : "VPC已经申请了虚拟防火墙。",
					"desc" : "VPC已经申请了虚拟防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180107" : {
					"cause" : "外部网络不是普通子网类型，无法用于创建软件防火墙。",
					"desc" : "外部网络不是普通子网类型，无法用于创建软件防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180108" : {
					"cause" : "外部网络中没有可用的IP。",
					"desc" : "外部网络中没有可用的IP。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180109" : {
					"cause" : "外部网络和VPC不属于同一个资源分区。",
					"desc" : "外部网络和VPC不属于同一个资源分区。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180110" : {
					"cause" : "外部网络ip分配方式不为静态注入，无法用于创建软件防火墙。",
					"desc" : "外部网络ip分配方式不为静态注入，无法用于创建软件防火墙。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180111" : {
					"cause" : "软件防火墙状态不允许操作。",
					"desc" : "软件防火墙状态不允许操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180112" : {
					"cause" : "无法获取到软件防火墙VSA虚拟机网卡ip。",
					"desc" : "无法获取到软件防火墙VSA虚拟机网卡ip。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180114" : {
					"cause" : "没有可用的vsa管理网络。",
					"desc" : "没有可用的vsa管理网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180115" : {
					"cause" : "没有可用的vtep网络。",
					"desc" : "没有可用的vtep网络。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180116" : {
					"cause" : "vsa不在当前vpc下。",
					"desc" : "vsa不在当前vpc下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180117" : {
					"cause" : "没有firewall vsa存在。",
					"desc" : "没有firewall vsa存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180118" : {
					"cause" : "外部网络无效。",
					"desc" : "外部网络无效。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180119" : {
					"cause" : "该zone下已经存在外部网络的DHCP服务器。",
					"desc" : "该zone下已经存在外部网络的DHCP服务器。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180121" : {
					"cause" : "创建VSA虚拟机失败。",
					"desc" : "创建VSA虚拟机失败。",
					"solution" : "请联系系统管理员。"
				},
				"1180122" : {
					"cause" : "zone下有内部DHCP类型的外部网络，不允许删除DHCP服务器。",
					"desc" : "zone下有内部DHCP类型的外部网络，不允许删除DHCP服务器。",
					"solution" : "请联系系统管理员。"
				},
				"1180126" : {
					"cause" : "DHCP服务器状态不允许此操作。",
					"desc" : "DHCP服务器状态不允许此操作。",
					"solution" : "请刷新后重新尝试。"
				},
				"1180128" : {
					"cause" : "删除DHCP Subnet失败。",
					"desc" : "删除DHCP Subnet失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1180129" : {
					"cause" : "虚拟化环境没有接入VSAM。",
					"desc" : "虚拟化环境没有接入VSAM。",
					"solution" : "请先接入VSAM，然后重试"
				},
				"1181000" : {
					"cause" : "VPC名称已存在。",
					"desc" : "VPC名称已存在。",
					"solution" : ""
				},
				"1181001" : {
					"cause" : "所选VDC下没有资源或者该VDC下没有可用的网络。",
					"desc" : "所选VDC下没有资源或者该VDC下没有可用的网络。",
					"solution" : ""
				},
				"1181002" : {
					"cause" : "VPC不存在。",
					"desc" : "VPC不存在。",
					"solution" : ""
				},
				"1181003" : {
					"cause" : "最大内部网络个数小于当前VPC下内部网络的个数。",
					"desc" : "最大内部网络个数小于当前VPC下内部网络的个数。",
					"solution" : ""
				},
				"1181004" : {
					"cause" : "最大直连网络个数小于当前VPC下直连网络的个数。",
					"desc" : "最大直连网络个数小于当前VPC下直连网络的个数。",
					"solution" : ""
				},
				"1181005" : {
					"cause" : "最大路由网络个数小于当前VPC下路由网络的个数。",
					"desc" : "最大路由网络个数小于当前VPC下路由网络的个数。",
					"solution" : ""
				},
				"1181006" : {
					"cause" : "最大弹性IP个数小于当前VPC下弹性IP的个数。",
					"desc" : "最大弹性IP个数小于当前VPC下弹性IP的个数。",
					"solution" : ""
				},
				"1181007" : {
					"cause" : "VPC下已有网络，不允许删除。",
					"desc" : "VPC下已有网络，不允许删除。",
					"solution" : ""
				},
				"1181008" : {
					"cause" : "VPC已关联了虚拟防火墙，不允许删除。",
					"desc" : "VPC已关联了虚拟防火墙，不允许删除。",
					"solution" : ""
				},
				"1181010" : {
					"cause" : "vlan不在指定的vpc下。",
					"desc" : "vlan不在指定的vpc下。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181011" : {
					"cause" : "网关与子网内系统保留的IP重复。子网内第二个和第三个IP为系统保留IP，不能作为网关使用。",
					"desc" : "网关与子网内系统保留的IP重复。子网内第二个和第三个IP为系统保留IP，不能作为网关使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1181012" : {
					"cause" : "VPC下已有弹性IP，不允许删除。",
					"desc" : "VPC下已有弹性IP，不允许删除。",
					"solution" : ""
				},
				"1181013" : {
					"cause" : "VPC下有安全组，不允许删除。",
					"desc" : "VPC下有安全组，不允许删除。",
					"solution" : ""
				},
				"1181014" : {
					"cause" : "zone下的VPC数量达到上限。",
					"desc" : "zone下的VPC数量达到上限。",
					"solution" : ""
				},
				"1181015" : {
					"cause" : "VPC当前状态不允许操作。",
					"desc" : "VPC当前状态不允许操作。",
					"solution" : ""
				},
				"1181016" : {
					"cause" : "VPC下已经部署了服务，不允许删除。",
					"desc" : "VPC下已经部署了服务，不允许删除。",
					"solution" : "请先删除服务，在尝试删除。"
				},
				"1181017" : {
					"cause" : "vpc下存在路由器，不能删除。",
					"desc" : "vpc下存在路由器，不能删除。",
					"solution" : "请先删除路由器，再尝试删除"
				},
				"1182000" : {
					"cause" : "每个VPC下仅能创建一个VPN网关，不允许创建多个VPN网关。",
					"desc" : "每个VPC下仅能创建一个VPN网关，不允许创建多个VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1182001" : {
					"cause" : "VPC未申请硬件类型的VFW，不允许创建VPN网关。",
					"desc" : "VPC未申请硬件类型的VFW，不允许创建VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1182002" : {
					"cause" : "VPN网关不存在。",
					"desc" : "VPN网关不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1182003" : {
					"cause" : "VPN网关已被使用。",
					"desc" : "VPN网关已被使用。",
					"solution" : "请联系系统管理员。"
				},
				"1182004" : {
					"cause" : "VPN网关名称重复。",
					"desc" : "VPN网关名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1182005" : {
					"cause" : "VPN网关与VPC不匹配。",
					"desc" : "VPN网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1182006" : {
					"cause" : "VPC下没有可用的弹性IP，无法创建VPN网关。",
					"desc" : "VPC下没有可用的弹性IP，无法创建VPN网关。",
					"solution" : "请联系系统管理员。"
				},
				"1183000" : {
					"cause" : "远端网关地址与VPC下的远端网关地址冲突。",
					"desc" : "远端网关地址与VPC下的远端网关地址冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1183001" : {
					"cause" : "远端网关地址与VPN网关IP地址冲突。",
					"desc" : "远端网关地址与VPN网关IP地址冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1183006" : {
					"cause" : "远端网关与VPC不匹配。",
					"desc" : "远端网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1183007" : {
					"cause" : "网络个数超过远端网关的限额。",
					"desc" : "网络个数超过远端网关的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1183008" : {
					"cause" : "远端网关个数达到VPC下的限额。",
					"desc" : "远端网关个数达到VPC下的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1184001" : {
					"cause" : "用户网关与VPC下的其他用户网关冲突。",
					"desc" : "用户网关与VPC下的其他用户网关冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184002" : {
					"cause" : "本端网关与VPC下的本端网关不同。",
					"desc" : "本端网关与VPC下的本端网关不同。",
					"solution" : "请联系系统管理员。"
				},
				"1184004" : {
					"cause" : "远端用户子网与VPC下的远端用户子网冲突。",
					"desc" : "远端用户子网与VPC下的远端用户子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184005" : {
					"cause" : "远端用户子网与VPC下的子网冲突。",
					"desc" : "远端用户子网与VPC下的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184006" : {
					"cause" : "VPN连接名称重复。",
					"desc" : "VPN连接名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1184007" : {
					"cause" : "VPN连接已存在。",
					"desc" : "VPN连接已存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184008" : {
					"cause" : "VPN连接不存在。",
					"desc" : "VPN连接不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184009" : {
					"cause" : "VPN连接与VPC不匹配。",
					"desc" : "VPN连接与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184010" : {
					"cause" : "VPN连接状态不允许操作。",
					"desc" : "VPN连接状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1184011" : {
					"cause" : "VPN连接本端子网不存在。",
					"desc" : "VPN连接本端子网不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184021" : {
					"cause" : "本端网关不是弹性IP。",
					"desc" : "本端网关不是弹性IP。",
					"solution" : "请联系系统管理员。"
				},
				"1184022" : {
					"cause" : "本端网络与VPC不匹配。",
					"desc" : "本端网络与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184023" : {
					"cause" : "VPN个数达到VPC下的限额。",
					"desc" : "VPN个数达到VPC下的限额。",
					"solution" : "请联系系统管理员。"
				},
				"1184024" : {
					"cause" : "远端子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"desc" : "远端子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"solution" : "请联系系统管理员。"
				},
				"1184025" : {
					"cause" : "底层创建VPN连接失败。",
					"desc" : "底层创建VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184026" : {
					"cause" : "底层修改VPN连接失败。",
					"desc" : "底层修改VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184027" : {
					"cause" : "底层删除VPN连接失败。",
					"desc" : "底层删除VPN连接失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184028" : {
					"cause" : "本端网关与VPC不匹配。",
					"desc" : "本端网关与VPC不匹配。",
					"solution" : "请联系系统管理员。"
				},
				"1184029" : {
					"cause" : "L2tp client可以使用的子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"desc" : "L2tp client可以使用的子网信息错误(非IP地址;掩码取值错误;IP与掩码不匹配)。",
					"solution" : "请联系系统管理员。"
				},
				"1184030" : {
					"cause" : "一个VPC只能创建一个类型为L2TP的VPN连接，该VPC下L2TP的VPN连接已存在，不允许创建多个L2TP类型的VPN连接。",
					"desc" : "一个VPC只能创建一个类型为L2TP的VPN连接，该VPC下L2TP的VPN连接已存在，不允许创建多个L2TP类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184031" : {
					"cause" : "该网络与VPC下的远端网络冲突。",
					"desc" : "该网络与VPC下的远端网络冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184032" : {
					"cause" : "该网络与L2TP类型VPN的子网冲突。",
					"desc" : "该网络与L2TP类型VPN的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184033" : {
					"cause" : "L2TP类型的VPN子网信息与其他L2TP类型的VPN子网冲突。",
					"desc" : "L2TP类型的VPN子网信息与其他L2TP类型的VPN子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184034" : {
					"cause" : "远端用户子网与L2TP类型VPN的子网冲突。",
					"desc" : "远端用户子网与L2TP类型VPN的子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184035" : {
					"cause" : "L2TP类型的VPN子网与远端用户子网冲突。",
					"desc" : "L2TP类型的VPN子网与远端用户子网冲突。",
					"solution" : "请联系系统管理员。"
				},
				"1184036" : {
					"cause" : "L2TP类型的VPN用户名称重复。",
					"desc" : "L2TP类型的VPN用户名称重复。",
					"solution" : "请联系系统管理员。"
				},
				"1184039" : {
					"cause" : "VPC未申请硬件类型的VFW。",
					"desc" : "VPC未申请硬件类型的VFW。",
					"solution" : "请联系系统管理员。"
				},
				"1184040" : {
					"cause" : "当前VPC没有创建VPN网关，请先创建。",
					"desc" : "当前VPC没有创建VPN网关，请先创建。",
					"solution" : "请联系系统管理员。"
				},
				"1184041" : {
					"cause" : "当前VPC已存在IPSec类型的VPN连接，不允许创建其他类型的VPN连接。",
					"desc" : "当前VPC已存在IPSec类型的VPN连接，不允许创建其他类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184042" : {
					"cause" : "当前VPC已存在L2TP类型的VPN连接，不允许创建其他类型的VPN连接。",
					"desc" : "当前VPC已存在L2TP类型的VPN连接，不允许创建其他类型的VPN连接。",
					"solution" : "请联系系统管理员。"
				},
				"1184043" : {
					"cause" : "软件防火墙只支持Ipsec类型的VPN连接，不支持其他类型。",
					"desc" : "软件防火墙只支持Ipsec类型的VPN连接，不支持其他类型。",
					"solution" : "请联系系统管理员。"
				},
				"1184044" : {
					"cause" : "L2TP类型的VPN连接允许接入的用户个数超过系统限制。",
					"desc" : "L2TP类型的VPN连接允许接入的用户个数超过系统限制。",
					"solution" : "请联系系统管理员。"
				},
				"1184045" : {
					"cause" : "底层创建VPN用户失败。",
					"desc" : "底层创建VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184046" : {
					"cause" : "底层修改VPN用户失败。",
					"desc" : "底层修改VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184047" : {
					"cause" : "底层删除VPN用户失败。",
					"desc" : "底层删除VPN用户失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184048" : {
					"cause" : "底层创建VPN失败。",
					"desc" : "底层创建VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184049" : {
					"cause" : "底层修改VPN失败。",
					"desc" : "底层修改VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184050" : {
					"cause" : "底层删除VPN失败。",
					"desc" : "底层删除VPN失败。",
					"solution" : "请联系系统管理员。"
				},
				"1184051" : {
					"cause" : "L2TP类型的VPN连接用户名与防火墙SSH用户重名。",
					"desc" : "L2TP类型的VPN连接用户名与防火墙SSH用户重名。",
					"solution" : "请联系系统管理员。"
				},
				"1184052" : {
					"cause" : "L2TP VPN连接名称是l2tp(不区分大小写)，名称非法。",
					"desc" : "L2TP VPN连接名称是l2tp(不区分大小写)，名称非法。",
					"solution" : "请联系系统管理员。"
				},
				"1184055" : {
					"cause" : "L2TP VPN用户原密码不正确。",
					"desc" : "L2TP VPN用户原密码不正确。",
					"solution" : "请联系系统管理员。"
				},
				"1184056" : {
					"cause" : "L2TP VPN服务异常。",
					"desc" : "L2TP VPN服务异常。",
					"solution" : "请联系系统管理员。"
				},
				"1184057" : {
					"cause" : "L2TP VPN用户不存在。",
					"desc" : "L2TP VPN用户不存在。",
					"solution" : "请联系系统管理员。"
				},
				"1184058" : {
					"cause" : "L2TP VPN用户当前状态不允许操作。",
					"desc" : "L2TP VPN用户当前状态不允许操作。",
					"solution" : "请联系系统管理员。"
				},
				"1184059" : {
					"cause" : "L2TP VPN用户不属于该VPC。",
					"desc" : "L2TP VPN用户不属于该VPC。",
					"solution" : "请联系系统管理员。"
				},
				"1184061" : {
					"cause" : "该网络未被申请，不能创建L2TP VPN用户。",
					"desc" : "该网络未被申请，不能创建L2TP VPN用户。",
					"solution" : "请联系系统管理员。"
				},
				"1190502" : {
					"cause" : "设备不可达，icmp无法ping通设备",
					"desc" : "设备不可达，icmp无法ping通设备",
					"solution" : "请确认网络状况是否异常"
				},
				"1190503" : {
					"cause" : "IP地址重复",
					"desc" : "IP地址重复",
					"solution" : "请确认是否为重复接入"
				},
				"1200001" : {
					"cause" : "VPC下不存在部署服务",
					"desc" : "VPC下不存在部署服务",
					"solution" : "请确认VPC下是否存在部署服务"
				},
				"1200008" : {
					"cause" : "修改路由失败",
					"desc" : "修改路由失败",
					"solution" : "请联系技术支持工程师"
				},
				"1200013" : {
					"cause" : "部署服务已存在",
					"desc" : "部署服务已存在",
					"solution" : "请确认VPC下部署服务是否已存在"
				},
				"1200014" : {
					"cause" : "状态冲突，当前操作不允许",
					"desc" : "状态冲突，当前操作不允许",
					"solution" : "请联系技术支持工程师"
				},
				"1200015" : {
					"cause" : "PVM模板不存在",
					"desc" : "PVM模板不存在",
					"solution" : "请联系系统管理员，确认PVM模板是否存在"
				},
				"1200016" : {
					"cause" : "部署服务虚拟机获取ip失败。",
					"desc" : "部署服务虚拟机获取ip失败。",
					"solution" : "请联系技术支持工程师。"
				},
				"1200017" : {
					"cause" : "部署服务非运行态",
					"desc" : "部署服务非运行态",
					"solution" : "请检查部署服务的状态"
				},
				"1200023" : {
					"cause" : "部署服务的网络超过上限",
					"desc" : "部署服务的网络超过上限",
					"solution" : "请联系系统管理员"
				},
				"1200024" : {
					"cause" : "部署服务的路由网络超过上限",
					"desc" : "部署服务的路由网络超过上限",
					"solution" : "请联系系统管理员"
				},
				"1200025" : {
					"cause" : "部署服务网络重复",
					"desc" : "部署服务网络重复",
					"solution" : "请移除重复的网络"
				},
				"1211001" : {
					"cause" : "组播IP池不存在。",
					"desc" : "组播IP池不存在。",
					"solution" : "请刷新页面后重试。"
				},
				"1211002" : {
					"cause" : "组播IP池已被分配。",
					"desc" : "组播IP池已被分配。",
					"solution" : "请刷新页面后重试。"
				},
				"1211003" : {
					"cause" : "没有可用的组播IP池。",
					"desc" : "没有可用的组播IP池。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211004" : {
					"cause" : "组播IP已回收。",
					"desc" : "组播IP已回收。",
					"solution" : "请刷新页面后重试。"
				},
				"1211006" : {
					"cause" : "和已有组播IP池有重叠。",
					"desc" : "和已有组播IP池有重叠。",
					"solution" : "请联系技术支持工程师。"
				},
				"1211007" : {
					"cause" : "组播IP池数量超过上限。",
					"desc" : "组播IP池数量超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1220001" : {
					"cause" : "路由器的当前状态不允许操作",
					"desc" : "路由器的当前状态不允许操作",
					"solution" : "请联系系统管理员。"
				},
				"1220002" : {
					"cause" : "没有接入汇聚交换机",
					"desc" : "没有接入汇聚交换机",
					"solution" : "请联系系统管理员，接入汇聚交换机"
				},
				"1220003" : {
					"cause" : "指定的VPC内已经创建了路由器",
					"desc" : "指定的VPC内已经创建了路由器",
					"solution" : ""
				},
				"1220004" : {
					"cause" : "VPC中存在路由网络，不能删除路由器",
					"desc" : "VPC中存在路由网络，不能删除路由器",
					"solution" : "请先删除路由网络，再删除路由器"
				},
				"122006" : {
					"cause" : "当前组网模式不支持硬件路由器。",
					"desc" : "当前组网模式不支持硬件路由器。",
					"solution" : ""
				},
				"1221001" : {
					"cause" : "VRF 不存在",
					"desc" : "VRF 不存在",
					"solution" : "Please contact the system administrator."
				},
				"1290000" : {
					"cause" : "没有修改过管理子网，不需要进行FM管理子网恢复操作。",
					"desc" : "没有修改过管理子网，不需要进行FM管理子网恢复操作。",
					"solution" : "没有修改过管理子网，不需要进行FM管理子网恢复操作。"
				},
				"1290002" : {
					"cause" : "VSAM不存在。",
					"desc" : "VSAM不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290006" : {
					"cause" : "恢复VSAM数据失败，请重试。",
					"desc" : "恢复VSAM数据失败，请重试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290007" : {
					"cause" : "VSAM正在审计中。",
					"desc" : "VSAM正在审计中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290011" : {
					"cause" : "添加或者删除静态ip-mac绑定，mac重复。",
					"desc" : "添加或者删除静态ip-mac绑定，mac重复。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290012" : {
					"cause" : "VSA虚拟机不存在。",
					"desc" : "VSA虚拟机不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290013" : {
					"cause" : "VSA上DHCP服务功能未开启。",
					"desc" : "VSA上DHCP服务功能未开启。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290035" : {
					"cause" : "dhcp服务器上有任务正在运行，请稍后再试。",
					"desc" : "dhcp服务器上有任务正在运行，请稍后再试。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290044" : {
					"cause" : "DHCP relay服务异常。",
					"desc" : "DHCP relay服务异常。",
					"solution" : "请稍后重试。"
				},
				"1290045" : {
					"cause" : "接口IP段冲突。",
					"desc" : "接口IP段冲突。",
					"solution" : "请换一个子网IP重新尝试。"
				},
				"1290047" : {
					"cause" : "vsa非管理状态，不对外提供服务。",
					"desc" : "vsa非管理状态，不对外提供服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290048" : {
					"cause" : "VSA虚拟机没有注册服务，无法提供服务。",
					"desc" : "VSA虚拟机没有注册服务，无法提供服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290049" : {
					"cause" : "IpsecVpn连接数量超过上限。",
					"desc" : "IpsecVpn连接数量超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290050" : {
					"cause" : "本地通信IP非法。",
					"desc" : "本地通信IP非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290051" : {
					"cause" : "本地通信IP不在外部接口上。",
					"desc" : "本地通信IP不在外部接口上。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290052" : {
					"cause" : "本地内部子网非法。",
					"desc" : "本地内部子网非法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290053" : {
					"cause" : "本地内部子网冲突。",
					"desc" : "本地内部子网冲突。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290054" : {
					"cause" : "本地内部子网不在内部接口上。",
					"desc" : "本地内部子网不在内部接口上。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290055" : {
					"cause" : "内部子网数量超过上限。",
					"desc" : "内部子网数量超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290056" : {
					"cause" : "vsa非稳态，不对外提供服务。",
					"desc" : "vsa非稳态，不对外提供服务。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290057" : {
					"cause" : "名称不合法。",
					"desc" : "名称不合法。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290058" : {
					"cause" : "IpsecVpn网关不存在。",
					"desc" : "IpsecVpn网关不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290059" : {
					"cause" : "limit和offset必须同时输入或者同时不输入。",
					"desc" : "limit和offset必须同时输入或者同时不输入。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290060" : {
					"cause" : "IpsecVpn网关上已经配置IpsecVpn连接信息。",
					"desc" : "IpsecVpn网关上已经配置IpsecVpn连接信息。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290061" : {
					"cause" : "IpsecVpn服务异常。",
					"desc" : "IpsecVpn服务异常。",
					"solution" : "请联系技术支持工程师。"
				},
				"1290062" : {
					"cause" : "IpsecVpn连接不存在。",
					"desc" : "IpsecVpn连接不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310002" : {
					"cause" : "该安全组中的安全规则数超过上限。",
					"desc" : "该安全组中的安全规则数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310003" : {
					"cause" : "安全规则不存在。",
					"desc" : "安全规则不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310023" : {
					"cause" : "网卡不属于安全组所在的VPC内。",
					"desc" : "网卡不属于安全组所在的VPC内。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310024" : {
					"cause" : "网卡所属的网络类型不允许网卡加入安全组。",
					"desc" : "网卡所属的网络类型不允许网卡加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310025" : {
					"cause" : "待添加成员已经加入安全组，不允许再加入其他安全组。",
					"desc" : "待添加成员已经加入安全组，不允许再加入其他安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310027" : {
					"cause" : "待退出安全组的成员不存在。",
					"desc" : "待退出安全组的成员不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310029" : {
					"cause" : "网卡不属于FusionComputer，不能进行安全组操作。",
					"desc" : "网卡不属于FusionComputer，不能进行安全组操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310030" : {
					"cause" : "安全组审计中，无法进行操作。",
					"desc" : "安全组审计中，无法进行操作。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310031" : {
					"cause" : "网卡正在加入安全组。",
					"desc" : "网卡正在加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310032" : {
					"cause" : "网卡正在退出安全组。",
					"desc" : "网卡正在退出安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310033" : {
					"cause" : "安全组中的成员数超过上限。",
					"desc" : "安全组中的成员数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310034" : {
					"cause" : "网卡类型不适合加入安全组。",
					"desc" : "网卡类型不适合加入安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310050" : {
					"cause" : "当前VPC下有同名的安全组。",
					"desc" : "当前VPC下有同名的安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310051" : {
					"cause" : "当前VPC下的安全组总数超过上限。",
					"desc" : "当前VPC下的安全组总数超过上限。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310052" : {
					"cause" : "安全组不存在。",
					"desc" : "安全组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310053" : {
					"cause" : "安全组被授权访问其他安全组。",
					"desc" : "安全组被授权访问其他安全组。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310054" : {
					"cause" : "安全组中有成员。",
					"desc" : "安全组中有成员。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310059" : {
					"cause" : "被授权的安全组不存在。",
					"desc" : "被授权的安全组不存在。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310063" : {
					"cause" : "安全规则处于创建中。",
					"desc" : "安全规则处于创建中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310064" : {
					"cause" : "安全规则处于删除中。",
					"desc" : "安全规则处于删除中。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310065" : {
					"cause" : "vpc下没有FusionComputer资源。",
					"desc" : "vpc下没有FusionComputer资源。",
					"solution" : "请联系技术支持工程师。"
				},
				"1310067" : {
					"cause" : "删除失败，请先将虚拟机网卡退出安全组再删除。",
					"desc" : "删除失败，请先将虚拟机网卡退出安全组再删除。",
					"solution" : "请先将虚拟机网卡退出安全组再删除。"
				},
				"1410021" : {
					"cause" : "挂载块存储失败，虚拟机所在的vpc和块存储所在的vpc不是同一个。",
					"desc" : "挂载块存储失败，虚拟机所在的vpc和块存储所在的vpc不是同一个。",
					"solution" : "请检查虚拟机与块存储。"
				},
				"1502006" : {
					"cause" : "vtep信息不完整。",
					"desc" : "vtep信息不完整。",
					"solution" : "输入完整的vtep信息。"
				},
				"1502007" : {
					"cause" : "vtep ip不正确。",
					"desc" : "vtep ip不正确。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502008" : {
					"cause" : "vtep mask必须介于0-32之间。",
					"desc" : "vtep mask必须介于0-32之间。",
					"solution" : "输入正确的vtep信息。"
				},
				"1502009" : {
					"cause" : "vtep gw不正确。",
					"desc" : "vtep gw不正确。",
					"solution" : "输入正确的vtep信息。"
				},
				"1600016" : {
					"cause" : "资源不属于该可用分区.",
					"desc" : "资源不属于该可用分区.",
					"solution" : "请联系技术支持工程师。"
				},
				"1502010" : {
					"cause" : "vtep vlan必须介于0-4094之间。",
					"desc" : "vtep vlan必须介于0-4094之间。",
					"solution" : "输入正确的vtep信息。"
				},
				"1002435" : {
					"cause" : "虚拟机与磁盘位置不兼容，不能绑定。",
					"desc" : "虚拟机与磁盘位置不兼容，不能绑定。",
					"solution" : "请联系技术支持工程师。"
				},
				"5103002" : {
					"cause" : "资源已经存在.",
					"desc" : "资源已经存在.",
					"solution" : "请联系系统管理员."
				},	            
				"1162019" : {
					"cause" : "当前网络被DNAT使用。",
					"desc" : "当前网络被DNAT使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"1162020" : {
					"cause" : "当前网络被EIP使用。",
					"desc" : "当前网络被EIP使用。",
					"solution" : "请联系技术支持工程师。"
				},
				"5103017" : {
					"cause" : "资源不存在.",
					"desc" : "资源不存在.",
					"solution" : "请联系系统管理员."
				}
			};
			window.exceptionMap = window.exceptionMap || {};
			_.extend(window.exceptionMap, exceptionMap);
			return window.exceptionMap;
		});