define([], function() {
	var exceptionMap = {
		"900001" : {
			"cause" : "连接Ftp服务失败。",
			"desc" : "连接Ftp服务失败，更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请联系技术支持工程师。"
		},
		"900002" : {
			"cause" : "连接Ftp服务失败。",
			"desc" : "连接Ftp服务失败，更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请联系技术支持工程师。"
		},
		"900003" : {
			"cause" : "上传文件失败。",
			"desc" : "上传文件失败。可能原因有：1.网络不稳定； 2.填写的当前用户登录密码错误；3.系统存储空间不足。更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请确保网络稳定后再重试。"
		},
		"900004" : {
			"cause" : "上传文件失败。",
			"desc" : "上传文件失败。可能原因有：1.网络不稳定； 2.填写的当前用户登录密码错误；3.系统存储空间不足。更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请确保网络稳定后再重试。"
		},
		"900006" : {
			"cause" : "选择的文件不存在或文件内容为空。",
			"desc" : "选择的文件不存在或文件内容为空。",
			"solution" : "选择的文件不存在或文件内容为空。"
		},
		"900007" : {
			"cause" : "选择的文件不存在或文件内容为空。",
			"desc" : "选择的文件不存在或文件内容为空。",
			"solution" : "选择的文件不存在或文件内容为空。"
		},
		"900008" : {
			"cause" : "上传文件失败。",
			"desc" : "上传文件失败。可能原因有：1.网络不稳定； 2.填写的当前用户登录密码错误；3.系统存储空间不足。更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请确保网络稳定后再重试。"
		},
		"900009" : {
			"cause" : "上传文件失败。",
			"desc" : "上传文件失败。可能原因有：1.网络不稳定； 2.填写的当前用户登录密码错误；3.系统存储空间不足。更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请确保网络稳定后再重试。"
		},
		"900010" : {
			"cause" : "上传文件失败。",
			"desc" : "上传文件失败。可能原因有：1.网络不稳定； 2.填写的当前用户登录密码错误；3.系统存储空间不足。更多信息请参考联机帮助“软件包”页面的FAQ。",
			"solution" : "请确保网络稳定后再重试。"
		},
		"900011" : {
			"cause" : "磁盘空间不足。",
			"desc" : "磁盘空间不足。",
			"solution" : "请参考帮助文档处理。"
		}
	};
	return exceptionMap;
});