define([], function() {
	var exceptionMap = {
		"0000000001" : {
			"cause" : "内部错误。",
			"desc" : "内部错误。",
			"solution" : ""
		},
		"0000010002" : {
			"cause" : "参数错误。",
			"desc" : "参数错误。",
			"solution" : "请检查输入参数，确认输入参数无误。"
		},
		"0003010010" : {
			"cause" : "用户名不能使用保留字。",
			"desc" : "用户名不能使用保留字。",
			"solution" : "请重新输入用户名。"
		},
		"0000030001" : {
			"cause" : "没有该操作权限。",
			"desc" : "没有该操作权限。",
			"solution" : "请确认是否拥有该功能的操作权限。"
		},
		"0003000001" : {
			"cause" : "数据长度校验失败。",
			"desc" : "数据长度校验失败。",
			"solution" : ""
		},
		"0003000002" : {
			"cause" : "数据格式不合法。",
			"desc" : "数据格式不合法。",
			"solution" : ""
		},
		"0003000003" : {
			"cause" : "操作名称ID不存在。",
			"desc" : "操作名称ID不存在。",
			"solution" : ""
		},
		"0003000004" : {
			"cause" : "操作类型不存在。",
			"desc" : "操作类型不存在。",
			"solution" : ""
		},
		"0003000006" : {
			"cause" : "操作级别不存在。",
			"desc" : "操作级别不存在。",
			"solution" : ""
		},
		"0003000007" : {
			"cause" : "用户IP不存在。",
			"desc" : "用户IP不存在。",
			"solution" : ""
		},
		"0003000009" : {
			"cause" : "操作结果不能为空。",
			"desc" : "操作结果不能为空。",
			"solution" : ""
		},
		"0003000010" : {
			"cause" : "失败原因不能为空。",
			"desc" : "失败原因不能为空。",
			"solution" : ""
		},
		"0003000011" : {
			"cause" : "序列号不存在。",
			"desc" : "序列号不存在。",
			"solution" : ""
		},
		"0003001001" : {
			"cause" : "用户名已经存在。",
			"desc" : "用户名已经存在。",
			"solution" : "该用户名已存在，请重新输入。"
		},
		"0003001002" : {
			"cause" : "密码不符合密码策略。",
			"desc" : "密码不符合密码策略。",
			"solution" : "请检查密码，确认密码符合密码策略中各项规则。"
		},
		"0003001003" : {
			"cause" : "系统管理员数量已达到最大值。",
			"desc" : "系统管理员数量已达到最大值。",
			"solution" : "系统管理员数量已达到系统最大值，请删除不需要的系统管理员后再尝试创建，请慎重操作。"
		},
		"0003001004" : {
			"cause" : "当前用户正在使用中，无法删除。",
			"desc" : "当前用户正在使用中，无法删除。",
			"solution" : "当前用户正在使用中，无法删除。"
		},
		"0003001005" : {
			"cause" : "不能删除默认用户。",
			"desc" : "不能删除默认用户。",
			"solution" : "默认用户无法删除。"
		},
		"0003001006" : {
			"cause" : "被删除用户不存在。",
			"desc" : "被删除用户不存在。",
			"solution" : "请刷新界面，确认该用户是否存在。"
		},
		"0003001007" : {
			"cause" : "不能冻结自己。",
			"desc" : "不能冻结自己。",
			"solution" : ""
		},
		"0003001008" : {
			"cause" : "不能冻结默认用户。",
			"desc" : "不能冻结默认用户。",
			"solution" : ""
		},
		"0003001009" : {
			"cause" : "手机号码错误。",
			"desc" : "手机号码错误。",
			"solution" : "请确认输入的手机号码是否正确。"
		},
		"0003001010" : {
			"cause" : "邮箱错误。",
			"desc" : "邮箱错误。",
			"solution" : "请确认输入的邮箱是否正确。"
		},
		"0003001011" : {
			"cause" : "用户类型不存在。",
			"desc" : "用户类型不存在。",
			"solution" : "该用户类型不存在，请重新选择。"
		},
		"0003001012" : {
			"cause" : "用户不存在。",
			"desc" : "用户不存在。",
			"solution" : "请刷新界面，确认该用户是否存在。"
		},
		"0003001013" : {
			"cause" : "密码错误。",
			"desc" : "密码错误。",
			"solution" : "请输入正确密码。"
		},
		"0003001014" : {
			"cause" : "验证码错误。",
			"desc" : "验证码错误。",
			"solution" : "请输入正确验证码。"
		},
		"0003001015" : {
			"cause" : "用户被冻结。",
			"desc" : "用户被冻结。",
			"solution" : ""
		},
		"0003001016" : {
			"cause" : "用户被锁定。",
			"desc" : "用户被锁定。",
			"solution" : ""
		},
		"0003001017" : {
			"cause" : "权限ID不存在。",
			"desc" : "权限ID不存在。",
			"solution" : ""
		},
		"0003001018" : {
			"cause" : "资源ID不存在。",
			"desc" : "资源ID不存在。",
			"solution" : ""
		},
		"0003001019" : {
			"cause" : "业务管理员数量已达到最大值。",
			"desc" : "业务管理员数量已达到最大值。",
			"solution" : "业务管理员数量已达到系统最大值，请联系管理员。"
		},
		"0003001020" : {
			"cause" : "密码和确认密码不一致。",
			"desc" : "密码和确认密码不一致。",
			"solution" : "请重新输入。"
		},
		"0003001021" : {
			"cause" : "加密失败。",
			"desc" : "加密失败。",
			"solution" : "请联系系统管理员。"
		},
		"0003001022" : {
			"cause" : "解密失败。",
			"desc" : "解密失败。",
			"solution" : "请联系系统管理员。"
		},
		"0003001023" : {
			"cause" : "修改用户信息不是他本人。",
			"desc" : "修改用户信息不是他本人。",
			"solution" : "用户不可修改或删除其他用户信息。"
		},
		"0003001024" : {
			"cause" : "默认用户信息无法修改。",
			"desc" : "默认用户信息无法修改。",
			"solution" : "默认用户信息无法修改。"
		},
		"0003001025" : {
			"cause" : "不能修改自己。",
			"desc" : "不能修改自己。",
			"solution" : "如需修改当前用户信息，请点击右上角的用户名进行修改。"
		},
		"0003001026" : {
			"cause" : "角色列表不能为空。",
			"desc" : "角色列表不能为空。",
			"solution" : "角色列表不可为空，请选择角色列表。"
		},
		"0003001027" : {
			"cause" : "AD认证用户不存在。",
			"desc" : "AD认证用户不存在。",
			"solution" : "请确认AD认证用户名是否正确。"
		},
		"0003001028" : {
			"cause" : "AD认证用户密码不正确。",
			"desc" : "AD认证用户密码不正确。",
			"solution" : "请确认AD认证用户名或密码是否正确。"
		},
		"0003001029" : {
			"cause" : "AD认证用户当前时间不允许登录。",
			"desc" : "AD认证用户当前时间不允许登录。",
			"solution" : "AD认证用户不可登录AD服务器，请联系AD系统管理员。"
		},
		"0003001030" : {
			"cause" : "AD认证用户不允许从该客户端登录。",
			"desc" : "AD认证用户不允许从该客户端登录。",
			"solution" : "AD认证用户不可登录AD服务器，请联系AD系统管理员。"
		},
		"0003001031" : {
			"cause" : "AD认证用户密码过期。",
			"desc" : "AD认证用户密码过期。",
			"solution" : "AD认证用户密码已过期，请联系AD系统管理员重置密码。"
		},
		"0003001032" : {
			"cause" : "AD认证账户不可用。",
			"desc" : "AD认证账户不可用。",
			"solution" : "AD认证用户不可用，请联系AD系统管理员。"
		},
		"0003001033" : {
			"cause" : "AD认证账户过期。",
			"desc" : "AD认证账户过期。",
			"solution" : "AD认证用户已过期，请联系AD系统管理员。"
		},
		"0003001034" : {
			"cause" : "AD用户必须重设密码",
			"desc" : "AD用户必须重设密码",
			"solution" : "AD认证用户需重设密码，请在AD服务器上修改用户密码。"
		},
		"0003001035" : {
			"cause" : "AD认证账户被锁定",
			"desc" : "AD认证账户被锁定",
			"solution" : "AD认证用户被锁定，请联系AD系统管理员。"
		},
		"0003001036" : {
			"cause" : "AD用户未注册",
			"desc" : "AD用户未注册",
			"solution" : "请确认用户名和密码是否正确。"
		},
		"0003001037" : {
			"cause" : "第三方认证错误",
			"desc" : "第三方认证错误",
			"solution" : "请确认第三方认证配置信息是否正确。"
		},
		"0003001038" : {
			"cause" : "原密码错误",
			"desc" : "原密码错误",
			"solution" : "请输入正确的原密码。"
		},
		"0003001039" : {
			"cause" : "加载证书失败。",
			"desc" : "加载证书失败。",
			"solution" : "请重新加载证书。"
		},
		"0003001040" : {
			"cause" : "证书存放路径为空。",
			"desc" : "证书存放路径为空。",
			"solution" : "请重新加载证书。"
		},
		"0003001041" : {
			"cause" : "没有选择待加载的证书。",
			"desc" : "没有选择待加载的证书。",
			"solution" : "请选择待加载的证书。"
		},
		"0003001042" : {
			"cause" : "证书格式不正确。",
			"desc" : "证书格式不正确。",
			"solution" : "请确认您的证书格式是否正确。"
		},
		"0003001043" : {
			"cause" : "没有为用户在域上分配角色。",
			"desc" : "没有为用户在域上分配角色。",
			"solution" : ""
		},
		"0003001044" : {
			"cause" : "域不存在或不属于当前用户。",
			"desc" : "域不存在或不属于当前用户。",
			"solution" : ""
		},
		"0003001045" : {
			"cause" : "所要分配的角色不属于当前登录用户或者已经被删除。",
			"desc" : "所要分配的角色不属于当前登录用户或者已经被删除。",
			"solution" : ""
		},
		"0003001046" : {
			"cause" : "没有为用户在VDC上分配角色。",
			"desc" : "没有为用户在VDC上分配角色。",
			"solution" : ""
		},
		"0003001047" : {
			"cause" : "用户已经被解锁。",
			"desc" : "用户已经被解锁。",
			"solution" : ""
		},
		"0003001048" : {
			"cause" : "VDC中应至少存在一个VDC管理员。",
			"desc" : "VDC中应至少存在一个VDC管理员。",
			"solution" : ""
		},
		"0003001049" : {
			"cause" : "IP不合法。",
			"desc" : "IP不合法。",
			"solution" : ""
		},
		"0003001050" : {
			"cause" : "子网IP和掩码的与运算结果必须和子网IP相等。",
			"desc" : "子网IP和掩码的与运算结果必须和子网IP相等。",
			"solution" : "子网IP和掩码的与运算结果必须和子网IP相等。"
		},
		"0003001051" : {
			"cause" : "IP地址段的起始IP地址或结束IP地址为空。",
			"desc" : "IP地址段的起始IP地址或结束IP地址为空。",
			"solution" : "请输入正确的IP地址段范围。"
		},
		"0003001052" : {
			"cause" : "IP地址段结束IP地址小于起始IP地址。",
			"desc" : "IP地址段结束IP地址小于起始IP地址。",
			"solution" : "请确保IP地址段的结束IP地址不小于起始IP地址。"
		},
		"0003001053" : {
			"cause" : "删除前请先解锁VDC安全管理员。",
			"desc" : "删除前请先解锁VDC安全管理员。",
			"solution" : ""
		},
		"0003001054" : {
			"cause" : "不能修改用户类型。",
			"desc" : "不能修改用户类型。",
			"solution" : ""
		},
		"0003001055" : {
			"cause" : "当前场景下，密码不允许被重置。",
			"desc" : "当前场景下，密码不允许被重置。",
			"solution" : ""
		},
		"0003001056" : {
			"cause" : "当前场景下，用户不允许被修改。",
			"desc" : "当前场景下，用户不允许被修改。",
			"solution" : ""
		},
		"0003001057" : {
			"cause" : "当前场景下，用户在域上的授权关系不允许被修改或移除。",
			"desc" : "当前场景下，用户在域上的授权关系不允许被修改或移除。",
			"solution" : ""
		},
		"0003001058" : {
			"cause" : "当前场景下，该域下不允许创建子域。",
			"desc" : "当前场景下，该域下不允许创建子域。",
			"solution" : ""
		},
		"0003001059" : {
			"cause" : "当前场景下，该域下允许被删除。",
			"desc" : "当前场景下，该域下允许被删除。",
			"solution" : ""
		},
		"0003001061" : {
			"cause" : "当前场景下，用户不允许被删除。",
			"desc" : "当前场景下，用户不允许被删除。",
			"solution" : ""
		},
		"0003001062" : {
			"cause" : "用户加入的VDC数量已超过最大值。",
			"desc" : "用户加入的VDC数量已超过最大值。",
			"solution" : ""
		},
		"0003001063" : {
			"cause" : "起始或结束日期为空",
			"desc" : "起始或结束日期为空",
			"solution" : ""
		},
		"0003001064" : {
			"cause" : "起始或结束时间为空",
			"desc" : "起始或结束时间为空",
			"solution" : ""
		},
		"0003001065" : {
			"cause" : "开始日期大于结束日期",
			"desc" : "开始日期大于结束日期",
			"solution" : ""
		},
		"0003001066" : {
			"cause" : "开始时间大于结束时间",
			"desc" : "开始时间大于结束时间",
			"solution" : ""
		},
		"0003001067" : {
			"cause" : "不能锁定或解锁自己",
			"desc" : "不能锁定或解锁自己",
			"solution" : ""
		},
		"0003001069" : {
			"cause" : "用户名或密码不正确",
			"desc" : "用户名或密码不正确",
			"solution" : ""
		},
		"0003001070" : {
			"cause" : "接入Project不正确",
			"desc" : "接入Project不正确",
			"solution" : ""
		},
		"0003001071" : {
			"cause" : "用户不能为空",
			"desc" : "用户不能为空",
			"solution" : ""
		},
		"0003001072" : {
			"cause" : "租户侧不能修改系统侧用户",
			"desc" : "租户侧不能修改系统侧用户",
			"solution" : ""
		},
		"0003001073" : {
			"cause" : "用户数量已达到最大值",
			"desc" : "用户数量已达到最大值",
			"solution" : ""
		},
    		"0003001074" : {
    			"cause" : "keystone接入账户的密码不允许修改",
    			"desc" : "keystone接入账户的密码不允许修改",
    			"solution" : ""
    		},
		"0003002001" : {
			"cause" : "角色名称不符合规范。",
			"desc" : "角色名称不符合规范。",
			"solution" : "请检查角色名称，确认角色命名符合命名规则。"
		},
		"0003002002" : {
			"cause" : "角色描述超过字数限制。",
			"desc" : "角色描述超过字数限制。",
			"solution" : "描述信息超过系统最大限制128位字符。"
		},
		"0003002003" : {
			"cause" : "角色已存在。",
			"desc" : "角色已存在。",
			"solution" : "该角色名称已存在，请重新输入。"
		},
		"0003002004" : {
			"cause" : "角色数量已达最大值。",
			"desc" : "角色数量已达最大值。",
			"solution" : "角色数量已达到系统最大值，请删除不需要的角色后再尝试创建,请慎重操作。"
		},
		"0003002005" : {
			"cause" : "角色无法删除，有用户关联该角色。",
			"desc" : "角色无法删除，有用户关联该角色。",
			"solution" : "存在与该角色相关联的用户，删除角色失败。如需删除角色请先删除与该角色相关联的用户，请慎重操作。"
		},
		"0003002006" : {
			"cause" : "不能删除默认角色。",
			"desc" : "不能删除默认角色。",
			"solution" : "默认角色无法删除。"
		},
		"0003002007" : {
			"cause" : "默认角色无法修改。",
			"desc" : "默认角色无法修改。",
			"solution" : "默认角色无法修改。"
		},
		"0003002008" : {
			"cause" : "角色类型不存在。",
			"desc" : "角色类型不存在。",
			"solution" : "该角色类型不存在，请重新选择角色类型。"
		},
		"0003002009" : {
			"cause" : "角色不存在。",
			"desc" : "角色不存在。",
			"solution" : "请刷新界面，确认该角色是否存在。"
		},
		"0003002010" : {
			"cause" : "角色ID无效。",
			"desc" : "角色ID无效。",
			"solution" : ""
		},
		"0003002011" : {
			"cause" : "权限列表为空。",
			"desc" : "权限列表为空。",
			"solution" : "权限列表不可为空，请为角色选择权限。"
		},
		"0003002012" : {
			"cause" : "该角色不允许配置其在FusionCompute侧的权限。",
			"desc" : "该角色不允许配置其在FusionCompute侧的权限。",
			"solution" : ""
		},
		"0003002013" : {
			"cause" : "默认角色不允许被修改。",
			"desc" : "默认角色不允许被修改。",
			"solution" : ""
		},
		"0003002014" : {
			"cause" : "默认角色不允许被删除。",
			"desc" : "默认角色不允许被删除。",
			"solution" : ""
		},
		"0003002015" : {
			"cause" : "创建角色数目超过限制。",
			"desc" : "创建角色数目超过限制。",
			"solution" : "角色创建数目达到最大值，若需要创建角色请联系管理员 。"
		},
		"0003002016" : {
			"cause" : "公共业务类角色不允许被修改或删除。",
			"desc" : "公共业务类角色不允许被修改或删除。",
			"solution" : ""
		},
		"0003003001" : {
			"cause" : "密码长度非法。",
			"desc" : "密码长度非法。",
			"solution" : "请检查密码，确认密码符合密码策略中的长度规则。"
		},
		"0003003002" : {
			"cause" : "密码必须包含特殊字符。",
			"desc" : "密码必须包含特殊字符。",
			"solution" : "请检查密码，密码必须包含特殊字符。"
		},
		"0003003003" : {
			"cause" : "密码修改时间间隔过短。",
			"desc" : "密码修改时间间隔过短。",
			"solution" : "您修改密码时间间隔过短，请稍候修改。"
		},
		"0003003004" : {
			"cause" : "密码重复使用非法。",
			"desc" : "密码重复使用非法。",
			"solution" : "请使用您最近没有使用过的密码。"
		},
		"0003003005" : {
			"cause" : "密码不能包含用户名或用户名逆序。",
			"desc" : "密码不能包含用户名或用户名逆序。",
			"solution" : "请检查密码，确认密码中不包含用户名或用户名逆序。"
		},
		"0003003006" : {
			"cause" : "修改密码策略失败。",
			"desc" : "修改密码策略失败。",
			"solution" : ""
		},
		"0003003007" : {
			"cause" : "密码必须包含大小写字母，数字和特殊字符中的两种以上组合。",
			"desc" : "密码必须包含大小写字母，数字和特殊字符中的两种以上组合。",
			"solution" : ""
		},
		"0003004001" : {
			"cause" : "该VDC不存在。",
			"desc" : "该VDC不存在。",
			"solution" : ""
		},
		"0003004002" : {
			"cause" : "该用户不是VDC成员。",
			"desc" : "该用户不是VDC成员。",
			"solution" : ""
		},
		"0003004003" : {
			"cause" : "VDC名已经存在。",
			"desc" : "VDC名已经存在。",
			"solution" : ""
		},
		"0003004004" : {
			"cause" : "VDC数量已达最大值。",
			"desc" : "VDC数量已达最大值。",
			"solution" : ""
		},
		"0003004005" : {
			"cause" : "VDC无法删除，该VDC分配有VDC。",
			"desc" : "VDC无法删除，该VDC分配有VDC。",
			"solution" : ""
		},
		"0003004006" : {
			"cause" : "VDC无法删除，该VDC分配有VDC网络。",
			"desc" : "VDC无法删除，该VDC分配有VDC网络。",
			"solution" : ""
		},
		"0003004007" : {
			"cause" : "VDC无法删除，该VDC下存在虚拟机模板。",
			"desc" : "VDC无法删除，该VDC下存在虚拟机模板。",
			"solution" : ""
		},
		"0003004008" : {
			"cause" : "VDC无法删除，该VDC下存在软件包。",
			"desc" : "VDC无法删除，该VDC下存在软件包。",
			"solution" : ""
		},
		"0003004009" : {
			"cause" : "VDC无法删除，该VDC下存在ISO。",
			"desc" : "VDC无法删除，该VDC下存在ISO。",
			"solution" : ""
		},
		"0003004010" : {
			"cause" : "该VDC不存在或用户不是该VDC成员。",
			"desc" : "该VDC不存在或用户不是该VDC成员。",
			"solution" : ""
		},
		"0003004011" : {
			"cause" : "默认VDC不允许被修改。",
			"desc" : "默认VDC不允许被修改。",
			"solution" : ""
		},
		"0003004012" : {
			"cause" : "默认VDC不允许被删除。",
			"desc" : "默认VDC不允许被删除。",
			"solution" : ""
		},
		"0003004013" : {
			"cause" : "当前场景下，VDC成员不允许被修改。",
			"desc" : "当前场景下，VDC成员不允许被修改。",
			"solution" : ""
		},
		"0003004014" : {
			"cause" : "当前场景下，VDC成员不允许被删除。",
			"desc" : "当前场景下，VDC成员不允许被删除。",
			"solution" : ""
		},
		"0003004015" : {
			"cause" : "系统管理员在VDC中不允许被升级。",
			"desc" : "系统管理员在VDC中不允许被升级。",
			"solution" : ""
		},
		"0003004016" : {
			"cause" : "默认VDC名称不允许修改。",
			"desc" : "默认VDC名称不允许修改。",
			"solution" : ""
		},
		"0003004017" : {
			"cause" : "添加VDC关联AZ部分失败。",
			"desc" : "添加VDC关联AZ部分失败。",
			"solution" : ""
		},
		"0003004018" : {
			"cause" : "添加VDC关联AZ失败。",
			"desc" : "添加VDC关联AZ失败。",
			"solution" : ""
		},
		"0003004019" : {
			"cause" : "VDC配额超出配置限制。",
			"desc" : "VDC配额超出配置限制。",
			"solution" : ""
		},
		"0003004020" : {
			"cause" : "VDC中存在资源, 不能删除。",
			"desc" : "VDC中存在资源, 不能删除。",
			"solution" : ""
		},
		"0003004021" : {
			"cause" : "CPU值不能小于已使用的值。",
			"desc" : "CPU值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004022" : {
			"cause" : "内存值不能小于已使用的值。",
			"desc" : "内存值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004023" : {
			"cause" : "存储值不能小于已使用的值。",
			"desc" : "存储值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004024" : {
			"cause" : "VPC值不能小于已使用的值。",
			"desc" : "VPC值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004025" : {
			"cause" : "弹性IP值不能小于已使用的值。",
			"desc" : "弹性IP值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004026" : {
			"cause" : "安全组值不能小于已使用的值。",
			"desc" : "安全组值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004027" : {
			"cause" : "虚拟机值不能小于已使用的值。",
			"desc" : "虚拟机值不能小于已使用的值。",
			"solution" : ""
		},
		"0003004028" : {
			"cause" : "修改的配额值小于已分配给系统配额总量。",
			"desc" : "修改的配额值小于已分配给系统配额总量。",
			"solution" : ""
		},
		"0003004029" : {
			"cause" : "keystone接入账户不允许加入VDC。",
			"desc" : "keystone接入账户不允许加入VDC。",
			"solution" : ""
		},
		"0003004030" : {
			"cause" : "批量查询时数量超过限制。",
			"desc" : "批量查询时数量超过限制。",
			"solution" : ""
		},
		"0003004031" : {
			"cause" : "VDC AZ下有资源，不允许删除。",
			"desc" : "VDC AZ下有资源，不允许删除。",
			"solution" : ""
		},
		"0003004032" : {
			"cause" : "VDC AZ下有资源，不允许修改。",
			"desc" : "VDC AZ下有资源，不允许修改。",
			"solution" : ""
		},
		"0003004033" : {
			"cause" : "不能删除最后一个VDC管理员或将其修改为非VDC管理员。",
			"desc" : "不能删除最后一个VDC管理员或将其修改为非VDC管理员。",
			"solution" : ""
		},
		"0003004034" : {
			"cause" : "云资源池连接有异常, 请排查后再删除VDC。",
			"desc" : "云资源池连接有异常, 请排查后再删除VDC。",
			"solution" : ""
		},
		"0003004035": {
		"cause":"VDC下有VPC配额为不限制, 请先改为限制后再修改此VDC配额",
		"desc":"VDC下有VPC配额为不限制, 请先改为限制后再修改此VDC配额",
		"solution":""
		},
		"0003004036" : {
			"cause" : "VDC云资源池下有资源，不允许删除。",
			"desc" : "VDC云资源池下有资源，不允许删除。",
			"solution" : ""
		},
		"0003004037" : {
			"cause" : "VDC云资源池下有资源，不允许修改。",
			"desc" : "VDC云资源池下有资源，不允许修改。",
			"solution" : ""
		},		
		"0003005001" : {
			"cause" : "没有该操作权限。",
			"desc" : "没有该操作权限。",
			"solution" : "请确认是否拥有该功能的操作权限。"
		},
		"0003005002" : {
			"cause" : "系统异常。",
			"desc" : "系统异常。",
			"solution" : "请联系技术支持工程师。"
		},
		"0003005005" : {
			"cause" : "排序方式错误。",
			"desc" : "排序方式错误。",
			"solution" : ""
		},
		"0003005006" : {
			"cause" : "查询条数错误。",
			"desc" : "查询条数错误。",
			"solution" : ""
		},
		"0003005007" : {
			"cause" : "应用名称不存在。",
			"desc" : "应用名称不存在。",
			"solution" : ""
		},
		"0003005008" : {
			"cause" : "时间不符合规范。",
			"desc" : "时间不符合规范。",
			"solution" : ""
		},
		"0003005009" : {
			"cause" : "通信异常。",
			"desc" : "通信异常。",
			"solution" : ""
		},
		"0003006001" : {
			"cause" : "域已经在系统中存在。",
			"desc" : "域已经在系统中存在。",
			"solution" : "域名已存在，请重新设置。"
		},
		"0003006002" : {
			"cause" : "域数量已经达到最大值",
			"desc" : "域数量已经达到最大值",
			"solution" : "域的数量已达到系统最大值，请删除不需要的域后再尝试创建，请慎重操作。"
		},
		"0003006003" : {
			"cause" : "域中存在资源或用户。",
			"desc" : "域中存在资源或用户。",
			"solution" : "该域中存在资源或用户，不能删除域或创建子域。如需删除域或创建子域请先移除该域中的资源和用户，请慎重操作。"
		},
		"0003006004" : {
			"cause" : "默认域不允许被删除。",
			"desc" : "默认域不允许被删除。",
			"solution" : "默认域无法删除。"
		},
		"0003006005" : {
			"cause" : "默认域不允许被修改。",
			"desc" : "默认域不允许被修改。",
			"solution" : "默认域的信息无法修改。"
		},
		"0003006006" : {
			"cause" : "域不存在。",
			"desc" : "域不存在。",
			"solution" : "请刷新界面，检查该域是否存在。"
		},
		"0003006007" : {
			"cause" : "非域节点无法删除。",
			"desc" : "非域节点无法删除。",
			"solution" : "请刷新界面，查看该节点是否可删除。"
		},
		"0003006008" : {
			"cause" : "该域不存在父节点。",
			"desc" : "该域不存在父节点。",
			"solution" : "请刷新界面，检查该域是否存在父节点。"
		},
		"0003006009" : {
			"cause" : "该用户在当前域节点上的授权关系已经被删除。",
			"desc" : "该用户在当前域节点上的授权关系已经被删除。",
			"solution" : "请刷新界面，检查在当前域节点上是是否存在授权关系。"
		},
		"0003006010" : {
			"cause" : "域名称已存在。",
			"desc" : "域名称已存在。",
			"solution" : "请刷新界面，重新输入一个新的域名称。"
		},
		"0003007001" : {
			"cause" : "有导出任务正在执行，请稍后再试。",
			"desc" : "有导出任务正在执行，请稍后再试。",
			"solution" : "有导出任务正在执行，请稍后再试。"
		}
	};
	return exceptionMap;
})