define([], function() {
	var exceptionMap = {
		"0008000000" : {
			"cause" : "内部错误。",
			"desc" : "内部错误。",
			"solution" : ""
		},
		"0008000005" : {
			"cause" : "邮件发送测试失败。",
			"desc" : "邮件发送测试失败。",
			"solution" : ""
		},
		"0008000105" : {
			"cause" : "该类告警已经被取消屏蔽。",
			"desc" : "该类告警已经被取消屏蔽。",
			"solution" : "请重新选择需要取消屏蔽的告警。"
		},
		"0008000111" : {
			"cause" : "单次添加的屏蔽数量超出规格，一次最多允许屏蔽100条。",
			"desc" : "单次添加的屏蔽数量超出规格，一次最多允许屏蔽100条。",
			"solution" : "请重新选择需要屏蔽的告警。"
		},
		"0008000121" : {
			"cause" : "开始时间不能为空。",
			"desc" : "开始时间不能为空。",
			"solution" : ""
		},
		"0008000122" : {
			"cause" : "结束时间不能为空。",
			"desc" : "结束时间不能为空。",
			"solution" : ""
		},
		"0008000123" : {
			"cause" : "开始时间不能大于结束时间。",
			"desc" : "开始时间不能大于结束时间。",
			"solution" : ""
		},
		"0008000124" : {
			"cause" : "日期参数错误。",
			"desc" : "日期参数错误。",
			"solution" : ""
		},
		"0008000200" : {
			"cause" : "内部错误。",
			"desc" : "内部错误。",
			"solution" : "请联系管理人员或者查看帮助。"
		},
		"0008000202" : {
			"cause" : "内部错误。",
			"desc" : "内部错误。",
			"solution" : "请联系管理人员或者查看帮助。"
		},
		"0008000203" : {
			"cause" : "当前暂未收到恢复告警，等待超时，请稍后查询历史告警。",
			"desc" : "当前暂未收到恢复告警，等待超时，请稍后查询历史告警。",
			"solution" : "请联系管理人员或者查看帮助。"
		},
		"0008000204" : {
			"cause" : "该告警不支持手工清除。",
			"desc" : "该告警不支持手工清除。",
			"solution" : "请联系管理人员或查看手工帮助。"
		},
		"0008000205" : {
			"cause" : "该告警已经被清除。",
			"desc" : "该告警已经被清除。",
			"solution" : "请联系管理人员或查看手工帮助。"
		},
		"0008000206" : {
			"cause" : "该告警已经不存在了。",
			"desc" : "该告警已经不存在了。",
			"solution" : "请联系管理人员或查看手工帮助。"
		},
		"0008000304" : {
			"cause" : "接收邮箱已经存在。",
			"desc" : "接收邮箱已经存在。",
			"solution" : "请重新选择接收邮箱。"
		},
		"0008000400" : {
			"cause" : "SNMP的IP地址已经存在。",
			"desc" : "SNMP的IP地址已经存在。",
			"solution" : "请重新选择SNMP的IP地址。"
		},
		"0008000410" : {
			"cause" : "修改告警阈值失败。",
			"desc" : "修改告警阈值失败。",
			"solution" : "请联系技术支持工程师。"
		},
		"0008000411" : {
			"cause" : "该类告警已经被屏蔽。",
			"desc" : "该类告警已经被屏蔽。",
			"solution" : "请重新选择需要屏蔽的告警。"
		},
		"0008000412" : {
			"cause" : "修改告警阈值失败，告警阈值的数值应满足：紧急告警>重要告警>次要告警>提示告警。",
			"desc" : "修改告警阈值失败，告警阈值的数值应满足：紧急告警>重要告警>次要告警>提示告警。",
			"solution" : "请重新输入正确的数值。"
		},
		"0008220024" : {
			"cause" : "邮件服务器地址或端口配置错误，或者发送邮箱和对应的密码不匹配。",
			"desc" : "邮件服务器地址或端口配置错误，或者发送邮箱和对应的密码不匹配。",
			"solution" : ""
		},
		"0008220034" : {
			"cause" : "请重新配置正确的服务器地址或端口并检查发送邮箱和对应的密码是否匹配，或者联系管理人员。",
			"desc" : "请重新配置正确的服务器地址或端口并检查发送邮箱和对应的密码是否匹配，或者联系管理人员。",
			"solution" : ""
		}
	};
	return exceptionMap;
})