define([], function () {
    var exceptionMap = {
        "0000010006": {
            "cause":"请求内容包含非法字符。",
            "desc":"服务器已收到请求，但无法处理请求内容。",
            "solution":"请修改输入内容后再重新操作。"
        },
		"0000010013": {
            "cause":"图片非法，支持类型为ICO且最大128K的图片。",
            "desc":"图片非法，支持类型为ICO且最大128K的图片。",
            "solution":"图片非法，支持类型为ICO且最大128K的图片。"
        },
		"0000010014": {
            "cause":"图片非法，支持类型为PNG、像素48*48且最大128K的图片。",
            "desc":"图片非法，支持类型为PNG、像素48*48且最大128K的图片。",
            "solution":"图片非法，支持类型为PNG、像素48*48且最大128K的图片。"
        }
	};
    return exceptionMap;
})
