define([], function() {
			var exceptionMap = {
				"4000011" : {
					"cause" : "外部系统通信异常，如返回为空或字段不符等",
					"desc" : "外部系统通信异常，如返回为空或字段不符等",
					"solution" : "请联系管理员或查看帮助手册"
				},
				"4000018" : {
					"cause" : "系统资源不足",
					"desc" : "系统资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"4001008" : {
					"cause" : "该虚拟机模板数据损坏或虚拟机模板不存在",
					"desc" : "该虚拟机模板数据损坏或虚拟机模板不存在",
					"solution" : "请删除此虚拟机模板"
				},
				"4002005" : {
					"cause" : "虚拟机模板不存在",
					"desc" : "虚拟机模板不存在",
					"solution" : "请联系技术支持工程师"
				},
				"4002015" : {
					"cause" : "输入的参数不符合规范",
					"desc" : "输入的参数不符合规范",
					"solution" : "请按照名称输入规范重新输入参数"
				},
				"4002019" : {
					"cause" : "输入的参数不符合规范",
					"desc" : "输入的参数不符合规范",
					"solution" : "请按照描述输入规范重新输入参数"
				},
				"4002071" : {
					"cause" : "服务器处于维护模式时不允许创建虚拟机",
					"desc" : "服务器处于维护模式时不允许创建虚拟机",
					"solution" : "请联系管理员"
				},
				"4002082" : {
					"cause" : "配置的虚拟CPU预留不符合规范",
					"desc" : "配置的虚拟CPU预留不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002083" : {
					"cause" : "配置的虚拟CPU份额不符合规范",
					"desc" : "配置的虚拟CPU份额不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002084" : {
					"cause" : "配置的虚拟CPU限制不符合规范",
					"desc" : "配置的虚拟CPU限制不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002085" : {
					"cause" : "配置的虚拟机内存个数不符合规范",
					"desc" : "配置的虚拟机内存个数不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002086" : {
					"cause" : "配置的虚拟机内存份额不符合规范",
					"desc" : "配置的虚拟机内存份额不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002087" : {
					"cause" : "硬盘编号不合法",
					"desc" : "硬盘编号不合法",
					"solution" : "请联系管理员"
				},
				"4002088" : {
					"cause" : "配置的虚拟机硬盘大小不符合规范",
					"desc" : "配置的虚拟机硬盘大小不符合规范",
					"solution" : "查看帮助手册"
				},
				"4002089" : {
					"cause" : "虚拟机硬盘超过最大数量",
					"desc" : "虚拟机硬盘超过最大数量",
					"solution" : "请联系技术支持工程师"
				},
				"4002091" : {
					"cause" : "虚拟机网卡网络为空",
					"desc" : "虚拟机网卡网络为空",
					"solution" : "请联系管理员"
				},
				"4002092" : {
					"cause" : "配置的虚拟机网卡数量超过系统最大值",
					"desc" : "配置的虚拟机网卡数量超过系统最大值",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002093" : {
					"cause" : "配置启动虚拟机不符合规范",
					"desc" : "配置启动虚拟机不符合规范",
					"solution" : "请联系管理员"
				},
				"4002094" : {
					"cause" : "虚拟机故障处理策略不符合规范",
					"desc" : "虚拟机故障处理策略不符合规范",
					"solution" : "请联系管理员"
				},
				"4002096" : {
					"cause" : "虚拟机Tools未启动",
					"desc" : "虚拟机Tools未启动",
					"solution" : "请联系管理员"
				},
				"4002097" : {
					"cause" : "指定节点不存在",
					"desc" : "指定节点不存在",
					"solution" : "请联系管理员"
				},
				"4002098" : {
					"cause" : "服务器不存在",
					"desc" : "服务器不存在",
					"solution" : "请联系技术支持工程师"
				},
				"4002099" : {
					"cause" : "指定的逻辑资源集群不存在",
					"desc" : "指定的逻辑资源集群不存在",
					"solution" : "请刷新界面查看相关的资源集群是否存在或联系管理员"
				},
				"4002110" : {
					"cause" : "配置的虚拟机内存限制不符合规范",
					"desc" : "配置的虚拟机内存限制不符合规范",
					"solution" : "参数错误"
				},
				"4002111" : {
					"cause" : "操作系统类型不正确",
					"desc" : "操作系统类型不正确",
					"solution" : "请根据下拉列表选项重新选择"
				},
				"4002112" : {
					"cause" : "操作系统版本不正确",
					"desc" : "操作系统版本不正确",
					"solution" : "请根据下拉列表选项重新选择"
				},
				"4002113" : {
					"cause" : "配置的虚拟CPU预留值不符合规范",
					"desc" : "配置的虚拟CPU预留值不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002114" : {
					"cause" : "配置的虚拟机内存预留值不符合规范",
					"desc" : "配置的虚拟机内存预留值不符合规范",
					"solution" : "请查看帮助手册，根据规范重新配置"
				},
				"4002115" : {
					"cause" : "MAC地址重复",
					"desc" : "MAC地址重复",
					"solution" : "请联系管理员"
				},
				"4002117" : {
					"cause" : "MAC资源不足",
					"desc" : "MAC资源不足",
					"solution" : "请联系管理员"
				},
				"4002121" : {
					"cause" : "MAC地址不合法",
					"desc" : "MAC地址不合法",
					"solution" : "请联系管理员"
				},
				"4002123" : {
					"cause" : "集群或主机不能为空",
					"desc" : "集群或主机不能为空",
					"solution" : "请联系技术支持工程师"
				},
				"4002124" : {
					"cause" : "数据存储标识必选",
					"desc" : "数据存储标识必选",
					"solution" : "请选择数据存储标识"
				},
				"4002125" : {
					"cause" : "操作系统类型不能为空",
					"desc" : "操作系统类型不能为空",
					"solution" : "请选择操作系统类型"
				},
				"4002127" : {
					"cause" : "硬盘插槽号不能重复",
					"desc" : "硬盘插槽号不能重复",
					"solution" : "请联系管理员"
				},
				"4002133" : {
					"cause" : "目标节点/集群没有满足虚拟机运行的存储条件",
					"desc" : "目标节点/集群没有满足虚拟机运行的存储条件",
					"solution" : "请联系管理员"
				},
				"4002134" : {
					"cause" : "目标节点/集群没有满足虚拟机运行的网络条件",
					"desc" : "目标节点/集群没有满足虚拟机运行的网络条件",
					"solution" : "请联系管理员"
				},
				"4002136" : {
					"cause" : "已存在的磁盘不能挂载此虚拟机上（该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了或该磁盘状态不允许挂载）",
					"desc" : "已存在的磁盘不能挂载此虚拟机上（该磁盘非共享且已挂载到虚拟机上或该磁盘共享但已经挂载到4个虚拟机上了或该磁盘状态不允许挂载）",
					"solution" : "请联系管理员"
				},
				"4002137" : {
					"cause" : "单个虚拟机最多只能挂载4个共享磁盘",
					"desc" : "单个虚拟机最多只能挂载4个共享磁盘",
					"solution" : "请联系技术支持工程师"
				},
				"4002138" : {
					"cause" : "指定虚拟存在该共享磁盘时不允许重复挂载",
					"desc" : "指定虚拟存在该共享磁盘时不允许重复挂载",
					"solution" : "请联系管理员"
				},
				"4002140" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4002146" : {
					"cause" : "指定集群或主机下不存在存储条件满足虚拟机启动的节点",
					"desc" : "指定集群或主机下不存在存储条件满足虚拟机启动的节点",
					"solution" : "请联系技术支持工程师"
				},
				"4002147" : {
					"cause" : "指定集群或主机下不存在网络条件满足虚拟机启动的节点",
					"desc" : "指定集群或主机下不存在网络条件满足虚拟机启动的节点",
					"solution" : "请联系技术支持工程师"
				},
				"4002227" : {
					"cause" : "虚拟机网卡网络不存在",
					"desc" : "虚拟机网卡网络不存在",
					"solution" : "请联系管理员"
				},
				"4002286" : {
					"cause" : "虚拟机正在执行此操作",
					"desc" : "虚拟机正在执行此操作",
					"solution" : "请联系技术支持工程师"
				},
				"4002288" : {
					"cause" : "虚拟机已经为停止状态或休眠状态，不能执行该操作",
					"desc" : "虚拟机已经为停止状态或休眠状态，不能执行该操作",
					"solution" : "请联系技术支持工程师"
				},
				"4002289" : {
					"cause" : "虚拟机正在休眠中",
					"desc" : "虚拟机正在休眠中",
					"solution" : "请联系技术支持工程师"
				},
				"4002295" : {
					"cause" : "当前虚拟机所在服务器已挂载光驱，不能进行挂载",
					"desc" : "当前虚拟机所在服务器已挂载光驱，不能进行挂载",
					"solution" : "请联系管理员"
				},
				"4002312" : {
					"cause" : "该虚拟机存在快照，无法转化为模板",
					"desc" : "该虚拟机存在快照，无法转化为模板",
					"solution" : "请删除该虚拟机的快照后重试"
				},
				"4002358" : {
					"cause" : "虚拟机模板正在用于创建虚拟机，不能进行该操作",
					"desc" : "虚拟机模板正在用于创建虚拟机，不能进行该操作",
					"solution" : "请稍后重试"
				},
				"4002366" : {
					"cause" : "无法找到该虚拟机模板信息",
					"desc" : "无法找到该虚拟机模板信息",
					"solution" : "请联系技术支持工程师"
				},
				"4002371" : {
					"cause" : "CPU资源不足",
					"desc" : "CPU资源不足",
					"solution" : "请联系管理员"
				},
				"4002372" : {
					"cause" : "内存资源不足",
					"desc" : "内存资源不足",
					"solution" : "请联系管理员"
				},
				"4002373" : {
					"cause" : "超过可用主机的网卡上限",
					"desc" : "超过可用主机的网卡上限",
					"solution" : "请联系管理员"
				},
				"4002374" : {
					"cause" : "供选择的主机均异常",
					"desc" : "供选择的主机均异常",
					"solution" : "请联系管理员"
				},
				"4002375" : {
					"cause" : "供选择的主机均处于维护模式",
					"desc" : "供选择的主机均处于维护模式",
					"solution" : "请联系管理员"
				},
				"4002376" : {
					"cause" : "供选择的主机均不可用",
					"desc" : "供选择的主机均不可用",
					"solution" : "请联系管理员"
				},
				"4002377" : {
					"cause" : "无供选择的主机",
					"desc" : "无供选择的主机",
					"solution" : "请联系管理员"
				},
				"4002504" : {
					"cause" : "存在链接克隆虚拟机的模板不能转为虚拟机",
					"desc" : "存在链接克隆虚拟机的模板不能转为虚拟机",
					"solution" : "请选择其他虚拟机模板进行操作"
				},
				"4040015" : {
					"cause" : "与虚拟化环境断开连接。",
					"desc" : "与虚拟化环境断开连接。",
					"solution" : "请联系技术支持工程师。"
				},
				"4040024" : {
					"cause" : "资源集群不存在",
					"desc" : "资源集群不存在",
					"solution" : "请重新选择资源集群"
				},
				"4040143" : {
					"cause" : "待创建的虚拟机核数超过集群下主机最大的cpu核数",
					"desc" : "待创建的虚拟机核数超过集群下主机最大的cpu核数",
					"solution" : "请确认虚拟机核数合法"
				},
				"4070007" : {
					"cause" : "所选虚拟机不是由虚拟机模板创建，不能修复",
					"desc" : "所选虚拟机不是由虚拟机模板创建，不能修复",
					"solution" : "请联系技术支持工程师"
				},
				"4070008" : {
					"cause" : "待修复虚拟机磁盘已经达到上限，不能修复",
					"desc" : "待修复虚拟机磁盘已经达到上限，不能修复",
					"solution" : "请联系技术支持工程师"
				},
				"4070022" : {
					"cause" : "虚拟机状态冲突，只有运行中或已停止状态才能修复",
					"desc" : "虚拟机状态冲突，只有运行中或已停止状态才能修复",
					"solution" : "请确认虚拟机状态后再试"
				},
				"4070045" : {
					"cause" : "虚拟机模板正在发现中",
					"desc" : "虚拟机模板正在发现中",
					"solution" : "请联系技术支持工程师"
				},
				"4070529" : {
					"cause" : "虚拟机操作系统不支持打开CPU热插开关",
					"desc" : "虚拟机操作系统不支持打开CPU热插开关",
					"solution" : "请更换操作系统后重试"
				},
				"4070530" : {
					"cause" : "虚拟机不支持启用CPU热插拔",
					"desc" : "虚拟机不支持启用CPU热插拔",
					"solution" : "请联系技术支持工程师"
				},
				"4070531" : {
					"cause" : "CPU热插拔开关非法",
					"desc" : "CPU热插拔开关非法",
					"solution" : "请选择合适的CPU热插拔开关"
				},
				"4070532" : {
					"cause" : "虚拟机操作系统不支持打开内存热插开关",
					"desc" : "虚拟机操作系统不支持打开内存热插开关",
					"solution" : "请联系技术支持工程师"
				},
				"4070533" : {
					"cause" : "内存热插拔开关非法",
					"desc" : "内存热插拔开关非法",
					"solution" : "请选择合适的内存热插拔开关"
				},
				"4100001" : {
					"cause" : "缺少必选参数",
					"desc" : "缺少必选参数",
					"solution" : "请检查参数"
				},
				"4410011" : {
					"cause" : "集群下存储介质为“SAN-SATA”类型的数据存储资源不足",
					"desc" : "集群下存储介质为“SAN-SATA”类型的数据存储资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"4410012" : {
					"cause" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足",
					"desc" : "集群下存储介质为“SAN-Any”类型的数据存储资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"4410013" : {
					"cause" : "集群下存储介质为“SAN-SSD”类型的数据存储资源不足",
					"desc" : "集群下存储介质为“SAN-SSD”类型的数据存储资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"4410014" : {
					"cause" : "集群下存储介质为“SAN-SAS&FC”类型的数据存储资源不足",
					"desc" : "集群下存储介质为“SAN-SAS&FC”类型的数据存储资源不足",
					"solution" : "请联系技术支持工程师"
				},
				"4410015" : {
					"cause" : "集群下存储资源不足或者无法找到满足虚拟机能够正常启动的存储",
					"desc" : "集群下存储资源不足或者无法找到满足虚拟机能够正常启动的存储",
					"solution" : "请联系技术支持工程师"
				},
				"4410018" : {
					"cause" : "指定的存储资源不足或者无法使虚拟机正常启动",
					"desc" : "指定的存储资源不足或者无法使虚拟机正常启动",
					"solution" : "指定的存储资源不足或者无法使虚拟机正常启动"
				},
				"4800000" : {
					"cause" : "内部服务异常",
					"desc" : "内部服务异常",
					"solution" : "请联系系统管理员"
				},
				"4800001" : {
					"cause" : "参数错误.",
					"desc" : "参数错误.",
					"solution" : "请输入合法参数."
				},
				"4800012" : {
					"cause" : "没有匹配的虚拟机模板",
					"desc" : "没有匹配的虚拟机模板",
					"solution" : "请创建匹配的虚拟机模板"
				},
				"4810001" : {
					"cause" : "用户无操作权限.",
					"desc" : "用户无操作权限.",
					"solution" : "请联系系统管理员."
				},
				"4820016" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4820026" : {
					"cause" : "获取虚拟机信息失败",
					"desc" : "获取虚拟机信息失败",
					"solution" : "请联系管理员"
				},
				"4820033" : {
					"cause" : "策略不存在",
					"desc" : "策略不存在",
					"solution" : "请检查当前策略是否存在"
				},
				"4822001" : {
					"cause" : "输入的参数错误.",
					"desc" : "输入的参数错误.",
					"solution" : "请输入合法参数."
				},
				"4822027" : {
					"cause" : "内部服务错误.",
					"desc" : "内部服务错误.",
					"solution" : "请联系系统管理员."
				},
				"4823002" : {
					"cause" : "调用IRM失败.",
					"desc" : "调用IRM失败.",
					"solution" : "请联系系统管理员."
				},
				"4823003" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823004" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823005" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823006" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823007" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823008" : {
					"cause" : "VM 数据库异常.",
					"desc" : "VM 数据库异常.",
					"solution" : "请联系系统管理员."
				},
				"4823010" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823011" : {
					"cause" : "虚拟机模板不存在.",
					"desc" : "虚拟机模板不存在.",
					"solution" : "请联系系统管理员."
				},
				"4823012" : {
					"cause" : "虚拟机创建失败，不能制作成模板",
					"desc" : "虚拟机创建失败，不能制作成模板",
					"solution" : "请删除创建失败的虚拟机模板并重新创建"
				},
				"4823014" : {
					"cause" : "系统异常",
					"desc" : "系统异常",
					"solution" : "请联系技术支持工程师"
				},
				"4823016" : {
					"cause" : "共享文件路径不可为空",
					"desc" : "共享文件路径不可为空",
					"solution" : "请填写文件路径"
				},
				"4823017" : {
					"cause" : "注册状态不能删除.",
					"desc" : "注册状态不能删除.",
					"solution" : "请联系系统管理员."
				},
				"4823018" : {
					"cause" : "该虚拟机模板已经创建完成，不能进行该操作",
					"desc" : "该虚拟机模板已经创建完成，不能进行该操作",
					"solution" : "请联系管理员"
				},
				"4823019" : {
					"cause" : "启动虚拟机失败",
					"desc" : "启动虚拟机失败",
					"solution" : "请联系技术支持工程师"
				},
				"4823020" : {
					"cause" : "只有创建完成的虚拟机模板才可以修改",
					"desc" : "只有创建完成的虚拟机模板才可以修改",
					"solution" : "请刷新页面后重试"
				},
				"4823021" : {
					"cause" : "把模板转换为虚拟机时出错",
					"desc" : "把模板转换为虚拟机时出错",
					"solution" : "请稍后重试或联系管理员"
				},
				"4823022" : {
					"cause" : "虚拟机模板正被其他用户锁定，操作不允许.",
					"desc" : "虚拟机模板正被其他用户锁定，操作不允许.",
					"solution" : "请联系系统管理员."
				},
				"4823023" : {
					"cause" : "用户所在域与资源所在域不匹配，操作不允许.",
					"desc" : "用户所在域与资源所在域不匹配，操作不允许.",
					"solution" : "请联系系统管理员."
				},
				"4823024" : {
					"cause" : "不存在可用的资源集群，无法创建虚拟机模板",
					"desc" : "不存在可用的资源集群，无法创建虚拟机模板",
					"solution" : "请联系管理员添加资源集群"
				},
				"4823036" : {
					"cause" : "虚拟机当前不支持VNC登录",
					"desc" : "虚拟机当前不支持VNC登录",
					"solution" : "请稍后重试或启动虚拟机"
				},
				"4823037" : {
					"cause" : "虚拟机模板名称重复",
					"desc" : "虚拟机模板名称重复",
					"solution" : "请重新输入虚拟机模板名称"
				},
				"4823038" : {
					"cause" : "只有未创建完成的虚拟机模板才能安装软件",
					"desc" : "只有未创建完成的虚拟机模板才能安装软件",
					"solution" : "请刷新后重试"
				},
				"4823040" : {
					"cause" : "虚拟机为休眠状态，不能执行该操作",
					"desc" : "虚拟机为休眠状态，不能执行该操作",
					"solution" : "请启动该虚拟机后重试"
				},
				"4823047" : {
					"cause" : "虚拟机模板状态不允许修改",
					"desc" : "虚拟机模板状态不允许修改",
					"solution" : "请检查虚拟机模板状态"
				},
				"4823049" : {
					"cause" : "删除NFS模板失败",
					"desc" : "删除NFS模板失败",
					"solution" : "请联系管理员"
				},
				"4823058" : {
					"cause" : "虚拟机模板状态冲突，不允许此操作.",
					"desc" : "虚拟机模板状态冲突，不允许此操作.",
					"solution" : "请状态正常后再操作."
				},
				"4823059" : {
					"cause" : "虚拟机模板描述信息参数非法",
					"desc" : "虚拟机模板描述信息参数非法",
					"solution" : "请修改描述信息参数后重试"
				},
				"4823060" : {
					"cause" : "虚拟机模板升级模式参数非法",
					"desc" : "虚拟机模板升级模式参数非法",
					"solution" : "请修改升级模式参数后重试"
				},
				"4823061" : {
					"cause" : "虚拟机模板基本块设备热迁移参数非法",
					"desc" : "虚拟机模板基本块设备热迁移参数非法",
					"solution" : "请修改基本块设备热迁移参数后重试"
				},
				"4823062" : {
					"cause" : "虚拟机模板图标参数非法",
					"desc" : "虚拟机模板图标参数非法",
					"solution" : "请修改图标参数后重试"
				},
				"4823063" : {
					"cause" : "虚拟机模板CPU参数非法",
					"desc" : "虚拟机模板CPU参数非法",
					"solution" : "请修改CPU参数后重试"
				},
				"4823064" : {
					"cause" : "虚拟机模板内存参数非法",
					"desc" : "虚拟机模板内存参数非法",
					"solution" : "请修改内存参数后重试"
				},
				"4823065" : {
					"cause" : "虚拟机模板磁盘参数非法",
					"desc" : "虚拟机模板磁盘参数非法",
					"solution" : "请修改磁盘参数后重试"
				},
				"4823066" : {
					"cause" : "虚拟机模板网卡参数非法",
					"desc" : "虚拟机模板网卡参数非法",
					"solution" : "请修改网卡参数后重试"
				},
				"4823067" : {
					"cause" : "虚拟机模板操作系统参数非法",
					"desc" : "虚拟机模板操作系统参数非法",
					"solution" : "请修改操作系统参数后重试"
				},
				"4823068" : {
					"cause" : "虚拟机模板名称参数非法",
					"desc" : "虚拟机模板名称参数非法",
					"solution" : "请修改名称参数后重试"
				},
				"4823069" : {
					"cause" : "虚拟机模板集群参数非法",
					"desc" : "虚拟机模板集群参数非法",
					"solution" : "请修改集群参数后重试"
				},
				"4823070" : {
					"cause" : "虚拟机模板已关联逻辑模板，删除失败",
					"desc" : "虚拟机模板已关联逻辑模板，删除失败",
					"solution" : "请取消关联，再进行删除"
				},
				"4823071" : {
					"cause" : "虚拟机模板已被应用使用，删除失败",
					"desc" : "虚拟机模板已被应用使用，删除失败",
					"solution" : "请删除应用，再进行删除"
				},
				"4823072" : {
					"cause" : "镜像文件大小超过限制（最大6GB）",
					"desc" : "镜像文件大小超过限制（最大6GB）",
					"solution" : "请直接在FSP上进行操作"
				},
				"4823073" : {
					"cause" : "系统存储空间不足，同步失败",
					"desc" : "系统存储空间不足，同步失败",
					"solution" : "请联系技术支持工程师"
				},
				"4823074" : {
					"cause" : "向Openstack转发镜像文件失败，请检查Openstack环境是否正常后，在Openstack上上传镜像文件或删除已创建的镜像重新注册",
					"desc" : "向Openstack转发镜像文件失败，请检查Openstack环境是否正常后，在Openstack上上传镜像文件或删除已创建的镜像重新注册",
					"solution" : "请联系技术支持工程师"
				},
				"4825000" : {
					"cause" : "虚拟机逻辑模板未关联虚拟机模板.",
					"desc" : "虚拟机逻辑模板未关联虚拟机模板.",
					"solution" : "请联系系统管理员."
				},
				"4825001" : {
					"cause" : "虚拟模板不存在关联关系",
					"desc" : "虚拟模板不存在关联关系",
					"solution" : "请联系管理员"
				},
				"4825002" : {
					"cause" : "虚拟机逻辑模板不存在.",
					"desc" : "虚拟机逻辑模板不存在.",
					"solution" : "请联系系统管理员."
				},
				"4825003" : {
					"cause" : "查询已关联的集群信息异常.",
					"desc" : "查询已关联的集群信息异常.",
					"solution" : "请联系系统管理员."
				},
				"4825007" : {
					"cause" : "虚拟机逻辑模板为激活状态，不允许取消关联",
					"desc" : "虚拟机逻辑模板为激活状态，不允许取消关联",
					"solution" : "请去激活虚拟机逻辑模板后重试"
				},
				"4825011" : {
					"cause" : "虚拟机模板丢失",
					"desc" : "虚拟机模板丢失",
					"solution" : "请联系管理员"
				},
				"4825012" : {
					"cause" : "虚拟机逻辑模板状态为激活，不允许进行关联或者解关联操作",
					"desc" : "虚拟机逻辑模板状态为激活，不允许进行关联或者解关联操作",
					"solution" : "请去激活虚拟机逻辑模板后重试"
				},
				"4825015" : {
					"cause" : "逻辑模板状态未更新.",
					"desc" : "逻辑模板状态未更新.",
					"solution" : "请更新逻辑模板状态."
				},
				"4825016" : {
					"cause" : "逻辑模板操作系统版本号不匹配，关联失败",
					"desc" : "逻辑模板操作系统版本号不匹配，关联失败",
					"solution" : "请联系管理员"
				},
				"4825017" : {
					"cause" : "逻辑模板系统磁盘大小不匹配，关联失败",
					"desc" : "逻辑模板系统磁盘大小不匹配，关联失败",
					"solution" : "请联系管理员"
				},
				"4825018" : {
					"cause" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的操作系统版本号.",
					"desc" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的操作系统版本号.",
					"solution" : "请联系系统管理员."
				},
				"4825019" : {
					"cause" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的系统磁盘.",
					"desc" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的系统磁盘.",
					"solution" : "请联系系统管理员."
				},
				"4825020" : {
					"cause" : "虚拟机逻辑模板状态为激活，不能修改.",
					"desc" : "虚拟机逻辑模板状态为激活，不能修改.",
					"solution" : "请联系系统管理员."
				},
				"4825022" : {
					"cause" : "虚拟机模板未创建完成，不允许关联逻辑模板",
					"desc" : "虚拟机模板未创建完成，不允许关联逻辑模板",
					"solution" : "请创建完成后重试"
				},
				"4825023" : {
					"cause" : "虚拟机逻辑模板处于激活状态，不允许删除.",
					"desc" : "虚拟机逻辑模板处于激活状态，不允许删除.",
					"solution" : "请联系系统管理员."
				},
				"4825025" : {
					"cause" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的操作系统类型.",
					"desc" : "已有虚拟机模板与逻辑模板关联，不允许修改逻辑模板的操作系统类型.",
					"solution" : "请联系系统管理员."
				},
				"4825111" : {
					"cause" : "虚拟机逻辑模板名称重复.",
					"desc" : "虚拟机逻辑模板名称重复.",
					"solution" : "请联系系统管理员."
				},
				"4825113" : {
					"cause" : "虚拟机模板已关联逻辑模板",
					"desc" : "虚拟机模板已关联逻辑模板",
					"solution" : "请去关联后重试"
				},
				"4825116" : {
					"cause" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"desc" : "同一集群下已有虚拟机模板与逻辑模板关联",
					"solution" : "请查看已关联的虚拟机模板"
				},
				"4825117" : {
					"cause" : "虚拟机模板数量达到系统限定最大值",
					"desc" : "虚拟机模板数量达到系统限定最大值",
					"solution" : "删除不用的虚拟机模板，请慎重操作"
				},
				"4825118" : {
					"cause" : "虚拟机模板数量达到系统限定最大值",
					"desc" : "虚拟机模板数量达到系统限定最大值",
					"solution" : "删除不用的虚拟机模板，请慎重操作"
				},
				"4840002" : {
					"cause" : "数据库连接异常.",
					"desc" : "数据库连接异常.",
					"solution" : "请联系系统管理员."
				},
				"4840005" : {
					"cause" : "存入数据库错误.",
					"desc" : "存入数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"4840006" : {
					"cause" : "查询数据库错误.",
					"desc" : "查询数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"4840007" : {
					"cause" : "删除数据库错误.",
					"desc" : "删除数据库错误.",
					"solution" : "请联系系统管理员."
				},
				"4840014" : {
					"cause" : "CPU个数超过最大限制",
					"desc" : "CPU个数超过最大限制",
					"solution" : "请确认cpu个数合法"
				},
				"4880001" : {
					"cause" : "缺少必选参数.",
					"desc" : "缺少必选参数.",
					"solution" : "请输入必选参数."
				},
				"4880002" : {
					"cause" : "输入的参数不合法.",
					"desc" : "输入的参数不合法.",
					"solution" : "请输入合法参数."
				},
				"4880003" : {
					"cause" : "虚拟机规格不存在.",
					"desc" : "虚拟机规格不存在.",
					"solution" : "请联系系统管理员."
				},
				"4880004" : {
					"cause" : "虚拟机规格名称已存在.",
					"desc" : "虚拟机规格名称已存在.",
					"solution" : "请输入其他虚拟机规格名称."
				},
				"4880005" : {
					"cause" : "磁盘序号重复.",
					"desc" : "磁盘序号重复.",
					"solution" : "请输入其他磁盘序号."
				},
				"4880006" : {
					"cause" : "虚拟机规格数量已满.",
					"desc" : "虚拟机规格数量已满.",
					"solution" : "请联系系统管理员."
				},
				"4410020" : {
					"cause" : "指定主机下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"desc" : "指定主机下存储资源不足或者无法找到满足虚拟机能够正常启动的存储。",
					"solution" : "请联系技术支持工程师。"
				}
			};
			return exceptionMap;
		})